whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*
 * Hardware register defines for Microchip PIC32MZ microcontroller.
 *
 * Copyright (C) 2013 Serge Vakulenko
 *
 * Permission to use, copy, modify, and distribute this software
 * and its documentation for any purpose and without fee is hereby
 * granted, provided that the above copyright notice appear in all
 * copies and that both that the copyright notice and this
 * permission notice and warranty disclaimer appear in supporting
 * documentation, and that the name of the author not be used in
 * advertising or publicity pertaining to distribution of the
 * software without specific, written prior permission.
 *
 * The author disclaim all warranties with regard to this
 * software, including all implied warranties of merchantability
 * and fitness.  In no event shall the author be liable for any
 * special, indirect or consequential damages or any damages
 * whatsoever resulting from loss of use, data or profits, whether
 * in an action of contract, negligence or other tortious action,
 * arising out of or in connection with the use or performance of
 * this software.
 */
#ifndef _IO_PIC32MZ_H
#define _IO_PIC32MZ_H

#ifdef __LANGUAGE_ASSEMBLY__
#define _CP0_STATUS_BEV_MASK                   (1 << 22)

#define _CP0_INDEX                             $0, 0
#define _CP0_INX                               $0, 0
#define _CP0_RANDOM                            $1, 0
#define _CP0_RAND                              $1, 0
#define _CP0_ENTRYLO0                          $2, 0
#define _CP0_TLBLO0                            $2, 0
#define _CP0_ENTRYLO1                          $3, 0
#define _CP0_TLBLO1                            $3, 0
#define _CP0_CONTEXT                           $4, 0
#define _CP0_CTXT                              $4, 0
#define _CP0_USERLOCAL                         $4, 2
#define _CP0_PAGEMASK                          $5, 0
#define _CP0_PAGEGRAIN                         $5, 1
#define _CP0_WIRED                             $6, 0
#define _CP0_HWRENA                            $7, 0
#define _CP0_BADVADDR                          $8, 0
#define _CP0_COUNT                             $9, 0
#define _CP0_ENTRYHI                           $10, 0
#define _CP0_COMPARE                           $11, 0
#define _CP0_STATUS                            $12, 0
#define _CP0_INTCTL                            $12, 1
#define _CP0_SRSCTL                            $12, 2
#define _CP0_SRSMAP                            $12, 3
#define _CP0_VIEW_IPL                          $12, 4
#define _CP0_SRSMAP2                           $12, 5
#define _CP0_CAUSE                             $13, 0
#define _CP0_VIEW_RIPL                         $13, 1
#define _CP0_NESTEDEXC                         $13, 2
#define _CP0_EPC                               $14, 0
#define _CP0_NESTEDEPC                         $14, 2
#define _CP0_PRID                              $15, 0
#define _CP0_EBASE                             $15, 1
#define _CP0_CDMMBASE                          $15, 2
#define _CP0_CONFIG                            $16, 0
#define _CP0_CONFIG1                           $16, 1
#define _CP0_CONFIG2                           $16, 2
#define _CP0_CONFIG3                           $16, 3
#define _CP0_CONFIG4                           $16, 4
#define _CP0_CONFIG5                           $16, 5
#define _CP0_CONFIG7                           $16, 7
#define _CP0_LLADDR                            $17, 0
#define _CP0_WATCHLO                           $18, 0
#define _CP0_WATCHHI                           $19, 0
#define _CP0_DEBUG                             $23, 0
#define _CP0_TRACECONTROL                      $23, 1
#define _CP0_TRACECONTROL2                     $23, 2
#define _CP0_USERTRACEDATA                     $23, 3
#define _CP0_TRACEBPC                          $23, 4
#define _CP0_DEBUG2                            $23, 5
#define _CP0_DEPC                              $24, 0
#define _CP0_USERTRACEDATA2                    $24, 1
#define _CP0_PERFCNT0_CONTROL                  $25, 0
#define _CP0_PERFCNT0_COUNT                    $25, 1
#define _CP0_PERFCNT1_CONTROL                  $25, 2
#define _CP0_PERFCNT1_COUNT                    $25, 3
#define _CP0_ERRCTL                            $26, 0
#define _CP0_CACHEERR                          $27, 0
#define _CP0_TAGLO                             $28, 0
#define _CP0_DATALO                            $28, 1
#define _CP0_ERROREPC                          $30, 0
#define _CP0_DESAVE                            $31, 0
#else
#define _CP0_COUNT                            9
#define _CP0_COMPARE					  	  11
#define _CP0_INTCTL                           11
#define _CP0_STATUS                           12
#define _CP0_CAUSE                            13
#define _CP0_EPC                              14
#define _CP0_EBASE                            15
#endif

#define _CP0_GET_CAUSE()       mips_mfc0 (_CP0_CAUSE, 0)
#define _CP0_SET_CAUSE(val)    mips_mtc0 (_CP0_CAUSE, 0, val)


#define UNLOCK_KEY_0					( 0xAA996655UL )
#define UNLOCK_KEY_1					( 0x556699AAUL )

#define _IFS0_CTIF_POSITION                      0x00000000
#define _IFS0_CTIF_MASK                          0x00000001
#define _IFS0_CTIF_LENGTH                        0x00000001

#define _IFS0_CS0IF_POSITION                     0x00000001
#define _IFS0_CS0IF_MASK                         0x00000002
#define _IFS0_CS0IF_LENGTH                       0x00000001

#define _IFS0_CS1IF_POSITION                     0x00000002
#define _IFS0_CS1IF_MASK                         0x00000004
#define _IFS0_CS1IF_LENGTH                       0x00000001

#define _IFS0_INT0IF_POSITION                    0x00000003
#define _IFS0_INT0IF_MASK                        0x00000008
#define _IFS0_INT0IF_LENGTH                      0x00000001

#define _IFS0_T1IF_POSITION                      0x00000004
#define _IFS0_T1IF_MASK                          0x00000010
#define _IFS0_T1IF_LENGTH                        0x00000001

#define _IFS0_IC1EIF_POSITION                    0x00000005
#define _IFS0_IC1EIF_MASK                        0x00000020
#define _IFS0_IC1EIF_LENGTH                      0x00000001

#define _IFS0_IC1IF_POSITION                     0x00000006
#define _IFS0_IC1IF_MASK                         0x00000040
#define _IFS0_IC1IF_LENGTH                       0x00000001

#define _IFS0_OC1IF_POSITION                     0x00000007
#define _IFS0_OC1IF_MASK                         0x00000080
#define _IFS0_OC1IF_LENGTH                       0x00000001

