whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*
 * Сause register.
 */
#define CA_BD           0x80000000      /* Exception occured in delay slot */
#define CA_TI           0x40000000      /* Timer interrupt is pending */
#define CA_CE           0x30000000      /* Coprocessor exception */
#define CA_DC           0x08000000      /* Disable COUNT register */
#define CA_IV           0x00800000      /* Use special interrupt vector 0x200 */
#define CA_RIPL(r)      ((r)>>10 & 63)  /* Requested interrupt priority level */
#define CA_IP1          0x00020000      /* Request software interrupt 1 */
#define CA_IP0          0x00010000      /* Request software interrupt 0 */
#define CA_EXC_CODE     0x0000007c      /* Exception code */

#define CA_Int          0               /* Interrupt */
#define CA_AdEL         (4 << 2)        /* Address error, load or instruction fetch */
#define CA_AdES         (5 << 2)        /* Address error, store */
#define CA_IBE          (6 << 2)        /* Bus error, instruction fetch */
#define CA_DBE          (7 << 2)        /* Bus error, load or store */
#define CA_Sys          (8 << 2)        /* Syscall */
#define CA_Bp           (9 << 2)        /* Breakpoint */
#define CA_RI           (10 << 2)       /* Reserved instruction */
#define CA_CPU          (11 << 2)       /* Coprocessor unusable */
#define CA_Ov           (12 << 2)       /* Arithmetic overflow */
#define CA_Tr           (13 << 2)       /* Trap */

#define DB_DBD          (1 << 31)       /* Debug exception in a branch delay slot */
#define DB_DM           (1 << 30)       /* Debug mode */
#define DB_NODCR        (1 << 29)       /* No dseg present */
#define DB_LSNM         (1 << 28)       /* Load/stores in dseg go to main memory */
#define DB_DOZE         (1 << 27)       /* Processor was in low-power mode */
#define DB_HALT         (1 << 26)       /* Internal system bus clock was running */
#define DB_COUNTDM      (1 << 25)       /* Count register is running in Debug mode */
#define DB_IBUSEP       (1 << 24)       /* Instruction fetch bus error exception */
#define DB_DBUSEP       (1 << 21)       /* Data access bus error exception */
#define DB_IEXI         (1 << 20)       /* Imprecise error exception */
#define DB_VER          (7 << 15)       /* EJTAG version number */
#define DB_DEXCCODE     (0x1f << 10)    /* Cause of exception in Debug mode */
#define DB_SST          (1 << 8)        /* Single step exception enabled */
#define DB_DIBImpr      (1 << 6)        /* Imprecise debug instruction break */
#define DB_DINT         (1 << 5)        /* Debug interrupt exception */
#define DB_DIB          (1 << 4)        /* Debug instruction break exception */
#define DB_DDBS         (1 << 3)        /* Debug data break exception on store */
#define DB_DDBL         (1 << 2)        /* Debug data break exception on load */
#define DB_DBP          (1 << 1)        /* Debug software breakpoint exception */
#define DB_DSS          (1 << 0)        /* Debug single-step exception */


/*
 * Register memory map:
 *
 *  BF80 0000...03FF    Configuration
 *  BF80 0600...07FF    Flash Controller
 *  BF80 0800...09FF    Watchdog Timer
 *  BF80 0A00...0BFF    Deadman Timer
 *  BF80 0C00...0DFF    RTCC
 *  BF80 0E00...0FFF    CVref
 *  BF80 1200...13FF    Oscillator
 *  BF80 1400...17FF    PPS
 *
 *  BF81 0000...0FFF    Interrupt Controller
 *  BF81 1000...1FFF    DMA
 *
 *  BF82 0000...09FF    I2C1 - I2C5
 *  BF82 1000...1BFF    SPI1 - SPI6
 *  BF82 2000...2BFF    UART1 - UART6
 *  BF82 E000...E1FF    PMP
 *
 *  BF84 0000...11FF    Timer1 - Timer9
 *  BF84 2000...31FF    IC1 - IC9
 *  BF84 4000...51FF    OC1 - OC9
 *  BF84 B000...B3FF    ADC1
 *  BF84 C000...C1FF    Comparator 1, 2
 *
 *  BF86 0000...09FF    PORTA - PORTK
 *
 *  BF88 0000...1FFF    CAN1 and CAN2
 *  BF88 2000...2FFF    Ethernet
 *
 *  BF8E 0000...0FFF    Prefetch
 *  BF8E 1000...1FFF    EBI
 *  BF8E 2000...2FFF    SQI1
 *  BF8E 3000...3FFF    USB
 *  BF8E 5000...5FFF    Crypto
 *  BF8E 6000...6FFF    RNG
 *
 *  BF8F 0000...FFFF    System Bus
 */

/*--------------------------------------
 * Configuration registers.
 */
#define DEVCFG0         0x9fc0fffc
#define DEVCFG1         0x9fc0fff8
#define DEVCFG2         0x9fc0fff4
#define DEVCFG3         0x9fc0fff0

#define DEVCFG0_UNUSED          0xbfc00880
#define DEVCFG1_UNUSED          0x00003800
#define DEVCFG2_UNUSED          0xbff88008
#define DEVCFG3_UNUSED          0x84ff0000

#define PIC32_DEVCFG(cfg0, cfg1, cfg2, cfg3) \
    unsigned __DEVCFG0 __attribute__ ((section(".config0"))) = (cfg0) | DEVCFG0_UNUSED; \
    unsigned __DEVCFG1 __attribute__ ((section(".config1"))) = (cfg1) | DEVCFG1_UNUSED; \
    unsigned __DEVCFG2 __attribute__ ((section(".config2"))) = (cfg2) | DEVCFG2_UNUSED; \
    unsigned __DEVCFG3 __attribute__ ((section(".config3"))) = (cfg3) | DEVCFG3_UNUSED

#define DEVCFG3_FMIIEN_OFF	0x00000000	/* RMII Enabled */
#define DEVCFG3_FMIIEN_ON	0x01000000	/* MII Enabled */
#define DEVCFG3_FETHIO_OFF	0x00000000	/* Alternate Ethernet I/O */
#define DEVCFG3_FETHIO_ON	0x02000000	/* Default Ethernet I/O */
#define DEVCFG3_PGL1WAY_OFF	0x00000000	/* Allow multiple reconfigurations */
#define DEVCFG3_PGL1WAY_ON	0x08000000	/* Allow only one reconfiguration */
#define DEVCFG3_PMDL1WAY_OFF	0x00000000	/* Allow multiple reconfigurations */
#define DEVCFG3_PMDL1WAY_ON	0x10000000	/* Allow only one reconfiguration */
#define DEVCFG3_IOL1WAY_OFF	0x00000000	/* Allow multiple reconfigurations */
#define DEVCFG3_IOL1WAY_ON	0x20000000	/* Allow only one reconfiguration */
#define DEVCFG3_FUSBIDIO_OFF	0x00000000	/* Controlled by Port Function */
#define DEVCFG3_FUSBIDIO_ON	0x40000000	/* Controlled by the USB Module */
#define DEVCFG2_FPLLIDIV_DIV_1	0x00000000	/* 1x Divider */
#define DEVCFG2_FPLLIDIV_DIV_2	0x00000001	/* 2x Divider */
#define DEVCFG2_FPLLIDIV_DIV_3	0x00000002	/* 3x Divider */
#define DEVCFG2_FPLLIDIV_DIV_4	0x00000003	/* 4x Divider */
#define DEVCFG2_FPLLIDIV_DIV_5	0x00000004	/* 5x Divider */
#define DEVCFG2_FPLLIDIV_DIV_6	0x00000005	/* 6x Divider */
#define DEVCFG2_FPLLIDIV_DIV_7	0x00000006	/* 7x Divider */
#define DEVCFG2_FPLLIDIV_DIV_8	0x00000007	/* 8x Divider */
#define DEVCFG2_FPLLRNG_RANGE_BYPASS	0x00000000	/* Bypass */
#define DEVCFG2_FPLLRNG_RANGE_5_10_MHZ	0x00000010	/* 5-10 MHz Input */
#define DEVCFG2_FPLLRNG_RANGE_8_16_MHZ	0x00000020	/* 8-16 MHz Input */
#define DEVCFG2_FPLLRNG_RANGE_13_26_MHZ	0x00000030	/* 13-26 MHz Input */
#define DEVCFG2_FPLLRNG_RANGE_21_42_MHZ	0x00000040	/* 21-42 MHz Input */
#define DEVCFG2_FPLLRNG_RANGE_34_68_MHZ	0x00000050	/* 34-68 MHz Input */
#define DEVCFG2_FPLLICLK_PLL_POSC	0x00000000	/* POSC is input to the System PLL */
#define DEVCFG2_FPLLICLK_PLL_FRC	0x00000080	/* FRC is input to the System PLL */
#define DEVCFG2_FPLLMULT_MUL_1	0x00000000	/* PLL Multiply by 1 */
#define DEVCFG2_FPLLMULT_MUL_2	0x00000100	/* PLL Multiply by 2 */
#define DEVCFG2_FPLLMULT_MUL_3	0x00000200	/* PLL Multiply by 3 */
#define DEVCFG2_FPLLMULT_MUL_4	0x00000300	/* PLL Multiply by 4 */
#define DEVCFG2_FPLLMULT_MUL_5	0x00000400	/* PLL Multiply by 5 */
#define DEVCFG2_FPLLMULT_MUL_6	0x00000500	/* PLL Multiply by 6 */
#define DEVCFG2_FPLLMULT_MUL_7	0x00000600	/* PLL Multiply by 7 */
#define DEVCFG2_FPLLMULT_MUL_8	0x00000700	/* PLL Multiply by 8 */
#define DEVCFG2_FPLLMULT_MUL_9	0x00000800	/* PLL Multiply by 9 */
#define DEVCFG2_FPLLMULT_MUL_10	0x00000900	/* PLL Multiply by 10 */
#define DEVCFG2_FPLLMULT_MUL_11	0x00000A00	/* PLL Multiply by 11 */
#define DEVCFG2_FPLLMULT_MUL_12	0x00000B00	/* PLL Multiply by 12 */
#define DEVCFG2_FPLLMULT_MUL_13	0x00000C00	/* PLL Multiply by 13 */
#define DEVCFG2_FPLLMULT_MUL_14	0x00000D00	/* PLL Multiply by 14 */
#define DEVCFG2_FPLLMULT_MUL_15	0x00000E00	/* PLL Multiply by 15 */
#define DEVCFG2_FPLLMULT_MUL_16	0x00000F00	/* PLL Multiply by 16 */
#define DEVCFG2_FPLLMULT_MUL_17	0x00001000	/* PLL Multiply by 17 */
#define DEVCFG2_FPLLMULT_MUL_18	0x00001100	/* PLL Multiply by 18 */
#define DEVCFG2_FPLLMULT_MUL_19	0x00001200	/* PLL Multiply by 19 */
#define DEVCFG2_FPLLMULT_MUL_20	0x00001300	/* PLL Multiply by 20 */
#define DEVCFG2_FPLLMULT_MUL_21	0x00001400	/* PLL Multiply by 21 */
#define DEVCFG2_FPLLMULT_MUL_22	0x00001500	/* PLL Multiply by 22 */
#define DEVCFG2_FPLLMULT_MUL_23	0x00001600	/* PLL Multiply by 23 */
#define DEVCFG2_FPLLMULT_MUL_24	0x00001700	/* PLL Multiply by 24 */
#define DEVCFG2_FPLLMULT_MUL_25	0x00001800	/* PLL Multiply by 25 */
#define DEVCFG2_FPLLMULT_MUL_26	0x00001900	/* PLL Multiply by 26 */
#define DEVCFG2_FPLLMULT_MUL_27	0x00001A00	/* PLL Multiply by 27 */
#define DEVCFG2_FPLLMULT_MUL_28	0x00001B00	/* PLL Multiply by 28 */
#define DEVCFG2_FPLLMULT_MUL_29	0x00001C00	/* PLL Multiply by 29 */
#define DEVCFG2_FPLLMULT_MUL_30	0x00001D00	/* PLL Multiply by 30 */
#define DEVCFG2_FPLLMULT_MUL_31	0x00001E00	/* PLL Multiply by 31 */
#define DEVCFG2_FPLLMULT_MUL_32	0x00001F00	/* PLL Multiply by 32 */
#define DEVCFG2_FPLLMULT_MUL_33	0x00002000	/* PLL Multiply by 33 */
#define DEVCFG2_FPLLMULT_MUL_34	0x00002100	/* PLL Multiply by 34 */
#define DEVCFG2_FPLLMULT_MUL_35	0x00002200	/* PLL Multiply by 35 */
#define DEVCFG2_FPLLMULT_MUL_36	0x00002300	/* PLL Multiply by 36 */
#define DEVCFG2_FPLLMULT_MUL_37	0x00002400	/* PLL Multiply by 37 */
#define DEVCFG2_FPLLMULT_MUL_38	0x00002500	/* PLL Multiply by 38 */
#define DEVCFG2_FPLLMULT_MUL_39	0x00002600	/* PLL Multiply by 39 */
#define DEVCFG2_FPLLMULT_MUL_40	0x00002700	/* PLL Multiply by 40 */
#define DEVCFG2_FPLLMULT_MUL_41	0x00002800	/* PLL Multiply by 41 */
#define DEVCFG2_FPLLMULT_MUL_42	0x00002900	/* PLL Multiply by 42 */
#define DEVCFG2_FPLLMULT_MUL_43	0x00002A00	/* PLL Multiply by 43 */
#define DEVCFG2_FPLLMULT_MUL_44	0x00002B00	/* PLL Multiply by 44 */
#define DEVCFG2_FPLLMULT_MUL_45	0x00002C00	/* PLL Multiply by 45 */
#define DEVCFG2_FPLLMULT_MUL_46	0x00002D00	/* PLL Multiply by 46 */
#define DEVCFG2_FPLLMULT_MUL_47	0x00002E00	/* PLL Multiply by 47 */
#define DEVCFG2_FPLLMULT_MUL_48	0x00002F00	/* PLL Multiply by 48 */
#define DEVCFG2_FPLLMULT_MUL_49	0x00003000	/* PLL Multiply by 49 */
#define DEVCFG2_FPLLMULT_MUL_50	0x00003100	/* PLL Multiply by 50 */
#define DEVCFG2_FPLLMULT_MUL_51	0x00003200	/* PLL Multiply by 51 */
#define DEVCFG2_FPLLMULT_MUL_52	0x00003300	/* PLL Multiply by 52 */
#define DEVCFG2_FPLLMULT_MUL_53	0x00003400	/* PLL Multiply by 53 */
#define DEVCFG2_FPLLMULT_MUL_54	0x00003500	/* PLL Multiply by 54 */
#define DEVCFG2_FPLLMULT_MUL_55	0x00003600	/* PLL Multiply by 55 */
#define DEVCFG2_FPLLMULT_MUL_56	0x00003700	/* PLL Multiply by 56 */
#define DEVCFG2_FPLLMULT_MUL_57	0x00003800	/* PLL Multiply by 57 */
#define DEVCFG2_FPLLMULT_MUL_58	0x00003900	/* PLL Multiply by 58 */
#define DEVCFG2_FPLLMULT_MUL_59	0x00003A00	/* PLL Multiply by 59 */
#define DEVCFG2_FPLLMULT_MUL_60	0x00003B00	/* PLL Multiply by 60 */
#define DEVCFG2_FPLLMULT_MUL_61	0x00003C00	/* PLL Multiply by 61 */
#define DEVCFG2_FPLLMULT_MUL_62	0x00003D00	/* PLL Multiply by 62 */
#define DEVCFG2_FPLLMULT_MUL_63	0x00003E00	/* PLL Multiply by 63 */
#define DEVCFG2_FPLLMULT_MUL_64	0x00003F00	/* PLL Multiply by 64 */
#define DEVCFG2_FPLLMULT_MUL_65	0x00004000	/* PLL Multiply by 65 */
#define DEVCFG2_FPLLMULT_MUL_66	0x00004100	/* PLL Multiply by 66 */
#define DEVCFG2_FPLLMULT_MUL_67	0x00004200	/* PLL Multiply by 67 */
#define DEVCFG2_FPLLMULT_MUL_68	0x00004300	/* PLL Multiply by 68 */
#define DEVCFG2_FPLLMULT_MUL_69	0x00004400	/* PLL Multiply by 69 */
#define DEVCFG2_FPLLMULT_MUL_70	0x00004500	/* PLL Multiply by 70 */
#define DEVCFG2_FPLLMULT_MUL_71	0x00004600	/* PLL Multiply by 71 */
#define DEVCFG2_FPLLMULT_MUL_72	0x00004700	/* PLL Multiply by 72 */
#define DEVCFG2_FPLLMULT_MUL_73	0x00004800	/* PLL Multiply by 73 */
#define DEVCFG2_FPLLMULT_MUL_74	0x00004900	/* PLL Multiply by 74 */
#define DEVCFG2_FPLLMULT_MUL_75	0x00004A00	/* PLL Multiply by 75 */
#define DEVCFG2_FPLLMULT_MUL_76	0x00004B00	/* PLL Multiply by 76 */
#define DEVCFG2_FPLLMULT_MUL_77	0x00004C00	/* PLL Multiply by 77 */
#define DEVCFG2_FPLLMULT_MUL_78	0x00004D00	/* PLL Multiply by 78 */
#define DEVCFG2_FPLLMULT_MUL_79	0x00004E00	/* PLL Multiply by 79 */
#define DEVCFG2_FPLLMULT_MUL_80	0x00004F00	/* PLL Multiply by 80 */
#define DEVCFG2_FPLLMULT_MUL_81	0x00005000	/* PLL Multiply by 81 */
#define DEVCFG2_FPLLMULT_MUL_82	0x00005100	/* PLL Multiply by 82 */
#define DEVCFG2_FPLLMULT_MUL_83	0x00005200	/* PLL Multiply by 83 */
#define DEVCFG2_FPLLMULT_MUL_84	0x00005300	/* PLL Multiply by 84 */
#define DEVCFG2_FPLLMULT_MUL_85	0x00005400	/* PLL Multiply by 85 */
#define DEVCFG2_FPLLMULT_MUL_86	0x00005500	/* PLL Multiply by 86 */
#define DEVCFG2_FPLLMULT_MUL_87	0x00005600	/* PLL Multiply by 87 */
#define DEVCFG2_FPLLMULT_MUL_88	0x00005700	/* PLL Multiply by 88 */
#define DEVCFG2_FPLLMULT_MUL_89	0x00005800	/* PLL Multiply by 89 */
#define DEVCFG2_FPLLMULT_MUL_90	0x00005900	/* PLL Multiply by 90 */
#define DEVCFG2_FPLLMULT_MUL_91	0x00005A00	/* PLL Multiply by 91 */
#define DEVCFG2_FPLLMULT_MUL_92	0x00005B00	/* PLL Multiply by 92 */
#define DEVCFG2_FPLLMULT_MUL_93	0x00005C00	/* PLL Multiply by 93 */
#define DEVCFG2_FPLLMULT_MUL_94	0x00005D00	/* PLL Multiply by 94 */
#define DEVCFG2_FPLLMULT_MUL_95	0x00005E00	/* PLL Multiply by 95 */
#define DEVCFG2_FPLLMULT_MUL_96	0x00005F00	/* PLL Multiply by 96 */
#define DEVCFG2_FPLLMULT_MUL_97	0x00006000	/* PLL Multiply by 97 */
#define DEVCFG2_FPLLMULT_MUL_98	0x00006100	/* PLL Multiply by 98 */
#define DEVCFG2_FPLLMULT_MUL_99	0x00006200	/* PLL Multiply by 99 */
#define DEVCFG2_FPLLMULT_MUL_100	0x00006300	/* PLL Multiply by 100 */
#define DEVCFG2_FPLLMULT_MUL_101	0x00006400	/* PLL Multiply by 101 */
#define DEVCFG2_FPLLMULT_MUL_102	0x00006500	/* PLL Multiply by 102 */
#define DEVCFG2_FPLLMULT_MUL_103	0x00006600	/* PLL Multiply by 103 */
#define DEVCFG2_FPLLMULT_MUL_104	0x00006700	/* PLL Multiply by 104 */
#define DEVCFG2_FPLLMULT_MUL_105	0x00006800	/* PLL Multiply by 105 */
#define DEVCFG2_FPLLMULT_MUL_106	0x00006900	/* PLL Multiply by 106 */
#define DEVCFG2_FPLLMULT_MUL_107	0x00006A00	/* PLL Multiply by 107 */
#define DEVCFG2_FPLLMULT_MUL_108	0x00006B00	/* PLL Multiply by 108 */
#define DEVCFG2_FPLLMULT_MUL_109	0x00006C00	/* PLL Multiply by 109 */
#define DEVCFG2_FPLLMULT_MUL_110	0x00006D00	/* PLL Multiply by 110 */
#define DEVCFG2_FPLLMULT_MUL_111	0x00006E00	/* PLL Multiply by 111 */
#define DEVCFG2_FPLLMULT_MUL_112	0x00006F00	/* PLL Multiply by 112 */
#define DEVCFG2_FPLLMULT_MUL_113	0x00007000	/* PLL Multiply by 113 */
#define DEVCFG2_FPLLMULT_MUL_114	0x00007100	/* PLL Multiply by 114 */
#define DEVCFG2_FPLLMULT_MUL_115	0x00007200	/* PLL Multiply by 115 */
#define DEVCFG2_FPLLMULT_MUL_116	0x00007300	/* PLL Multiply by 116 */
#define DEVCFG2_FPLLMULT_MUL_117	0x00007400	/* PLL Multiply by 117 */
#define DEVCFG2_FPLLMULT_MUL_118	0x00007500	/* PLL Multiply by 118 */
#define DEVCFG2_FPLLMULT_MUL_119	0x00007600	/* PLL Multiply by 119 */
#define DEVCFG2_FPLLMULT_MUL_120	0x00007700	/* PLL Multiply by 120 */
#define DEVCFG2_FPLLMULT_MUL_121	0x00007800	/* PLL Multiply by 121 */
#define DEVCFG2_FPLLMULT_MUL_122	0x00007900	/* PLL Multiply by 122 */
#define DEVCFG2_FPLLMULT_MUL_123	0x00007A00	/* PLL Multiply by 123 */
#define DEVCFG2_FPLLMULT_MUL_124	0x00007B00	/* PLL Multiply by 124 */
#define DEVCFG2_FPLLMULT_MUL_125	0x00007C00	/* PLL Multiply by 125 */
#define DEVCFG2_FPLLMULT_MUL_126	0x00007D00	/* PLL Multiply by 126 */
#define DEVCFG2_FPLLMULT_MUL_127	0x00007E00	/* PLL Multiply by 127 */
#define DEVCFG2_FPLLMULT_MUL_128	0x00007F00	/* PLL Multiply by 128 */
#define DEVCFG2_FPLLODIV_DIV_2	0x00010000	/* 2x Divider */
#define DEVCFG2_FPLLODIV_DIV_4	0x00020000	/* 4x Divider */
#define DEVCFG2_FPLLODIV_DIV_8	0x00030000	/* 8x Divider */
#define DEVCFG2_FPLLODIV_DIV_16	0x00040000	/* 16x Divider */
#define DEVCFG2_FPLLODIV_DIV_32	0x00050000	/* 32x Divider */
#define DEVCFG2_UPLLFSEL_FREQ_12MHZ	0x00000000	/* USB PLL input is 12 MHz */
#define DEVCFG2_UPLLFSEL_FREQ_24MHZ	0x40000000	/* USB PLL input is 24 MHz */
#define DEVCFG1_FNOSC_SPLL	0x00000001	/* System PLL */
#define DEVCFG1_FNOSC_POSC	0x00000002	/* Primary Osc (HS */
#define DEVCFG1_FNOSC_SOSC	0x00000004	/* Low Power Secondary Osc (SOSC) */
#define DEVCFG1_FNOSC_LPRC	0x00000005	/* Low Power RC Osc (LPRC) */
#define DEVCFG1_FNOSC_FRCDIV	0x00000007	/* Fast RC Osc w/Div-by-N (FRCDIV) */
#define DEVCFG1_DMTINTV_WIN_0	0x00000000	/* Window/Interval value is zero */
#define DEVCFG1_DMTINTV_WIN_1_2	0x00000008	/* Window/Interval value is 1/2 counter value */
#define DEVCFG1_DMTINTV_WIN_3_4	0x00000010	/* Window/Interval value is 3/4 counter value */
#define DEVCFG1_DMTINTV_WIN_7_8	0x00000018	/* Window/Interval value is 7/8 counter value */
#define DEVCFG1_DMTINTV_WIN_15_16	0x00000020	/* Window/Interval value is 15/16 counter value */
#define DEVCFG1_DMTINTV_WIN_31_32	0x00000028	/* Window/Interval value is 31/32 counter value */
#define DEVCFG1_DMTINTV_WIN_63_64	0x00000030	/* Window/Interval value is 63/64 counter value */
#define DEVCFG1_DMTINTV_WIN_127_128	0x00000038	/* Window/Interval value is 127/128 counter value */
#define DEVCFG1_FSOSCEN_OFF	0x00000000	/* Disable SOSC */
#define DEVCFG1_FSOSCEN_ON	0x00000040	/* Enable SOSC */
#define DEVCFG1_IESO_OFF	0x00000000	/* Disabled */
#define DEVCFG1_IESO_ON	0x00000080	/* Enabled */
#define DEVCFG1_POSCMOD_EC	0x00000000	/* External clock mode */
#define DEVCFG1_POSCMOD_HS	0x00000200	/* HS osc mode */
#define DEVCFG1_POSCMOD_OFF	0x00000300	/* Primary osc disabled */
#define DEVCFG1_OSCIOFNC_ON	0x00000000	/* Enabled */
#define DEVCFG1_OSCIOFNC_OFF	0x00000400	/* Disabled */
#define DEVCFG1_FCKSM_CSDCMD	0x00000000	/* Clock Switch Disabled */
#define DEVCFG1_FCKSM_CSECMD	0x00004000	/* Clock Switch Enabled */
#define DEVCFG1_FCKSM_CSDCME	0x00008000	/* Clock Switch Disabled */
#define DEVCFG1_FCKSM_CSECME	0x0000C000	/* Clock Switch Enabled */
#define DEVCFG1_WDTPS_PS1	0x00000000	/* 1 */
#define DEVCFG1_WDTPS_PS2	0x00010000	/* 1 */
#define DEVCFG1_WDTPS_PS4	0x00020000	/* 1 */
#define DEVCFG1_WDTPS_PS8	0x00030000	/* 1 */
#define DEVCFG1_WDTPS_PS16	0x00040000	/* 1 */
#define DEVCFG1_WDTPS_PS32	0x00050000	/* 1 */
#define DEVCFG1_WDTPS_PS64	0x00060000	/* 1 */
#define DEVCFG1_WDTPS_PS128	0x00070000	/* 1 */
#define DEVCFG1_WDTPS_PS256	0x00080000	/* 1 */
#define DEVCFG1_WDTPS_PS512	0x00090000	/* 1 */
#define DEVCFG1_WDTPS_PS1024	0x000A0000	/* 1 */
#define DEVCFG1_WDTPS_PS2048	0x000B0000	/* 1 */
#define DEVCFG1_WDTPS_PS4096	0x000C0000	/* 1 */
#define DEVCFG1_WDTPS_PS8192	0x000D0000	/* 1 */
#define DEVCFG1_WDTPS_PS16384	0x000E0000	/* 1 */
#define DEVCFG1_WDTPS_PS32768	0x000F0000	/* 1 */
#define DEVCFG1_WDTPS_PS65536	0x00100000	/* 1 */
#define DEVCFG1_WDTPS_PS131072	0x00110000	/* 1 */
#define DEVCFG1_WDTPS_PS262144	0x00120000	/* 1 */
#define DEVCFG1_WDTPS_PS524288	0x00130000	/* 1 */
#define DEVCFG1_WDTPS_PS1048576	0x00140000	/* 1 */
#define DEVCFG1_WDTSPGM_RUN	0x00000000	/* WDT runs during Flash programming */
#define DEVCFG1_WDTSPGM_STOP	0x00200000	/* WDT stops during Flash programming */
#define DEVCFG1_WINDIS_WINDOW	0x00000000	/* Watchdog Timer is in Window mode */
#define DEVCFG1_WINDIS_NORMAL	0x00400000	/* Watchdog Timer is in non-Window mode */
#define DEVCFG1_FWDTEN_OFF	0x00000000	/* WDT Disabled */
#define DEVCFG1_FWDTEN_ON	0x00800000	/* WDT Enabled */
#define DEVCFG1_FWDTWINSZ_WINSZ_75	0x00000000	/* Window size is 75% */
#define DEVCFG1_FWDTWINSZ_WINSZ_50	0x01000000	/* Window size is 50% */
#define DEVCFG1_FWDTWINSZ_WINSZ_37	0x02000000	/* Window size is 37.5% */
#define DEVCFG1_FWDTWINSZ_WINSZ_25	0x03000000	/* Window size is 25% */
#define DEVCFG1_DMTCNT_DMT8	0x00000000	/* 2^8 (256) */
#define DEVCFG1_DMTCNT_DMT9	0x04000000	/* 2^9 (512) */
#define DEVCFG1_DMTCNT_DMT10	0x08000000	/* 2^10 (1024) */
#define DEVCFG1_DMTCNT_DMT11	0x0C000000	/* 2^11 (2048) */
#define DEVCFG1_DMTCNT_DMT12	0x10000000	/* 2^12 (4096) */
#define DEVCFG1_DMTCNT_DMT13	0x14000000	/* 2^13 (8192) */
#define DEVCFG1_DMTCNT_DMT14	0x18000000	/* 2^14 (16384) */
#define DEVCFG1_DMTCNT_DMT15	0x1C000000	/* 2^15 (32768) */
#define DEVCFG1_DMTCNT_DMT16	0x20000000	/* 2^16 (65536) */
#define DEVCFG1_DMTCNT_DMT17	0x24000000	/* 2^17 (131072) */
#define DEVCFG1_DMTCNT_DMT18	0x28000000	/* 2^18 (262144) */
#define DEVCFG1_DMTCNT_DMT19	0x2C000000	/* 2^19 (524288) */
#define DEVCFG1_DMTCNT_DMT20	0x30000000	/* 2^20 (1048576) */
#define DEVCFG1_DMTCNT_DMT21	0x34000000	/* 2^21 (2097152) */
#define DEVCFG1_DMTCNT_DMT22	0x38000000	/* 2^22 (4194304) */
#define DEVCFG1_DMTCNT_DMT23	0x3C000000	/* 2^23 (8388608) */
#define DEVCFG1_DMTCNT_DMT24	0x40000000	/* 2^24 (16777216) */
#define DEVCFG1_DMTCNT_DMT25	0x44000000	/* 2^25 (33554432) */
#define DEVCFG1_DMTCNT_DMT26	0x48000000	/* 2^26 (67108864) */
#define DEVCFG1_DMTCNT_DMT27	0x4C000000	/* 2^27 (134217728) */
#define DEVCFG1_DMTCNT_DMT28	0x50000000	/* 2^28 (268435456) */
#define DEVCFG1_DMTCNT_DMT29	0x54000000	/* 2^29 (536870912) */
#define DEVCFG1_DMTCNT_DMT30	0x58000000	/* 2^30 (1073741824) */
#define DEVCFG1_DMTCNT_DMT31	0x5C000000	/* 2^31 (2147483648) */
#define DEVCFG1_FDMTEN_OFF	0x00000000	/* Deadman Timer is disabled */
#define DEVCFG1_FDMTEN_ON	0x80000000	/* Deadman Timer is enabled */
#define DEVCFG0_DEBUG_ON	0x00000001	/* Debugger is enabled */
#define DEVCFG0_DEBUG_OFF	0x00000003	/* Debugger is disabled */
#define DEVCFG0_JTAGEN_OFF	0x00000000	/* JTAG Disabled */
#define DEVCFG0_JTAGEN_ON	0x00000004	/* JTAG Port Enabled */
#define DEVCFG0_ICESEL_ICS_PGx2	0x00000010	/* Communicate on PGEC2/PGED2 */
#define DEVCFG0_ICESEL_ICS_PGx1	0x00000018	/* Communicate on PGEC1/PGED1 */
#define DEVCFG0_TRCEN_OFF	0x00000000	/* Trace features in the CPU are disabled */
#define DEVCFG0_TRCEN_ON	0x00000020	/* Trace features in the CPU are enabled */
#define DEVCFG0_BOOTISA_MICROMIPS	0x00000000	/* Boot code and Exception code is microMIPS */
#define DEVCFG0_BOOTISA_MIPS32	0x00000040	/* Boot code and Exception code is MIPS32 */
#define DEVCFG0_FECCCON_ON	0x00000000	/* Flash ECC is enabled (ECCCON bits are locked) */
#define DEVCFG0_FECCCON_DYNAMIC	0x00000100	/* Dynamic Flash ECC is enabled (ECCCON bits are locked) */
#define DEVCFG0_FECCCON_OFF_LOCKED	0x00000200	/* ECC and Dynamic ECC are disabled (ECCCON bits are locked) */
#define DEVCFG0_FECCCON_OFF_UNLOCKED	0x00000300	/* ECC and Dynamic ECC are disabled (ECCCON bits are writable) */
#define DEVCFG0_FSLEEP_VREGS	0x00000000	/* Flash power down is controlled by the VREGS bit */
#define DEVCFG0_FSLEEP_OFF	0x00000400	/* Flash is powered down when the device is in Sleep mode */
#define DEVCFG0_DBGPER_DENY_PG0	0x00000000	/* Deny CPU access to Permission Group 0 permission regions */
#define DEVCFG0_DBGPER_DENY_PG1	0x00000000	/* Deny CPU access to Permission Group 1 permission regions */
#define DEVCFG0_DBGPER_DENY_PG2	0x00000000	/* Deny CPU access to Permission Group 2 permission regions */
#define DEVCFG0_DBGPER_ALLOW_PG0	0x00001000	/* Allow CPU access to Permission Group 0 permission regions */
#define DEVCFG0_DBGPER_ALLOW_PG1	0x00002000	/* Allow CPU access to Permission Group 1 permission regions */
#define DEVCFG0_DBGPER_ALLOW_PG2	0x00004000	/* Allow CPU access to Permission Group 2 permission regions */
#define DEVCFG0_DBGPER_PG_2_1	0x00006000	/* PG0 */
#define DEVCFG0_DBGPER_PG_ALL	0x00007000	/* Allow CPU access to all permission regions */
#define DEVCFG0_SMCLR_MCLR_POR	0x00000000	/* MCLR pin generates an emulated POR Reset */
#define DEVCFG0_SMCLR_MCLR_NORM	0x00008000	/* MCLR pin generates a normal system Reset */
#define DEVCFG0_SOSCGAIN_GAIN_1X	0x00000000	/* 1x gain setting */
#define DEVCFG0_SOSCGAIN_GAIN_0_5X	0x00010000	/* 0.5x gain setting */
#define DEVCFG0_SOSCGAIN_GAIN_1_5X	0x00020000	/* 1.5x gain setting */
#define DEVCFG0_SOSCGAIN_GAIN_2X	0x00030000	/* 2x gain setting */
#define DEVCFG0_SOSCBOOST_OFF	0x00000000	/* Normal start of the oscillator */
#define DEVCFG0_SOSCBOOST_ON	0x00040000	/* Boost the kick start of the oscillator */
#define DEVCFG0_POSCGAIN_GAIN_1X	0x00000000	/* 1x gain setting */
#define DEVCFG0_POSCGAIN_GAIN_0_5X	0x00080000	/* 0.5x gain setting */
