whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
#define DEVCFG0_POSCGAIN_GAIN_1_5X	0x00100000	/* 1.5x gain setting */
#define DEVCFG0_POSCGAIN_GAIN_2X	0x00180000	/* 2x gain setting */
#define DEVCFG0_POSCBOOST_OFF	0x00000000	/* Normal start of the oscillator */
#define DEVCFG0_POSCBOOST_ON	0x00200000	/* Boost the kick start of the oscillator */
#define DEVCFG0_EJTAGBEN_REDUCED	0x00000000	/* Reduced EJTAG functionality */
#define DEVCFG0_EJTAGBEN_NORMAL	0x40000000	/* Normal EJTAG functionality */

/*--------------------------------------
 * Peripheral registers.
 */
#define PIC32_R(a)              *(volatile unsigned*)(0xBF800000 + (a))

/*--------------------------------------
 * Port A-K registers.
 */
#define ANSELA          PIC32_R (0x60000) /* Port A: analog select */
#define ANSELACLR       PIC32_R (0x60004)
#define ANSELASET       PIC32_R (0x60008)
#define ANSELAINV       PIC32_R (0x6000C)
#define TRISA           PIC32_R (0x60010) /* Port A: mask of inputs */
#define TRISACLR        PIC32_R (0x60014)
#define TRISASET        PIC32_R (0x60018)
#define TRISAINV        PIC32_R (0x6001C)
#define PORTA           PIC32_R (0x60020) /* Port A: read inputs, write outputs */
#define PORTACLR        PIC32_R (0x60024)
#define PORTASET        PIC32_R (0x60028)
#define PORTAINV        PIC32_R (0x6002C)
#define LATA            PIC32_R (0x60030) /* Port A: read/write outputs */
#define LATACLR         PIC32_R (0x60034)
#define LATASET         PIC32_R (0x60038)
#define LATAINV         PIC32_R (0x6003C)
#define ODCA            PIC32_R (0x60040) /* Port A: open drain configuration */
#define ODCACLR         PIC32_R (0x60044)
#define ODCASET         PIC32_R (0x60048)
#define ODCAINV         PIC32_R (0x6004C)
#define CNPUA           PIC32_R (0x60050) /* Port A: input pin pull-up enable */
#define CNPUACLR        PIC32_R (0x60054)
#define CNPUASET        PIC32_R (0x60058)
#define CNPUAINV        PIC32_R (0x6005C)
#define CNPDA           PIC32_R (0x60060) /* Port A: input pin pull-down enable */
#define CNPDACLR        PIC32_R (0x60064)
#define CNPDASET        PIC32_R (0x60068)
#define CNPDAINV        PIC32_R (0x6006C)
#define CNCONA          PIC32_R (0x60070) /* Port A: interrupt-on-change control */
#define CNCONACLR       PIC32_R (0x60074)
#define CNCONASET       PIC32_R (0x60078)
#define CNCONAINV       PIC32_R (0x6007C)
#define CNENA           PIC32_R (0x60080) /* Port A: input change interrupt enable */
#define CNENACLR        PIC32_R (0x60084)
#define CNENASET        PIC32_R (0x60088)
#define CNENAINV        PIC32_R (0x6008C)
#define CNSTATA         PIC32_R (0x60090) /* Port A: status */
#define CNSTATACLR      PIC32_R (0x60094)
#define CNSTATASET      PIC32_R (0x60098)
#define CNSTATAINV      PIC32_R (0x6009C)

#define ANSELB          PIC32_R (0x60100) /* Port B: analog select */
#define ANSELBCLR       PIC32_R (0x60104)
#define ANSELBSET       PIC32_R (0x60108)
#define ANSELBINV       PIC32_R (0x6010C)
#define TRISB           PIC32_R (0x60110) /* Port B: mask of inputs */
#define TRISBCLR        PIC32_R (0x60114)
#define TRISBSET        PIC32_R (0x60118)
#define TRISBINV        PIC32_R (0x6011C)
#define PORTB           PIC32_R (0x60120) /* Port B: read inputs, write outputs */
#define PORTBCLR        PIC32_R (0x60124)
#define PORTBSET        PIC32_R (0x60128)
#define PORTBINV        PIC32_R (0x6012C)
#define LATB            PIC32_R (0x60130) /* Port B: read/write outputs */
#define LATBCLR         PIC32_R (0x60134)
#define LATBSET         PIC32_R (0x60138)
#define LATBINV         PIC32_R (0x6013C)
#define ODCB            PIC32_R (0x60140) /* Port B: open drain configuration */
#define ODCBCLR         PIC32_R (0x60144)
#define ODCBSET         PIC32_R (0x60148)
#define ODCBINV         PIC32_R (0x6014C)
#define CNPUB           PIC32_R (0x60150) /* Port B: input pin pull-up enable */
#define CNPUBCLR        PIC32_R (0x60154)
#define CNPUBSET        PIC32_R (0x60158)
#define CNPUBINV        PIC32_R (0x6015C)
#define CNPDB           PIC32_R (0x60160) /* Port B: input pin pull-down enable */
#define CNPDBCLR        PIC32_R (0x60164)
#define CNPDBSET        PIC32_R (0x60168)
#define CNPDBINV        PIC32_R (0x6016C)
#define CNCONB          PIC32_R (0x60170) /* Port B: interrupt-on-change control */
#define CNCONBCLR       PIC32_R (0x60174)
#define CNCONBSET       PIC32_R (0x60178)
#define CNCONBINV       PIC32_R (0x6017C)
#define CNENB           PIC32_R (0x60180) /* Port B: input change interrupt enable */
#define CNENBCLR        PIC32_R (0x60184)
#define CNENBSET        PIC32_R (0x60188)
#define CNENBINV        PIC32_R (0x6018C)
#define CNSTATB         PIC32_R (0x60190) /* Port B: status */
#define CNSTATBCLR      PIC32_R (0x60194)
#define CNSTATBSET      PIC32_R (0x60198)
#define CNSTATBINV      PIC32_R (0x6019C)

#define ANSELC          PIC32_R (0x60200) /* Port C: analog select */
#define ANSELCCLR       PIC32_R (0x60204)
#define ANSELCSET       PIC32_R (0x60208)
#define ANSELCINV       PIC32_R (0x6020C)
#define TRISC           PIC32_R (0x60210) /* Port C: mask of inputs */
#define TRISCCLR        PIC32_R (0x60214)
#define TRISCSET        PIC32_R (0x60218)
#define TRISCINV        PIC32_R (0x6021C)
#define PORTC           PIC32_R (0x60220) /* Port C: read inputs, write outputs */
#define PORTCCLR        PIC32_R (0x60224)
#define PORTCSET        PIC32_R (0x60228)
#define PORTCINV        PIC32_R (0x6022C)
#define LATC            PIC32_R (0x60230) /* Port C: read/write outputs */
#define LATCCLR         PIC32_R (0x60234)
#define LATCSET         PIC32_R (0x60238)
#define LATCINV         PIC32_R (0x6023C)
#define ODCC            PIC32_R (0x60240) /* Port C: open drain configuration */
#define ODCCCLR         PIC32_R (0x60244)
#define ODCCSET         PIC32_R (0x60248)
#define ODCCINV         PIC32_R (0x6024C)
#define CNPUC           PIC32_R (0x60250) /* Port C: input pin pull-up enable */
#define CNPUCCLR        PIC32_R (0x60254)
#define CNPUCSET        PIC32_R (0x60258)
#define CNPUCINV        PIC32_R (0x6025C)
#define CNPDC           PIC32_R (0x60260) /* Port C: input pin pull-down enable */
#define CNPDCCLR        PIC32_R (0x60264)
#define CNPDCSET        PIC32_R (0x60268)
#define CNPDCINV        PIC32_R (0x6026C)
#define CNCONC          PIC32_R (0x60270) /* Port C: interrupt-on-change control */
#define CNCONCCLR       PIC32_R (0x60274)
#define CNCONCSET       PIC32_R (0x60278)
#define CNCONCINV       PIC32_R (0x6027C)
#define CNENC           PIC32_R (0x60280) /* Port C: input change interrupt enable */
#define CNENCCLR        PIC32_R (0x60284)
#define CNENCSET        PIC32_R (0x60288)
#define CNENCINV        PIC32_R (0x6028C)
#define CNSTATC         PIC32_R (0x60290) /* Port C: status */
#define CNSTATCCLR      PIC32_R (0x60294)
#define CNSTATCSET      PIC32_R (0x60298)
#define CNSTATCINV      PIC32_R (0x6029C)

#define ANSELD          PIC32_R (0x60300) /* Port D: analog select */
#define ANSELDCLR       PIC32_R (0x60304)
#define ANSELDSET       PIC32_R (0x60308)
#define ANSELDINV       PIC32_R (0x6030C)
#define TRISD           PIC32_R (0x60310) /* Port D: mask of inputs */
#define TRISDCLR        PIC32_R (0x60314)
#define TRISDSET        PIC32_R (0x60318)
#define TRISDINV        PIC32_R (0x6031C)
#define PORTD           PIC32_R (0x60320) /* Port D: read inputs, write outputs */
#define PORTDCLR        PIC32_R (0x60324)
#define PORTDSET        PIC32_R (0x60328)
#define PORTDINV        PIC32_R (0x6032C)
#define LATD            PIC32_R (0x60330) /* Port D: read/write outputs */
#define LATDCLR         PIC32_R (0x60334)
#define LATDSET         PIC32_R (0x60338)
#define LATDINV         PIC32_R (0x6033C)
#define ODCD            PIC32_R (0x60340) /* Port D: open drain configuration */
#define ODCDCLR         PIC32_R (0x60344)
#define ODCDSET         PIC32_R (0x60348)
#define ODCDINV         PIC32_R (0x6034C)
#define CNPUD           PIC32_R (0x60350) /* Port D: input pin pull-up enable */
#define CNPUDCLR        PIC32_R (0x60354)
#define CNPUDSET        PIC32_R (0x60358)
#define CNPUDINV        PIC32_R (0x6035C)
#define CNPDD           PIC32_R (0x60360) /* Port D: input pin pull-down enable */
#define CNPDDCLR        PIC32_R (0x60364)
#define CNPDDSET        PIC32_R (0x60368)
#define CNPDDINV        PIC32_R (0x6036C)
#define CNCOND          PIC32_R (0x60370) /* Port D: interrupt-on-change control */
#define CNCONDCLR       PIC32_R (0x60374)
#define CNCONDSET       PIC32_R (0x60378)
#define CNCONDINV       PIC32_R (0x6037C)
#define CNEND           PIC32_R (0x60380) /* Port D: input change interrupt enable */
#define CNENDCLR        PIC32_R (0x60384)
#define CNENDSET        PIC32_R (0x60388)
#define CNENDINV        PIC32_R (0x6038C)
#define CNSTATD         PIC32_R (0x60390) /* Port D: status */
#define CNSTATDCLR      PIC32_R (0x60394)
#define CNSTATDSET      PIC32_R (0x60398)
#define CNSTATDINV      PIC32_R (0x6039C)

#define ANSELE          PIC32_R (0x60400) /* Port E: analog select */
#define ANSELECLR       PIC32_R (0x60404)
#define ANSELESET       PIC32_R (0x60408)
#define ANSELEINV       PIC32_R (0x6040C)
#define TRISE           PIC32_R (0x60410) /* Port E: mask of inputs */
#define TRISECLR        PIC32_R (0x60414)
#define TRISESET        PIC32_R (0x60418)
#define TRISEINV        PIC32_R (0x6041C)
#define PORTE           PIC32_R (0x60420) /* Port E: read inputs, write outputs */
#define PORTECLR        PIC32_R (0x60424)
#define PORTESET        PIC32_R (0x60428)
#define PORTEINV        PIC32_R (0x6042C)
#define LATE            PIC32_R (0x60430) /* Port E: read/write outputs */
#define LATECLR         PIC32_R (0x60434)
#define LATESET         PIC32_R (0x60438)
#define LATEINV         PIC32_R (0x6043C)
#define ODCE            PIC32_R (0x60440) /* Port E: open drain configuration */
#define ODCECLR         PIC32_R (0x60444)
#define ODCESET         PIC32_R (0x60448)
#define ODCEINV         PIC32_R (0x6044C)
#define CNPUE           PIC32_R (0x60450) /* Port E: input pin pull-up enable */
#define CNPUECLR        PIC32_R (0x60454)
#define CNPUESET        PIC32_R (0x60458)
#define CNPUEINV        PIC32_R (0x6045C)
#define CNPDE           PIC32_R (0x60460) /* Port E: input pin pull-down enable */
#define CNPDECLR        PIC32_R (0x60464)
#define CNPDESET        PIC32_R (0x60468)
#define CNPDEINV        PIC32_R (0x6046C)
#define CNCONE          PIC32_R (0x60470) /* Port E: interrupt-on-change control */
#define CNCONECLR       PIC32_R (0x60474)
#define CNCONESET       PIC32_R (0x60478)
#define CNCONEINV       PIC32_R (0x6047C)
#define CNENE           PIC32_R (0x60480) /* Port E: input change interrupt enable */
#define CNENECLR        PIC32_R (0x60484)
#define CNENESET        PIC32_R (0x60488)
#define CNENEINV        PIC32_R (0x6048C)
#define CNSTATE         PIC32_R (0x60490) /* Port E: status */
#define CNSTATECLR      PIC32_R (0x60494)
#define CNSTATESET      PIC32_R (0x60498)
#define CNSTATEINV      PIC32_R (0x6049C)

#define ANSELF          PIC32_R (0x60500) /* Port F: analog select */
#define ANSELFCLR       PIC32_R (0x60504)
#define ANSELFSET       PIC32_R (0x60508)
#define ANSELFINV       PIC32_R (0x6050C)
#define TRISF           PIC32_R (0x60510) /* Port F: mask of inputs */
#define TRISFCLR        PIC32_R (0x60514)
#define TRISFSET        PIC32_R (0x60518)
#define TRISFINV        PIC32_R (0x6051C)
#define PORTF           PIC32_R (0x60520) /* Port F: read inputs, write outputs */
#define PORTFCLR        PIC32_R (0x60524)
#define PORTFSET        PIC32_R (0x60528)
#define PORTFINV        PIC32_R (0x6052C)
#define LATF            PIC32_R (0x60530) /* Port F: read/write outputs */
#define LATFCLR         PIC32_R (0x60534)
#define LATFSET         PIC32_R (0x60538)
#define LATFINV         PIC32_R (0x6053C)
#define ODCF            PIC32_R (0x60540) /* Port F: open drain configuration */
#define ODCFCLR         PIC32_R (0x60544)
#define ODCFSET         PIC32_R (0x60548)
#define ODCFINV         PIC32_R (0x6054C)
#define CNPUF           PIC32_R (0x60550) /* Port F: input pin pull-up enable */
#define CNPUFCLR        PIC32_R (0x60554)
#define CNPUFSET        PIC32_R (0x60558)
#define CNPUFINV        PIC32_R (0x6055C)
#define CNPDF           PIC32_R (0x60560) /* Port F: input pin pull-down enable */
#define CNPDFCLR        PIC32_R (0x60564)
#define CNPDFSET        PIC32_R (0x60568)
#define CNPDFINV        PIC32_R (0x6056C)
#define CNCONF          PIC32_R (0x60570) /* Port F: interrupt-on-change control */
#define CNCONFCLR       PIC32_R (0x60574)
#define CNCONFSET       PIC32_R (0x60578)
#define CNCONFINV       PIC32_R (0x6057C)
#define CNENF           PIC32_R (0x60580) /* Port F: input change interrupt enable */
#define CNENFCLR        PIC32_R (0x60584)
#define CNENFSET        PIC32_R (0x60588)
#define CNENFINV        PIC32_R (0x6058C)
#define CNSTATF         PIC32_R (0x60590) /* Port F: status */
#define CNSTATFCLR      PIC32_R (0x60594)
#define CNSTATFSET      PIC32_R (0x60598)
#define CNSTATFINV      PIC32_R (0x6059C)

#define ANSELG          PIC32_R (0x60600) /* Port G: analog select */
#define ANSELGCLR       PIC32_R (0x60604)
#define ANSELGSET       PIC32_R (0x60608)
#define ANSELGINV       PIC32_R (0x6060C)
#define TRISG           PIC32_R (0x60610) /* Port G: mask of inputs */
#define TRISGCLR        PIC32_R (0x60614)
#define TRISGSET        PIC32_R (0x60618)
#define TRISGINV        PIC32_R (0x6061C)
#define PORTG           PIC32_R (0x60620) /* Port G: read inputs, write outputs */
#define PORTGCLR        PIC32_R (0x60624)
#define PORTGSET        PIC32_R (0x60628)
#define PORTGINV        PIC32_R (0x6062C)
#define LATG            PIC32_R (0x60630) /* Port G: read/write outputs */
#define LATGCLR         PIC32_R (0x60634)
#define LATGSET         PIC32_R (0x60638)
#define LATGINV         PIC32_R (0x6063C)
#define ODCG            PIC32_R (0x60640) /* Port G: open drain configuration */
#define ODCGCLR         PIC32_R (0x60644)
#define ODCGSET         PIC32_R (0x60648)
#define ODCGINV         PIC32_R (0x6064C)
#define CNPUG           PIC32_R (0x60650) /* Port G: input pin pull-up enable */
#define CNPUGCLR        PIC32_R (0x60654)
#define CNPUGSET        PIC32_R (0x60658)
#define CNPUGINV        PIC32_R (0x6065C)
#define CNPDG           PIC32_R (0x60660) /* Port G: input pin pull-down enable */
#define CNPDGCLR        PIC32_R (0x60664)
#define CNPDGSET        PIC32_R (0x60668)
#define CNPDGINV        PIC32_R (0x6066C)
#define CNCONG          PIC32_R (0x60670) /* Port G: interrupt-on-change control */
#define CNCONGCLR       PIC32_R (0x60674)
#define CNCONGSET       PIC32_R (0x60678)
#define CNCONGINV       PIC32_R (0x6067C)
#define CNENG           PIC32_R (0x60680) /* Port G: input change interrupt enable */
#define CNENGCLR        PIC32_R (0x60684)
#define CNENGSET        PIC32_R (0x60688)
#define CNENGINV        PIC32_R (0x6068C)
#define CNSTATG         PIC32_R (0x60690) /* Port G: status */
#define CNSTATGCLR      PIC32_R (0x60694)
#define CNSTATGSET      PIC32_R (0x60698)
#define CNSTATGINV      PIC32_R (0x6069C)

