whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
#define ANSELH          PIC32_R (0x60700) /* Port H: analog select */
#define ANSELHCLR       PIC32_R (0x60704)
#define ANSELHSET       PIC32_R (0x60708)
#define ANSELHINV       PIC32_R (0x6070C)
#define TRISH           PIC32_R (0x60710) /* Port H: mask of inputs */
#define TRISHCLR        PIC32_R (0x60714)
#define TRISHSET        PIC32_R (0x60718)
#define TRISHINV        PIC32_R (0x6071C)
#define PORTH           PIC32_R (0x60720) /* Port H: read inputs, write outputs */
#define PORTHCLR        PIC32_R (0x60724)
#define PORTHSET        PIC32_R (0x60728)
#define PORTHINV        PIC32_R (0x6072C)
#define LATH            PIC32_R (0x60730) /* Port H: read/write outputs */
#define LATHCLR         PIC32_R (0x60734)
#define LATHSET         PIC32_R (0x60738)
#define LATHINV         PIC32_R (0x6073C)
#define ODCH            PIC32_R (0x60740) /* Port H: open drain configuration */
#define ODCHCLR         PIC32_R (0x60744)
#define ODCHSET         PIC32_R (0x60748)
#define ODCHINV         PIC32_R (0x6074C)
#define CNPUH           PIC32_R (0x60750) /* Port H: input pin pull-up enable */
#define CNPUHCLR        PIC32_R (0x60754)
#define CNPUHSET        PIC32_R (0x60758)
#define CNPUHINV        PIC32_R (0x6075C)
#define CNPDH           PIC32_R (0x60760) /* Port H: input pin pull-down enable */
#define CNPDHCLR        PIC32_R (0x60764)
#define CNPDHSET        PIC32_R (0x60768)
#define CNPDHINV        PIC32_R (0x6076C)
#define CNCONH          PIC32_R (0x60770) /* Port H: interrupt-on-change control */
#define CNCONHCLR       PIC32_R (0x60774)
#define CNCONHSET       PIC32_R (0x60778)
#define CNCONHINV       PIC32_R (0x6077C)
#define CNENH           PIC32_R (0x60780) /* Port H: input change interrupt enable */
#define CNENHCLR        PIC32_R (0x60784)
#define CNENHSET        PIC32_R (0x60788)
#define CNENHINV        PIC32_R (0x6078C)
#define CNSTATH         PIC32_R (0x60790) /* Port H: status */
#define CNSTATHCLR      PIC32_R (0x60794)
#define CNSTATHSET      PIC32_R (0x60798)
#define CNSTATHINV      PIC32_R (0x6079C)

#define ANSELJ          PIC32_R (0x60800) /* Port J: analog select */
#define ANSELJCLR       PIC32_R (0x60804)
#define ANSELJSET       PIC32_R (0x60808)
#define ANSELJINV       PIC32_R (0x6080C)
#define TRISJ           PIC32_R (0x60810) /* Port J: mask of inputs */
#define TRISJCLR        PIC32_R (0x60814)
#define TRISJSET        PIC32_R (0x60818)
#define TRISJINV        PIC32_R (0x6081C)
#define PORTJ           PIC32_R (0x60820) /* Port J: read inputs, write outputs */
#define PORTJCLR        PIC32_R (0x60824)
#define PORTJSET        PIC32_R (0x60828)
#define PORTJINV        PIC32_R (0x6082C)
#define LATJ            PIC32_R (0x60830) /* Port J: read/write outputs */
#define LATJCLR         PIC32_R (0x60834)
#define LATJSET         PIC32_R (0x60838)
#define LATJINV         PIC32_R (0x6083C)
#define ODCJ            PIC32_R (0x60840) /* Port J: open drain configuration */
#define ODCJCLR         PIC32_R (0x60844)
#define ODCJSET         PIC32_R (0x60848)
#define ODCJINV         PIC32_R (0x6084C)
#define CNPUJ           PIC32_R (0x60850) /* Port J: input pin pull-up enable */
#define CNPUJCLR        PIC32_R (0x60854)
#define CNPUJSET        PIC32_R (0x60858)
#define CNPUJINV        PIC32_R (0x6085C)
#define CNPDJ           PIC32_R (0x60860) /* Port J: input pin pull-down enable */
#define CNPDJCLR        PIC32_R (0x60864)
#define CNPDJSET        PIC32_R (0x60868)
#define CNPDJINV        PIC32_R (0x6086C)
#define CNCONJ          PIC32_R (0x60870) /* Port J: interrupt-on-change control */
#define CNCONJCLR       PIC32_R (0x60874)
#define CNCONJSET       PIC32_R (0x60878)
#define CNCONJINV       PIC32_R (0x6087C)
#define CNENJ           PIC32_R (0x60880) /* Port J: input change interrupt enable */
#define CNENJCLR        PIC32_R (0x60884)
#define CNENJSET        PIC32_R (0x60888)
#define CNENJINV        PIC32_R (0x6088C)
#define CNSTATJ         PIC32_R (0x60890) /* Port J: status */
#define CNSTATJCLR      PIC32_R (0x60894)
#define CNSTATJSET      PIC32_R (0x60898)
#define CNSTATJINV      PIC32_R (0x6089C)

#define TRISK           PIC32_R (0x60910) /* Port K: mask of inputs */
#define TRISKCLR        PIC32_R (0x60914)
#define TRISKSET        PIC32_R (0x60918)
#define TRISKINV        PIC32_R (0x6091C)
#define PORTK           PIC32_R (0x60920) /* Port K: read inputs, write outputs */
#define PORTKCLR        PIC32_R (0x60924)
#define PORTKSET        PIC32_R (0x60928)
#define PORTKINV        PIC32_R (0x6092C)
#define LATK            PIC32_R (0x60930) /* Port K: read/write outputs */
#define LATKCLR         PIC32_R (0x60934)
#define LATKSET         PIC32_R (0x60938)
#define LATKINV         PIC32_R (0x6093C)
#define ODCK            PIC32_R (0x60940) /* Port K: open drain configuration */
#define ODCKCLR         PIC32_R (0x60944)
#define ODCKSET         PIC32_R (0x60948)
#define ODCKINV         PIC32_R (0x6094C)
#define CNPUK           PIC32_R (0x60950) /* Port K: input pin pull-up enable */
#define CNPUKCLR        PIC32_R (0x60954)
#define CNPUKSET        PIC32_R (0x60958)
#define CNPUKINV        PIC32_R (0x6095C)
#define CNPDK           PIC32_R (0x60960) /* Port K: input pin pull-down enable */
#define CNPDKCLR        PIC32_R (0x60964)
#define CNPDKSET        PIC32_R (0x60968)
#define CNPDKINV        PIC32_R (0x6096C)
#define CNCONK          PIC32_R (0x60970) /* Port K: interrupt-on-change control */
#define CNCONKCLR       PIC32_R (0x60974)
#define CNCONKSET       PIC32_R (0x60978)
#define CNCONKINV       PIC32_R (0x6097C)
#define CNENK           PIC32_R (0x60980) /* Port K: input change interrupt enable */
#define CNENKCLR        PIC32_R (0x60984)
#define CNENKSET        PIC32_R (0x60988)
#define CNENKINV        PIC32_R (0x6098C)
#define CNSTATK         PIC32_R (0x60990) /* Port K: status */
#define CNSTATKCLR      PIC32_R (0x60994)
#define CNSTATKSET      PIC32_R (0x60998)
#define CNSTATKINV      PIC32_R (0x6099C)

/*--------------------------------------
 * Timer registers.
 */
#define T1CON           PIC32_R (0x40000) /* Timer 1: Control */
#define T1CONCLR        PIC32_R (0x40004)
#define T1CONSET        PIC32_R (0x40008)
#define T1CONINV        PIC32_R (0x4000C)
#define TMR1            PIC32_R (0x40010) /* Timer 1: Count */
#define TMR1CLR         PIC32_R (0x40014)
#define TMR1SET         PIC32_R (0x40018)
#define TMR1INV         PIC32_R (0x4001C)
#define PR1             PIC32_R (0x40020) /* Timer 1: Period register */
#define PR1CLR          PIC32_R (0x40024)
#define PR1SET          PIC32_R (0x40028)
#define PR1INV          PIC32_R (0x4002C)
#define T2CON           PIC32_R (0x40200) /* Timer 2: Control */
#define T2CONCLR        PIC32_R (0x40204)
#define T2CONSET        PIC32_R (0x40208)
#define T2CONINV        PIC32_R (0x4020C)
#define TMR2            PIC32_R (0x40210) /* Timer 2: Count */
#define TMR2CLR         PIC32_R (0x40214)
#define TMR2SET         PIC32_R (0x40218)
#define TMR2INV         PIC32_R (0x4021C)
#define PR2             PIC32_R (0x40220) /* Timer 2: Period register */
#define PR2CLR          PIC32_R (0x40224)
#define PR2SET          PIC32_R (0x40228)
#define PR2INV          PIC32_R (0x4022C)
#define T3CON           PIC32_R (0x40400) /* Timer 3: Control */
#define T3CONCLR        PIC32_R (0x40404)
#define T3CONSET        PIC32_R (0x40408)
#define T3CONINV        PIC32_R (0x4040C)
#define TMR3            PIC32_R (0x40410) /* Timer 3: Count */
#define TMR3CLR         PIC32_R (0x40414)
#define TMR3SET         PIC32_R (0x40418)
#define TMR3INV         PIC32_R (0x4041C)
#define PR3             PIC32_R (0x40420) /* Timer 3: Period register */
#define PR3CLR          PIC32_R (0x40424)
#define PR3SET          PIC32_R (0x40428)
#define PR3INV          PIC32_R (0x4042C)
#define T4CON           PIC32_R (0x40600) /* Timer 4: Control */
#define T4CONCLR        PIC32_R (0x40604)
#define T4CONSET        PIC32_R (0x40608)
#define T4CONINV        PIC32_R (0x4060C)
#define TMR4            PIC32_R (0x40610) /* Timer 4: Count */
#define TMR4CLR         PIC32_R (0x40614)
#define TMR4SET         PIC32_R (0x40618)
#define TMR4INV         PIC32_R (0x4061C)
#define PR4             PIC32_R (0x40620) /* Timer 4: Period register */
#define PR4CLR          PIC32_R (0x40624)
#define PR4SET          PIC32_R (0x40628)
#define PR4INV          PIC32_R (0x4062C)
#define T5CON           PIC32_R (0x40800) /* Timer 5: Control */
#define T5CONCLR        PIC32_R (0x40804)
#define T5CONSET        PIC32_R (0x40808)
#define T5CONINV        PIC32_R (0x4080C)
#define TMR5            PIC32_R (0x40810) /* Timer 5: Count */
#define TMR5CLR         PIC32_R (0x40814)
#define TMR5SET         PIC32_R (0x40818)
#define TMR5INV         PIC32_R (0x4081C)
#define PR5             PIC32_R (0x40820) /* Timer 5: Period register */
#define PR5CLR          PIC32_R (0x40824)
#define PR5SET          PIC32_R (0x40828)
#define PR5INV          PIC32_R (0x4082C)
#define T6CON           PIC32_R (0x40A00) /* Timer 6: Control */
#define T6CONCLR        PIC32_R (0x40A04)
#define T6CONSET        PIC32_R (0x40A08)
#define T6CONINV        PIC32_R (0x40A0C)
#define TMR6            PIC32_R (0x40A10) /* Timer 6: Count */
#define TMR6CLR         PIC32_R (0x40A14)
#define TMR6SET         PIC32_R (0x40A18)
#define TMR6INV         PIC32_R (0x40A1C)
#define PR6             PIC32_R (0x40A20) /* Timer 6: Period register */
#define PR6CLR          PIC32_R (0x40A24)
#define PR6SET          PIC32_R (0x40A28)
#define PR6INV          PIC32_R (0x40A2C)
#define T7CON           PIC32_R (0x40C00) /* Timer 7: Control */
#define T7CONCLR        PIC32_R (0x40C04)
#define T7CONSET        PIC32_R (0x40C08)
#define T7CONINV        PIC32_R (0x40C0C)
#define TMR7            PIC32_R (0x40C10) /* Timer 7: Count */
#define TMR7CLR         PIC32_R (0x40C14)
#define TMR7SET         PIC32_R (0x40C18)
#define TMR7INV         PIC32_R (0x40C1C)
#define PR7             PIC32_R (0x40C20) /* Timer 7: Period register */
#define PR7CLR          PIC32_R (0x40C24)
#define PR7SET          PIC32_R (0x40C28)
#define PR7INV          PIC32_R (0x40C2C)
#define T8CON           PIC32_R (0x40E00) /* Timer 8: Control */
#define T8CONCLR        PIC32_R (0x40E04)
#define T8CONSET        PIC32_R (0x40E08)
#define T8CONINV        PIC32_R (0x40E0C)
#define TMR8            PIC32_R (0x40E10) /* Timer 8: Count */
#define TMR8CLR         PIC32_R (0x40E14)
#define TMR8SET         PIC32_R (0x40E18)
#define TMR8INV         PIC32_R (0x40E1C)
#define PR8             PIC32_R (0x40E20) /* Timer 8: Period register */
#define PR8CLR          PIC32_R (0x40E24)
#define PR8SET          PIC32_R (0x40E28)
#define PR8INV          PIC32_R (0x40E2C)
#define T9CON           PIC32_R (0x41000) /* Timer 9: Control */
#define T9CONCLR        PIC32_R (0x41004)
#define T9CONSET        PIC32_R (0x41008)
#define T9CONINV        PIC32_R (0x4100C)
#define TMR9            PIC32_R (0x41010) /* Timer 9: Count */
#define TMR9CLR         PIC32_R (0x41014)
#define TMR9SET         PIC32_R (0x41018)
#define TMR9INV         PIC32_R (0x4101C)
#define PR9             PIC32_R (0x41020) /* Timer 9: Period register */
#define PR9CLR          PIC32_R (0x41024)
#define PR9SET          PIC32_R (0x41028)
#define PR9INV          PIC32_R (0x4102C)

#define TCON(n)         *(&T1CON + (n - 1) * (&T2CON - &T1CON))
#define TCONCLR(n)      *(&T1CONCLR + (n - 1) * (&T2CONCLR - &T1CONCLR))
#define TCONSET(n)      *(&T1CONSET + (n - 1) * (&T2CONSET - &T1CONSET))
#define TCONINV(n)      *(&T1CONINV + (n - 1) * (&T2CONINV - &T1CONINV))

#define TMR(n)         *(&TMR1 + (n - 1) * (&TMR2 - &TMR1))
#define TMRCLR(n)      *(&TMR1CLR + (n - 1) * (&TMR2CLR - &TMR1CLR))
#define TMRSET(n)      *(&TMR1SET + (n - 1) * (&TMR2SET - &TMR1SET))
#define TMRINV(n)      *(&TMR1INV + (n - 1) * (&TMR2INV - &TMR1INV))

#define PR(n)         *(&PR1 + (n - 1) * (&PR2 - &PR1))
#define PRCLR(n)      *(&PR1CLR + (n - 1) * (&PR2CLR - &PR1CLR))
#define PRSET(n)      *(&PR1SET + (n - 1) * (&PR2SET - &PR1SET))
#define PRINV(n)      *(&PR1INV + (n - 1) * (&PR2INV - &PR1INV))

