whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*--------------------------------------
 * Parallel master port registers.
 */
#define PMCON           PIC32_R (0x2E000) /* Control */
#define PMCONCLR        PIC32_R (0x2E004)
#define PMCONSET        PIC32_R (0x2E008)
#define PMCONINV        PIC32_R (0x2E00C)
#define PMMODE          PIC32_R (0x2E010) /* Mode */
#define PMMODECLR       PIC32_R (0x2E014)
#define PMMODESET       PIC32_R (0x2E018)
#define PMMODEINV       PIC32_R (0x2E01C)
#define PMADDR          PIC32_R (0x2E020) /* Address */
#define PMADDRCLR       PIC32_R (0x2E024)
#define PMADDRSET       PIC32_R (0x2E028)
#define PMADDRINV       PIC32_R (0x2E02C)
#define PMDOUT          PIC32_R (0x2E030) /* Data output */
#define PMDOUTCLR       PIC32_R (0x2E034)
#define PMDOUTSET       PIC32_R (0x2E038)
#define PMDOUTINV       PIC32_R (0x2E03C)
#define PMDIN           PIC32_R (0x2E040) /* Data input */
#define PMDINCLR        PIC32_R (0x2E044)
#define PMDINSET        PIC32_R (0x2E048)
#define PMDININV        PIC32_R (0x2E04C)
#define PMAEN           PIC32_R (0x2E050) /* Pin enable */
#define PMAENCLR        PIC32_R (0x2E054)
#define PMAENSET        PIC32_R (0x2E058)
#define PMAENINV        PIC32_R (0x2E05C)
#define PMSTAT          PIC32_R (0x2E060) /* Status (slave only) */
#define PMSTATCLR       PIC32_R (0x2E064)
#define PMSTATSET       PIC32_R (0x2E068)
#define PMSTATINV       PIC32_R (0x2E06C)

/*
 * PMP Control register.
 */
#define PIC32_PMCON_RDSP        0x0001 /* Read strobe polarity active-high */
#define PIC32_PMCON_WRSP        0x0002 /* Write strobe polarity active-high */
#define PIC32_PMCON_CS1P        0x0008 /* Chip select 0 polarity active-high */
#define PIC32_PMCON_CS2P        0x0010 /* Chip select 1 polarity active-high */
#define PIC32_PMCON_ALP         0x0020 /* Address latch polarity active-high */
#define PIC32_PMCON_CSF         0x00C0 /* Chip select function bitmask: */
#define PIC32_PMCON_CSF_NONE    0x0000 /* PMCS2 and PMCS1 as A[15:14] */
#define PIC32_PMCON_CSF_CS2     0x0040 /* PMCS2 as chip select */
#define PIC32_PMCON_CSF_CS21    0x0080 /* PMCS2 and PMCS1 as chip select */
#define PIC32_PMCON_PTRDEN      0x0100 /* Read/write strobe port enable */
#define PIC32_PMCON_PTWREN      0x0200 /* Write enable strobe port enable */
#define PIC32_PMCON_PMPTTL      0x0400 /* TTL input buffer select */
#define PIC32_PMCON_ADRMUX      0x1800 /* Address/data mux selection bitmask: */
#define PIC32_PMCON_ADRMUX_NONE 0x0000 /* Address and data separate */
#define PIC32_PMCON_ADRMUX_AD   0x0800 /* Lower address on PMD[7:0], high on PMA[15:8] */
#define PIC32_PMCON_ADRMUX_D8   0x1000 /* All address on PMD[7:0] */
#define PIC32_PMCON_ADRMUX_D16  0x1800 /* All address on PMD[15:0] */
#define PIC32_PMCON_SIDL        0x2000 /* Stop in idle */
#define PIC32_PMCON_FRZ         0x4000 /* Freeze in debug exception */
#define PIC32_PMCON_ON          0x8000 /* Parallel master port enable */

/*
 * PMP Mode register.
 */
#define PIC32_PMMODE_WAITE(x)   ((x)<<0) /* Wait states: data hold after RW strobe */
#define PIC32_PMMODE_WAITM(x)   ((x)<<2) /* Wait states: data RW strobe */
#define PIC32_PMMODE_WAITB(x)   ((x)<<6) /* Wait states: data setup to RW strobe */
#define PIC32_PMMODE_MODE       0x0300  /* Mode select bitmask: */
#define PIC32_PMMODE_MODE_SLAVE 0x0000  /* Legacy slave */
#define PIC32_PMMODE_MODE_SLENH 0x0100  /* Enhanced slave */
#define PIC32_PMMODE_MODE_MAST2 0x0200  /* Master mode 2 */
#define PIC32_PMMODE_MODE_MAST1 0x0300  /* Master mode 1 */
#define PIC32_PMMODE_MODE16     0x0400  /* 16-bit mode */
#define PIC32_PMMODE_INCM       0x1800  /* Address increment mode bitmask: */
#define PIC32_PMMODE_INCM_NONE  0x0000  /* No increment/decrement */
#define PIC32_PMMODE_INCM_INC   0x0800  /* Increment address */
#define PIC32_PMMODE_INCM_DEC   0x1000  /* Decrement address */
#define PIC32_PMMODE_INCM_SLAVE 0x1800  /* Slave auto-increment */
#define PIC32_PMMODE_IRQM       0x6000  /* Interrupt request bitmask: */
#define PIC32_PMMODE_IRQM_DIS   0x0000  /* No interrupt generated */
#define PIC32_PMMODE_IRQM_END   0x2000  /* Interrupt at end of read/write cycle */
#define PIC32_PMMODE_IRQM_A3    0x4000  /* Interrupt on address 3 */
#define PIC32_PMMODE_BUSY       0x8000  /* Port is busy */

/*
 * PMP Address register.
 */
#define PIC32_PMADDR_PADDR      0x3FFF /* Destination address */
#define PIC32_PMADDR_CS1        0x4000 /* Chip select 1 is active */
#define PIC32_PMADDR_CS2        0x8000 /* Chip select 2 is active */

/*
 * PMP status register (slave only).
 */
#define PIC32_PMSTAT_OB0E       0x0001 /* Output buffer 0 empty */
#define PIC32_PMSTAT_OB1E       0x0002 /* Output buffer 1 empty */
#define PIC32_PMSTAT_OB2E       0x0004 /* Output buffer 2 empty */
#define PIC32_PMSTAT_OB3E       0x0008 /* Output buffer 3 empty */
#define PIC32_PMSTAT_OBUF       0x0040 /* Output buffer underflow */
#define PIC32_PMSTAT_OBE        0x0080 /* Output buffer empty */
#define PIC32_PMSTAT_IB0F       0x0100 /* Input buffer 0 full */
#define PIC32_PMSTAT_IB1F       0x0200 /* Input buffer 1 full */
#define PIC32_PMSTAT_IB2F       0x0400 /* Input buffer 2 full */
#define PIC32_PMSTAT_IB3F       0x0800 /* Input buffer 3 full */
#define PIC32_PMSTAT_IBOV       0x4000 /* Input buffer overflow */
#define PIC32_PMSTAT_IBF        0x8000 /* Input buffer full */

/*--------------------------------------
 * UART registers.
 */
#define U1MODE          PIC32_R (0x22000) /* Mode */
#define U1MODECLR       PIC32_R (0x22004)
#define U1MODESET       PIC32_R (0x22008)
#define U1MODEINV       PIC32_R (0x2200C)
#define U1STA           PIC32_R (0x22010) /* Status and control */
#define U1STACLR        PIC32_R (0x22014)
#define U1STASET        PIC32_R (0x22018)
#define U1STAINV        PIC32_R (0x2201C)
#define U1TXREG         PIC32_R (0x22020) /* Transmit */
#define U1RXREG         PIC32_R (0x22030) /* Receive */
#define U1BRG           PIC32_R (0x22040) /* Baud rate */
#define U1BRGCLR        PIC32_R (0x22044)
#define U1BRGSET        PIC32_R (0x22048)
#define U1BRGINV        PIC32_R (0x2204C)

#define U2MODE          PIC32_R (0x22200) /* Mode */
#define U2MODECLR       PIC32_R (0x22204)
#define U2MODESET       PIC32_R (0x22208)
#define U2MODEINV       PIC32_R (0x2220C)
#define U2STA           PIC32_R (0x22210) /* Status and control */
#define U2STACLR        PIC32_R (0x22214)
#define U2STASET        PIC32_R (0x22218)
#define U2STAINV        PIC32_R (0x2221C)
#define U2TXREG         PIC32_R (0x22220) /* Transmit */
#define U2RXREG         PIC32_R (0x22230) /* Receive */
#define U2BRG           PIC32_R (0x22240) /* Baud rate */
#define U2BRGCLR        PIC32_R (0x22244)
#define U2BRGSET        PIC32_R (0x22248)
#define U2BRGINV        PIC32_R (0x2224C)

#define U3MODE          PIC32_R (0x22400) /* Mode */
#define U3MODECLR       PIC32_R (0x22404)
#define U3MODESET       PIC32_R (0x22408)
#define U3MODEINV       PIC32_R (0x2240C)
#define U3STA           PIC32_R (0x22410) /* Status and control */
#define U3STACLR        PIC32_R (0x22414)
#define U3STASET        PIC32_R (0x22418)
#define U3STAINV        PIC32_R (0x2241C)
#define U3TXREG         PIC32_R (0x22420) /* Transmit */
#define U3RXREG         PIC32_R (0x22430) /* Receive */
#define U3BRG           PIC32_R (0x22440) /* Baud rate */
#define U3BRGCLR        PIC32_R (0x22444)
#define U3BRGSET        PIC32_R (0x22448)
#define U3BRGINV        PIC32_R (0x2244C)

#define U4MODE          PIC32_R (0x22600) /* Mode */
#define U4MODECLR       PIC32_R (0x22604)
#define U4MODESET       PIC32_R (0x22608)
#define U4MODEINV       PIC32_R (0x2260C)
#define U4STA           PIC32_R (0x22610) /* Status and control */
#define U4STACLR        PIC32_R (0x22614)
#define U4STASET        PIC32_R (0x22618)
#define U4STAINV        PIC32_R (0x2261C)
#define U4TXREG         PIC32_R (0x22620) /* Transmit */
#define U4RXREG         PIC32_R (0x22630) /* Receive */
#define U4BRG           PIC32_R (0x22640) /* Baud rate */
#define U4BRGCLR        PIC32_R (0x22644)
#define U4BRGSET        PIC32_R (0x22648)
#define U4BRGINV        PIC32_R (0x2264C)

