whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*--------------------------------------
 * Prefetch cache controller registers.
 */
#define PRECON          PIC32_R (0xe0000)       /* Prefetch cache control */
#define PRECONCLR       PIC32_R (0xe0004)
#define PRECONSET       PIC32_R (0xe0008)
#define PRECONINV       PIC32_R (0xe000C)
#define PRESTAT         PIC32_R (0xe0010)       /* Prefetch status */
#define PRESTATCLR      PIC32_R (0xe0014)
#define PRESTATSET      PIC32_R (0xe0018)
#define PRESTATINV      PIC32_R (0xe001C)
// TODO: other prefetch registers

/*--------------------------------------
 * System controller registers.
 */
#define CFGCON          PIC32_R (0x0000)
#define DEVID           PIC32_R (0x0020)
#define SYSKEY          PIC32_R (0x0030)
#define CFGEBIA         PIC32_R (0x00c0)
#define CFGEBIACLR      PIC32_R (0x00c4)
#define CFGEBIASET      PIC32_R (0x00c8)
#define CFGEBIAINV      PIC32_R (0x00cc)
#define CFGEBIC         PIC32_R (0x00d0)
#define CFGEBICCLR      PIC32_R (0x00d4)
#define CFGEBICSET      PIC32_R (0x00d8)
#define CFGEBICINV      PIC32_R (0x00dc)
#define CFGPG           PIC32_R (0x00e0)

// WHITECAT BEGIN
#define I2C1CON          PIC32_R (0x20000)
#define I2C1CONCLR       PIC32_R (0x20004)
#define I2C1CONSET       PIC32_R (0x20008)
#define I2C1CONINV       PIC32_R (0x2000C)
#define I2C1STAT         PIC32_R (0x20010)
#define I2C1STATCLR      PIC32_R (0x20014)
#define I2C1STATSET      PIC32_R (0x20018)
#define I2C1STATINV      PIC32_R (0x2001C)
#define I2C1ADD          PIC32_R (0x20020)
#define I2C1ADDCLR       PIC32_R (0x20024)
#define I2C1ADDSET       PIC32_R (0x20028)
#define I2C1ADDINV       PIC32_R (0x2002C)
#define I2C1MSK          PIC32_R (0x20030)
#define I2C1MSKCLR       PIC32_R (0x20034)
#define I2C1MSKSET       PIC32_R (0x20038)
#define I2C1MSKINV       PIC32_R (0x2003C)
#define I2C1BRG          PIC32_R (0x20040)
#define I2C1BRGCLR       PIC32_R (0x20044)
#define I2C1BRGSET       PIC32_R (0x20048)
#define I2C1BRGINV       PIC32_R (0x2004C)
#define I2C1TRN          PIC32_R (0x20050)
#define I2C1TRNCLR       PIC32_R (0x20054)
#define I2C1TRNSET       PIC32_R (0x20058)
#define I2C1TRNINV       PIC32_R (0x2005C)
#define I2C1RCV          PIC32_R (0x20060)
#define I2C1RCVCLR       PIC32_R (0x20064)
#define I2C1RCVSET       PIC32_R (0x20068)
#define I2C1RCVINV       PIC32_R (0x2006C)
#define I2C3CON          PIC32_R (0x20400)
#define I2C3CONCLR       PIC32_R (0x20404)
#define I2C3CONSET       PIC32_R (0x20408)
#define I2C3CONINV       PIC32_R (0x2040C)
#define I2C3STAT         PIC32_R (0x20410)
#define I2C3STATCLR      PIC32_R (0x20414)
#define I2C3STATSET      PIC32_R (0x20418)
#define I2C3STATINV      PIC32_R (0x2041C)
#define I2C3ADD          PIC32_R (0x20420)
#define I2C3ADDCLR       PIC32_R (0x20424)
#define I2C3ADDSET       PIC32_R (0x20428)
#define I2C3ADDINV       PIC32_R (0x2042C)
#define I2C3MSK          PIC32_R (0x20430)
#define I2C3MSKCLR       PIC32_R (0x20434)
#define I2C3MSKSET       PIC32_R (0x20438)
#define I2C3MSKINV       PIC32_R (0x2043C)
#define I2C3BRG          PIC32_R (0x20440)
#define I2C3BRGCLR       PIC32_R (0x20444)
#define I2C3BRGSET       PIC32_R (0x20448)
#define I2C3BRGINV       PIC32_R (0x2044C)
#define I2C3TRN          PIC32_R (0x20450)
#define I2C3TRNCLR       PIC32_R (0x20454)
#define I2C3TRNSET       PIC32_R (0x20458)
#define I2C3TRNINV       PIC32_R (0x2045C)
#define I2C3RCV          PIC32_R (0x20460)
#define I2C3RCVCLR       PIC32_R (0x20464)
#define I2C3RCVSET       PIC32_R (0x20468)
#define I2C3RCVINV       PIC32_R (0x2046C)
#define I2C4CON          PIC32_R (0x20600)
#define I2C4CONCLR       PIC32_R (0x20604)
#define I2C4CONSET       PIC32_R (0x20608)
#define I2C4CONINV       PIC32_R (0x2060C)
#define I2C4STAT         PIC32_R (0x20610)
#define I2C4STATCLR      PIC32_R (0x20614)
#define I2C4STATSET      PIC32_R (0x20618)
#define I2C4STATINV      PIC32_R (0x2061C)
#define I2C4ADD          PIC32_R (0x20620)
#define I2C4ADDCLR       PIC32_R (0x20624)
#define I2C4ADDSET       PIC32_R (0x20628)
#define I2C4ADDINV       PIC32_R (0x2062C)
#define I2C4MSK          PIC32_R (0x20630)
#define I2C4MSKCLR       PIC32_R (0x20634)
#define I2C4MSKSET       PIC32_R (0x20638)
#define I2C4MSKINV       PIC32_R (0x2063C)
#define I2C4BRG          PIC32_R (0x20640)
#define I2C4BRGCLR       PIC32_R (0x20644)
#define I2C4BRGSET       PIC32_R (0x20648)
#define I2C4BRGINV       PIC32_R (0x2064C)
#define I2C4TRN          PIC32_R (0x20650)
#define I2C4TRNCLR       PIC32_R (0x20654)
#define I2C4TRNSET       PIC32_R (0x20658)
#define I2C4TRNINV       PIC32_R (0x2065C)
#define I2C4RCV          PIC32_R (0x20660)
#define I2C4RCVCLR       PIC32_R (0x20664)
#define I2C4RCVSET       PIC32_R (0x20668)
#define I2C4RCVINV       PIC32_R (0x2066C)
#define I2C5CON          PIC32_R (0x20800)
#define I2C5CONCLR       PIC32_R (0x20804)
#define I2C5CONSET       PIC32_R (0x20808)
#define I2C5CONINV       PIC32_R (0x2080C)
#define I2C5STAT         PIC32_R (0x20810)
#define I2C5STATCLR      PIC32_R (0x20814)
#define I2C5STATSET      PIC32_R (0x20818)
#define I2C5STATINV      PIC32_R (0x2081C)
#define I2C5ADD          PIC32_R (0x20820)
#define I2C5ADDCLR       PIC32_R (0x20824)
#define I2C5ADDSET       PIC32_R (0x20828)
#define I2C5ADDINV       PIC32_R (0x2082C)
#define I2C5MSK          PIC32_R (0x20830)
#define I2C5MSKCLR       PIC32_R (0x20834)
#define I2C5MSKSET       PIC32_R (0x20838)
#define I2C5MSKINV       PIC32_R (0x2083C)
#define I2C5BRG          PIC32_R (0x20840)
#define I2C5BRGCLR       PIC32_R (0x20844)
#define I2C5BRGSET       PIC32_R (0x20848)
#define I2C5BRGINV       PIC32_R (0x2084C)
#define I2C5TRN          PIC32_R (0x20850)
#define I2C5TRNCLR       PIC32_R (0x20854)
#define I2C5TRNSET       PIC32_R (0x20858)
#define I2C5TRNINV       PIC32_R (0x2085C)
#define I2C5RCV          PIC32_R (0x20860)
#define I2C5RCVCLR       PIC32_R (0x20864)
#define I2C5RCVSET       PIC32_R (0x20868)
#define I2C5RCVINV       PIC32_R (0x2086C) 

#define RTCCON          PIC32_R (0x0C00)
#define RTCCONCLR       PIC32_R (0x0C04)
#define RTCCONSET       PIC32_R (0x0C08)
#define RTCCONINV       PIC32_R (0x0C0C)
#define RTCALRM         PIC32_R (0x0C10)
#define RTCALRMCLR      PIC32_R (0x0C14)
#define RTCALRMSET      PIC32_R (0x0C18)
#define RTCALRMINV      PIC32_R (0x0C1C)
#define RTCTIME         PIC32_R (0x0C20)
#define RTCTIMECLR      PIC32_R (0x0C24)
#define RTCTIMESET      PIC32_R (0x0C28)
#define RTCTIMEINV      PIC32_R (0x0C2C)
#define RTCDATE         PIC32_R (0x0C30)
#define RTCDATECLR      PIC32_R (0x0C34)
#define RTCDATESET      PIC32_R (0x0C38)
#define RTCDATEINV      PIC32_R (0x0C3C)
#define ALRMTIME        PIC32_R (0x0C40)
#define ALRMTIMECLR     PIC32_R (0x0C44)
#define ALRMTIMESET     PIC32_R (0x0C48)
#define ALRMTIMEINV     PIC32_R (0x0C4C)
#define ALRMDATE        PIC32_R (0x0C50)
#define ALRMDATECLR     PIC32_R (0x0C54)
#define ALRMDATESET     PIC32_R (0x0C58)
#define ALRMDATEINV     PIC32_R (0x0C5C)
  
  
#define NVMCON          PIC32_R (0x0600)
#define NVMCONCLR       PIC32_R (0x0604)
#define NVMCONSET       PIC32_R (0x0608)
#define NVMCONINV       PIC32_R (0x060c)
#define NVMKEY          PIC32_R (0x0610)
#define NVMADDR         PIC32_R (0x0620)
#define NVMADDRCLR      PIC32_R (0x0624)
#define NVMADDRSET      PIC32_R (0x0628)
#define NVMADDRINV      PIC32_R (0x062c)
#define NVMDATA0        PIC32_R (0x0630)
#define NVMSRCADDR      PIC32_R (0x0670)
// WHITECAT END
  
#define OSCCON          PIC32_R (0x1200)    /* Oscillator Control */
#define OSCCONCLR       PIC32_R (0x1204)    
#define OSCCONSET       PIC32_R (0x1208)    
#define OSCCONINV       PIC32_R (0x120C)    
#define OSCTUN          PIC32_R (0x1210)
#define SPLLCON         PIC32_R (0x1220)
#define RCON            PIC32_R (0x1240)
#define RCONCLR         PIC32_R (0x1244)
#define RCONSET         PIC32_R (0x1248)
#define RCONINV         PIC32_R (0x124C)
#define RSWRST          PIC32_R (0x1250)
#define RSWRSTCLR       PIC32_R (0x1254)
#define RSWRSTSET       PIC32_R (0x1258)
#define RSWRSTINV       PIC32_R (0x125c)
#define RNMICON         PIC32_R (0x1260)
#define PWRCON          PIC32_R (0x1270)
#define REFO1CON        PIC32_R (0x1280)
#define REFO1CONCLR     PIC32_R (0x1284)
#define REFO1CONSET     PIC32_R (0x1288)
#define REFO1CONINV     PIC32_R (0x128c)
#define REFO1TRIM       PIC32_R (0x1290)
#define REFO2CON        PIC32_R (0x12A0)
#define REFO2CONCLR     PIC32_R (0x12A4)
#define REFO2CONSET     PIC32_R (0x12A8)
#define REFO2CONINV     PIC32_R (0x12Ac)
#define REFO2TRIM       PIC32_R (0x12B0)
#define REFO3CON        PIC32_R (0x12C0)
#define REFO3CONCLR     PIC32_R (0x12C4)
#define REFO3CONSET     PIC32_R (0x12C8)
#define REFO3CONINV     PIC32_R (0x12Cc)
#define REFO3TRIM       PIC32_R (0x12D0)
#define REFO4CON        PIC32_R (0x12E0)
#define REFO4CONCLR     PIC32_R (0x12E4)
#define REFO4CONSET     PIC32_R (0x12E8)
#define REFO4CONINV     PIC32_R (0x12Ec)
#define REFO4TRIM       PIC32_R (0x12F0)
#define PB1DIV          PIC32_R (0x1300)
#define PB1DIVCLR       PIC32_R (0x1304)
#define PB1DIVSET       PIC32_R (0x1308)
#define PB1DIVINV       PIC32_R (0x130c)
#define PB2DIV          PIC32_R (0x1310)
#define PB2DIVCLR       PIC32_R (0x1314)
#define PB2DIVSET       PIC32_R (0x1318)
#define PB2DIVINV       PIC32_R (0x131c)
#define PB3DIV          PIC32_R (0x1320)
#define PB3DIVCLR       PIC32_R (0x1324)
#define PB3DIVSET       PIC32_R (0x1328)
#define PB3DIVINV       PIC32_R (0x132c)
#define PB4DIV          PIC32_R (0x1330)
#define PB4DIVCLR       PIC32_R (0x1334)
#define PB4DIVSET       PIC32_R (0x1338)
#define PB4DIVINV       PIC32_R (0x133c)
#define PB5DIV          PIC32_R (0x1340)
#define PB5DIVCLR       PIC32_R (0x1344)
#define PB5DIVSET       PIC32_R (0x1348)
#define PB5DIVINV       PIC32_R (0x134c)
#define PB7DIV          PIC32_R (0x1360)
#define PB7DIVCLR       PIC32_R (0x1364)
#define PB7DIVSET       PIC32_R (0x1368)
#define PB7DIVINV       PIC32_R (0x136c)
#define PB8DIV          PIC32_R (0x1370)
#define PB8DIVCLR       PIC32_R (0x1374)
#define PB8DIVSET       PIC32_R (0x1378)
#define PB8DIVINV       PIC32_R (0x137c)

