whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*
 * Configuration Control register.
 */
#define PIC32_CFGCON_DMAPRI     0x02000000 /* DMA gets High Priority access to SRAM */
#define PIC32_CFGCON_CPUPRI     0x01000000 /* CPU gets High Priority access to SRAM */
#define PIC32_CFGCON_ICACLK     0x00020000 /* Input Capture alternate clock selection */
#define PIC32_CFGCON_OCACLK     0x00010000 /* Output Compare alternate clock selection */
#define PIC32_CFGCON_IOLOCK     0x00002000 /* Peripheral pin select lock */
#define PIC32_CFGCON_PMDLOCK    0x00001000 /* Peripheral module disable */
#define PIC32_CFGCON_PGLOCK     0x00000800 /* Permission group lock */
#define PIC32_CFGCON_USBSSEN    0x00000100 /* USB suspend sleep enable */
#define PIC32_CFGCON_ECC_MASK   0x00000030 /* Flash ECC Configuration */
#define PIC32_CFGCON_ECC_DISWR  0x00000030 /* ECC disabled, ECCCON<1:0> writable */
#define PIC32_CFGCON_ECC_DISRO  0x00000020 /* ECC disabled, ECCCON<1:0> locked */
#define PIC32_CFGCON_ECC_DYN    0x00000010 /* Dynamic Flash ECC is enabled */
#define PIC32_CFGCON_ECC_EN     0x00000000 /* Flash ECC is enabled */
#define PIC32_CFGCON_JTAGEN     0x00000008 /* JTAG port enable */
#define PIC32_CFGCON_TROEN      0x00000004 /* Trace output enable */
#define PIC32_CFGCON_TDOEN      0x00000001 /* 2-wire JTAG protocol uses TDO */


/*--------------------------------------
 * A/D Converter registers.
 */
#define AD1CON1         PIC32_R (0x4b000)   /* revised Control register 1 */
#define AD1CON2         PIC32_R (0x4b004)   /* revised Control register 2 */
#define AD1CON3         PIC32_R (0x4b008)   /* revised Control register 3 */
#define AD1TRGMODE      PIC32_R (0x4b00c)   /* revised */
#define AD1IMCON1       PIC32_R (0x4b010)   /* revised */
#define AD1IMCON2       PIC32_R (0x4b014)   /* revised */
#define AD1IMCON3       PIC32_R (0x4b018)   /* revised */
#define AD1GIRQEN1      PIC32_R (0x4b020)   /* revised */
#define AD1GIRQEN2      PIC32_R (0x4b024)   /* revised */
#define AD1CSS1         PIC32_R (0x4b028)   /* revised */
#define AD1CSS2         PIC32_R (0x4b02c)   /* revised */
#define AD1DSTAT1       PIC32_R (0x4b030)   /* revised */
#define AD1DSTAT2       PIC32_R (0x4b034)   /* revised */
#define AD1TRG1         PIC32_R (0x4b080)   /* revised */
#define AD1TRG2         PIC32_R (0x4b084)   /* revised */
#define AD1TRG3         PIC32_R (0x4b088)   /* revised */
#define AD1ANCON        PIC32_R (0x4b100)   /* revised */
#define AD1TRGSNS       PIC32_R (0x4b0d0)   /* revised */
#define AD10TIME        PIC32_R (0x4b0d4)   /* revised */
#define AD11TIME        PIC32_R (0x4b0d8)   /* revised */
#define AD12TIME        PIC32_R (0x4b0dc)   /* revised */
#define AD13TIME        PIC32_R (0x4b0e0)   /* revised */
#define AD14TIME        PIC32_R (0x4b0e4)   /* revised */
#define AD1DATA0        PIC32_R (0x4b200)   /* revised */
#define AD1FLTR1        PIC32_R (0x4b068)   /* revised */
#define AD1FLTR2        PIC32_R (0x4b06c)   /* revised */
#define AD1FLTR3        PIC32_R (0x4b070)   /* revised */
#define AD1FLTR4        PIC32_R (0x4b074)   /* revised */
#define AD1FLTR5        PIC32_R (0x4b078)   /* revised */
#define AD1FLTR6        PIC32_R (0x4b07c)   /* revised */
#define AD1CMPCON1      PIC32_R (0x4b0a0)   /* revised */
#define AD1CMPCON2      PIC32_R (0x4b0a4)   /* revised */
#define AD1CMPCON3      PIC32_R (0x4b0a8)   /* revised */
#define AD1CMPCON4      PIC32_R (0x4b0ac)   /* revised */
#define AD1CMPCON5      PIC32_R (0x4b0b0)   /* revised */
#define AD1CMPCON6      PIC32_R (0x4b0b4)   /* revised */
#define AD1EIEN1        PIC32_R (0x4b0f0)   /* revised */
#define AD1EIEN2        PIC32_R (0x4b0f4)   /* revised */
  
/*--------------------------------------
* PMD registers.
*/
// PMD1
#define CVRMD  (1 << 12)
#define ADCMD  (1 <<  0)

// PMD2
#define CMP2MD (1 << 17)
#define CMP1MD (1 << 17)

// PMD3
#define OC9MD   (1 << 24)
#define OC8MD   (1 << 23)
#define OC7MD   (1 << 22)
#define OC6MD   (1 << 21)
#define OC5MD   (1 << 20)
#define OC4MD   (1 << 19)
#define OC3MD   (1 << 18)
#define OC2MD   (1 << 17)
#define OC1MD   (1 << 16)
#define IC9MD   (1 <<  8)
#define IC8MD   (1 <<  7)
#define IC7MD   (1 <<  6)
#define IC6MD   (1 <<  5)
#define IC5MD   (1 <<  4)
#define IC4MD   (1 <<  3)
#define IC3MD   (1 <<  2)
#define IC2MD   (1 <<  1)
#define IC1MD   (1 <<  0)

// PMD4
#define T9MD    (1 <<  8)
#define T8MD    (1 <<  7)
#define T7MD    (1 <<  6)
#define T6MD    (1 <<  5)
#define T5MD    (1 <<  4)
#define T4MD    (1 <<  3)
#define T3MD    (1 <<  2)
#define T2MD    (1 <<  1)
#define T1MD    (1 <<  0)

// PMD5
#define CAN2MD  (1 << 29)
#define CAN1MD  (1 << 28)
#define USBMD   (1 << 24)
#define I2C5MD  (1 << 20)
#define I2C4MD  (1 << 19)
#define I2C3MD  (1 << 18)
#define I2C2MD  (1 << 17)
#define I2C1MD  (1 << 16)
#define SPI6MD  (1 << 13)
#define SPI5MD  (1 << 12)
#define SPI4MD  (1 << 11)
#define SPI3MD  (1 << 10)
#define SPI2MD  (1 <<  9)
#define SPI1MD  (1 <<  8)
#define U6MD    (1 <<  5)
#define U5MD    (1 <<  4)
#define U4MD    (1 <<  3)
#define U3MD    (1 <<  2)
#define U2MD    (1 <<  1)
#define U1MD    (1 <<  0)

// PMD6
#define ETHMD   (1 << 28)
#define SQIMD   (1 << 23)
#define EBIMD   (1 << 17)
#define PMPMD   (1 << 16)
#define REFO4MD (1 << 11)
#define REFO3MD (1 << 10)
#define REFO2MD (1 <<  9)
#define REFO1MD (1 <<  8)
#define RTCCMD  (1 <<  0)

// PMD7
#define CRYPTMD (1 << 22)
#define RNGMD   (1 << 20)
#define DMAMD   (1 <<  4)

#define PMD1             PIC32_R ( 0x00040 )
#define PMD1CLR          PIC32_R ( 0x00044 )
#define PMD1SET          PIC32_R ( 0x00048 )
#define PMD1INV          PIC32_R ( 0x0004C )
#define PMD2             PIC32_R ( 0x00050 )
#define PMD2CLR          PIC32_R ( 0x00054 )
#define PMD2SET          PIC32_R ( 0x00058 )
#define PMD2INV          PIC32_R ( 0x0005C )
#define PMD3             PIC32_R ( 0x00060 )
#define PMD3CLR          PIC32_R ( 0x00064 )
#define PMD3SET          PIC32_R ( 0x00068 )
#define PMD3INV          PIC32_R ( 0x0006C )
#define PMD4             PIC32_R ( 0x00070 )
#define PMD4CLR          PIC32_R ( 0x00074 )
#define PMD4SET          PIC32_R ( 0x00078 )
#define PMD4INV          PIC32_R ( 0x0007C )
#define PMD5             PIC32_R ( 0x00080 )
#define PMD5CLR          PIC32_R ( 0x00084 )
#define PMD5SET          PIC32_R ( 0x00088 )
#define PMD5INV          PIC32_R ( 0x0008C )
#define PMD6             PIC32_R ( 0x00090 )
#define PMD6CLR          PIC32_R ( 0x00094 )
#define PMD6SET          PIC32_R ( 0x00098 )
#define PMD6INV          PIC32_R ( 0x0009C )
#define PMD7             PIC32_R ( 0x000A0 )
#define PMD7CLR          PIC32_R ( 0x000A4 )
#define PMD7SET          PIC32_R ( 0x000A8 )
#define PMD7INV          PIC32_R ( 0x000AC )
		
