whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*
 * SPI Status register.
 */
#define PIC32_SPISTAT_SPIRBF    0x00000001      /* Receive buffer is full */
#define PIC32_SPISTAT_SPITBF    0x00000002      /* Transmit buffer is full */
#define PIC32_SPISTAT_SPITBE    0x00000008      /* Transmit buffer is empty */
#define PIC32_SPISTAT_SPIRBE    0x00000020      /* Receive buffer is empty */
#define PIC32_SPISTAT_SPIROV    0x00000040      /* Receive overflow flag */
#define PIC32_SPISTAT_SPIBUSY   0x00000800      /* SPI is busy */

/*--------------------------------------
 * USB registers.
 */
#define USBCSR0         PIC32_R (0xE3000)   /*  */
#define USBCSR1         PIC32_R (0xE3004)
#define USBCSR2         PIC32_R (0xE3008)
#define USBCSR3         PIC32_R (0xE300C)
#define USBIENCSR0      PIC32_R (0xE3010)   /*  */
#define USBIENCSR1      PIC32_R (0xE3014)
#define USBIENCSR2      PIC32_R (0xE3018)
#define USBIENCSR3      PIC32_R (0xE301C)
#define USBFIFO0        PIC32_R (0xE3020)   /*  */
#define USBFIFO1        PIC32_R (0xE3024)
#define USBFIFO2        PIC32_R (0xE3028)
#define USBFIFO3        PIC32_R (0xE302C)
#define USBFIFO4        PIC32_R (0xE3030)
#define USBFIFO5        PIC32_R (0xE3034)
#define USBFIFO6        PIC32_R (0xE3038)
#define USBFIFO7        PIC32_R (0xE303C)
#define USBOTG          PIC32_R (0xE3060)   /*  */
#define USBFIFOA        PIC32_R (0xE3064)   /*  */
#define USBHWVER        PIC32_R (0xE306C)   /*  */
#define USBINFO         PIC32_R (0xE3078)   /*  */
#define USBEOFRST       PIC32_R (0xE307C)   /*  */
#define USBE0TXA        PIC32_R (0xE3080)   /*  */
#define USBE0RXA        PIC32_R (0xE3084)   /*  */
#define USBE1TXA        PIC32_R (0xE3088)
#define USBE1RXA        PIC32_R (0xE308C)
#define USBE2TXA        PIC32_R (0xE3090)
#define USBE2RXA        PIC32_R (0xE3094)
#define USBE3TXA        PIC32_R (0xE3098)
#define USBE3RXA        PIC32_R (0xE309C)
#define USBE4TXA        PIC32_R (0xE30A0)
#define USBE4RXA        PIC32_R (0xE30A4)
#define USBE5TXA        PIC32_R (0xE30A8)
#define USBE5RXA        PIC32_R (0xE30AC)
#define USBE6TXA        PIC32_R (0xE30B0)
#define USBE6RXA        PIC32_R (0xE30B4)
#define USBE7TXA        PIC32_R (0xE30B8)
#define USBE7RXA        PIC32_R (0xE30BC)
#define USBE0CSR0       PIC32_R (0xE3100)   /*  */
#define USBE0CSR2       PIC32_R (0xE3108)
#define USBE0CSR3       PIC32_R (0xE310C)
#define USBE1CSR0       PIC32_R (0xE3110)
#define USBE1CSR1       PIC32_R (0xE3114)
#define USBE1CSR2       PIC32_R (0xE3118)
#define USBE1CSR3       PIC32_R (0xE311C)
#define USBE2CSR0       PIC32_R (0xE3120)
#define USBE2CSR1       PIC32_R (0xE3124)
#define USBE2CSR2       PIC32_R (0xE3128)
#define USBE2CSR3       PIC32_R (0xE312C)
#define USBE3CSR0       PIC32_R (0xE3130)
#define USBE3CSR1       PIC32_R (0xE3134)
#define USBE3CSR2       PIC32_R (0xE3138)
#define USBE3CSR3       PIC32_R (0xE313C)
#define USBE4CSR0       PIC32_R (0xE3140)
#define USBE4CSR1       PIC32_R (0xE3144)
#define USBE4CSR2       PIC32_R (0xE3148)
#define USBE4CSR3       PIC32_R (0xE314C)
#define USBE5CSR0       PIC32_R (0xE3150)
#define USBE5CSR1       PIC32_R (0xE3154)
#define USBE5CSR2       PIC32_R (0xE3158)
#define USBE5CSR3       PIC32_R (0xE315C)
#define USBE6CSR0       PIC32_R (0xE3160)
#define USBE6CSR1       PIC32_R (0xE3164)
#define USBE6CSR2       PIC32_R (0xE3168)
#define USBE6CSR3       PIC32_R (0xE316C)
#define USBE7CSR0       PIC32_R (0xE3170)
#define USBE7CSR1       PIC32_R (0xE3174)
#define USBE7CSR2       PIC32_R (0xE3178)
#define USBE7CSR3       PIC32_R (0xE317C)
#define USBDMAINT       PIC32_R (0xE3200)   /*  */
#define USBDMA1C        PIC32_R (0xE3204)   /*  */
#define USBDMA1A        PIC32_R (0xE3208)   /*  */
#define USBDMA1N        PIC32_R (0xE320C)   /*  */
#define USBDMA2C        PIC32_R (0xE3214)
#define USBDMA2A        PIC32_R (0xE3218)
#define USBDMA2N        PIC32_R (0xE321C)
#define USBDMA3C        PIC32_R (0xE3224)
#define USBDMA3A        PIC32_R (0xE3228)
#define USBDMA3N        PIC32_R (0xE322C)
#define USBDMA4C        PIC32_R (0xE3234)
#define USBDMA4A        PIC32_R (0xE3238)
#define USBDMA4N        PIC32_R (0xE323C)
#define USBDMA5C        PIC32_R (0xE3244)
#define USBDMA5A        PIC32_R (0xE3248)
#define USBDMA5N        PIC32_R (0xE324C)
#define USBDMA6C        PIC32_R (0xE3254)
#define USBDMA6A        PIC32_R (0xE3258)
#define USBDMA6N        PIC32_R (0xE325C)
#define USBDMA7C        PIC32_R (0xE3264)
#define USBDMA7A        PIC32_R (0xE3268)
#define USBDMA7N        PIC32_R (0xE326C)
#define USBDMA8C        PIC32_R (0xE3274)
#define USBDMA8A        PIC32_R (0xE3278)
#define USBDMA8N        PIC32_R (0xE327C)
#define USBE1RPC        PIC32_R (0xE3304)   /*  */
#define USBE2RPC        PIC32_R (0xE3308)
#define USBE3RPC        PIC32_R (0xE330C)
#define USBE4RPC        PIC32_R (0xE3310)
#define USBE5RPC        PIC32_R (0xE3314)
#define USBE6RPC        PIC32_R (0xE3318)
#define USBE7RPC        PIC32_R (0xE331C)
#define USBDPBFD        PIC32_R (0xE3340)   /*  */
#define USBTMCON1       PIC32_R (0xE3344)   /*  */
#define USBTMCON2       PIC32_R (0xE3348)   /*  */
#define USBLPMR1        PIC32_R (0xE3360)   /*  */
#define USBLMPR2        PIC32_R (0xE3364)   /*  */

/*--------------------------------------
* DMA registers.
*/
		
#define   DMACON           PIC32_R ( 0x11000 )
#define   DMACONCLR        PIC32_R ( 0x11004 )
#define   DMACONSET        PIC32_R ( 0x11008 )
#define   DMACONINV        PIC32_R ( 0x1100C )
#define   DMASTAT          PIC32_R ( 0x11010 )
#define   DMASTATCLR       PIC32_R ( 0x11014 )
#define   DMASTATSET       PIC32_R ( 0x11018 )
#define   DMASTATINV       PIC32_R ( 0x1101C )
#define   DMAADDR          PIC32_R ( 0x11020 )
#define   DMAADDRCLR       PIC32_R ( 0x11024 )
#define   DMAADDRSET       PIC32_R ( 0x11028 )
#define   DMAADDRINV       PIC32_R ( 0x1102C )
#define   DCH0CON          PIC32_R ( 0x11060 )
#define   DCH0CONCLR       PIC32_R ( 0x11064 )
#define   DCH0CONSET       PIC32_R ( 0x11068 )
#define   DCH0CONINV       PIC32_R ( 0x1106C )
#define   DCH0ECON         PIC32_R ( 0x11070 )
#define   DCH0ECONCLR      PIC32_R ( 0x11074 )
#define   DCH0ECONSET      PIC32_R ( 0x11078 )
#define   DCH0ECONINV      PIC32_R ( 0x1107C )
#define   DCH0INT          PIC32_R ( 0x11080 )
#define   DCH0INTCLR       PIC32_R ( 0x11084 )
#define   DCH0INTSET       PIC32_R ( 0x11088 )
#define   DCH0INTINV       PIC32_R ( 0x1108C )
#define   DCH0SSA          PIC32_R ( 0x11090 )
#define   DCH0SSACLR       PIC32_R ( 0x11094 )
#define   DCH0SSASET       PIC32_R ( 0x11098 )
#define   DCH0SSAINV       PIC32_R ( 0x1109C )
#define   DCH0DSA          PIC32_R ( 0x110A0 )
#define   DCH0DSACLR       PIC32_R ( 0x110A4 )
#define   DCH0DSASET       PIC32_R ( 0x110A8 )
#define   DCH0DSAINV       PIC32_R ( 0x110AC )
#define   DCH0SSIZ         PIC32_R ( 0x110B0 )
#define   DCH0SSIZCLR      PIC32_R ( 0x110B4 )
#define   DCH0SSIZSET      PIC32_R ( 0x110B8 )
#define   DCH0SSIZINV      PIC32_R ( 0x110BC )
#define   DCH0DSIZ         PIC32_R ( 0x110C0 )
#define   DCH0DSIZCLR      PIC32_R ( 0x110C4 )
#define   DCH0DSIZSET      PIC32_R ( 0x110C8 )
#define   DCH0DSIZINV      PIC32_R ( 0x110CC )
#define   DCH0SPTR         PIC32_R ( 0x110D0 )
#define   DCH0SPTRCLR      PIC32_R ( 0x110D4 )
#define   DCH0SPTRSET      PIC32_R ( 0x110D8 )
#define   DCH0SPTRINV      PIC32_R ( 0x110DC )
#define   DCH0DPTR         PIC32_R ( 0x110E0 )
#define   DCH0DPTRCLR      PIC32_R ( 0x110E4 )
#define   DCH0DPTRSET      PIC32_R ( 0x110E8 )
#define   DCH0DPTRINV      PIC32_R ( 0x110EC )
#define   DCH0CSIZ         PIC32_R ( 0x110F0 )
#define   DCH0CSIZCLR      PIC32_R ( 0x110F4 )
#define   DCH0CSIZSET      PIC32_R ( 0x110F8 )
#define   DCH0CSIZINV      PIC32_R ( 0x110FC )
#define   DCH0CPTR         PIC32_R ( 0x11100 )
#define   DCS0CPTR         PIC32_R ( 0x11100 )
#define   DCH0CPTRCLR      PIC32_R ( 0x11104 )
#define   DCS0CPTRCLR      PIC32_R ( 0x11104 )
#define   DCH0CPTRSET      PIC32_R ( 0x11108 )
#define   DCS0CPTRSET      PIC32_R ( 0x11108 )
#define   DCH0CPTRINV      PIC32_R ( 0x1110C )
#define   DCS0CPTRINV      PIC32_R ( 0x1110C )
#define   DCH0DAT          PIC32_R ( 0x11110 )
#define   DCH0DATCLR       PIC32_R ( 0x11114 )
#define   DCH0DATSET       PIC32_R ( 0x11118 )
#define   DCH0DATINV       PIC32_R ( 0x1111C )
#define   DCH1CON          PIC32_R ( 0x11120 )
#define   DCH1CONCLR       PIC32_R ( 0x11124 )
#define   DCH1CONSET       PIC32_R ( 0x11128 )
#define   DCH1CONINV       PIC32_R ( 0x1112C )
#define   DCH1ECON         PIC32_R ( 0x11130 )
#define   DCH1ECONCLR      PIC32_R ( 0x11134 )
#define   DCH1ECONSET      PIC32_R ( 0x11138 )
#define   DCH1ECONINV      PIC32_R ( 0x1113C )
#define   DCH1INT          PIC32_R ( 0x11140 )
#define   DCH1INTCLR       PIC32_R ( 0x11144 )
#define   DCH1INTSET       PIC32_R ( 0x11148 )
#define   DCH1INTINV       PIC32_R ( 0x1114C )
#define   DCH1SSA          PIC32_R ( 0x11150 )
#define   DCH1SSACLR       PIC32_R ( 0x11154 )
#define   DCH1SSASET       PIC32_R ( 0x11158 )
#define   DCH1SSAINV       PIC32_R ( 0x1115C )
#define   DCH1DSA          PIC32_R ( 0x11160 )
#define   DCH1DSACLR       PIC32_R ( 0x11164 )
#define   DCH1DSASET       PIC32_R ( 0x11168 )
#define   DCH1DSAINV       PIC32_R ( 0x1116C )
#define   DCH1SSIZ         PIC32_R ( 0x11170 )
#define   DCH1SSIZCLR      PIC32_R ( 0x11174 )
#define   DCH1SSIZSET      PIC32_R ( 0x11178 )
#define   DCH1SSIZINV      PIC32_R ( 0x1117C )
#define   DCH1DSIZ         PIC32_R ( 0x11180 )
#define   DCH1DSIZCLR      PIC32_R ( 0x11184 )
#define   DCH1DSIZSET      PIC32_R ( 0x11188 )
#define   DCH1DSIZINV      PIC32_R ( 0x1118C )
#define   DCH1SPTR         PIC32_R ( 0x11190 )
#define   DCH1SPTRCLR      PIC32_R ( 0x11194 )
#define   DCH1SPTRSET      PIC32_R ( 0x11198 )
#define   DCH1SPTRINV      PIC32_R ( 0x1119C )
#define   DCH1DPTR         PIC32_R ( 0x111A0 )
#define   DCH1DPTRCLR      PIC32_R ( 0x111A4 )
#define   DCH1DPTRSET      PIC32_R ( 0x111A8 )
#define   DCH1DPTRINV      PIC32_R ( 0x111AC )
#define   DCH1CSIZ         PIC32_R ( 0x111B0 )
#define   DCH1CSIZCLR      PIC32_R ( 0x111B4 )
#define   DCH1CSIZSET      PIC32_R ( 0x111B8 )
#define   DCH1CSIZINV      PIC32_R ( 0x111BC )
#define   DCH1CPTR         PIC32_R ( 0x111C0 )
#define   DCS1CPTR         PIC32_R ( 0x111C0 )
#define   DCH1CPTRCLR      PIC32_R ( 0x111C4 )
#define   DCS1CPTRCLR      PIC32_R ( 0x111C4 )
#define   DCH1CPTRSET      PIC32_R ( 0x111C8 )
#define   DCS1CPTRSET      PIC32_R ( 0x111C8 )
#define   DCH1CPTRINV      PIC32_R ( 0x111CC )
#define   DCS1CPTRINV      PIC32_R ( 0x111CC )
#define   DCH1DAT          PIC32_R ( 0x111D0 )
#define   DCH1DATCLR       PIC32_R ( 0x111D4 )
#define   DCH1DATSET       PIC32_R ( 0x111D8 )
#define   DCH1DATINV       PIC32_R ( 0x111DC )
#define   DCH2CON          PIC32_R ( 0x111E0 )
#define   DCH2CONCLR       PIC32_R ( 0x111E4 )
#define   DCH2CONSET       PIC32_R ( 0x111E8 )
#define   DCH2CONINV       PIC32_R ( 0x111EC )
#define   DCH2ECON         PIC32_R ( 0x111F0 )
#define   DCH2ECONCLR      PIC32_R ( 0x111F4 )
#define   DCH2ECONSET      PIC32_R ( 0x111F8 )
#define   DCH2ECONINV      PIC32_R ( 0x111FC )
#define   DCH2INT          PIC32_R ( 0x11200 )
#define   DCH2INTCLR       PIC32_R ( 0x11204 )
#define   DCH2INTSET       PIC32_R ( 0x11208 )
#define   DCH2INTINV       PIC32_R ( 0x1120C )
#define   DCH2SSA          PIC32_R ( 0x11210 )
#define   DCH2SSACLR       PIC32_R ( 0x11214 )
#define   DCH2SSASET       PIC32_R ( 0x11218 )
#define   DCH2SSAINV       PIC32_R ( 0x1121C )
#define   DCH2DSA          PIC32_R ( 0x11220 )
#define   DCH2DSACLR       PIC32_R ( 0x11224 )
#define   DCH2DSASET       PIC32_R ( 0x11228 )
#define   DCH2DSAINV       PIC32_R ( 0x1122C )
#define   DCH2SSIZ         PIC32_R ( 0x11230 )
#define   DCH2SSIZCLR      PIC32_R ( 0x11234 )
#define   DCH2SSIZSET      PIC32_R ( 0x11238 )
#define   DCH2SSIZINV      PIC32_R ( 0x1123C )
#define   DCH2DSIZ         PIC32_R ( 0x11240 )
#define   DCH2DSIZCLR      PIC32_R ( 0x11244 )
#define   DCH2DSIZSET      PIC32_R ( 0x11248 )
#define   DCH2DSIZINV      PIC32_R ( 0x1124C )
#define   DCH2SPTR         PIC32_R ( 0x11250 )
#define   DCH2SPTRCLR      PIC32_R ( 0x11254 )
#define   DCH2SPTRSET      PIC32_R ( 0x11258 )
#define   DCH2SPTRINV      PIC32_R ( 0x1125C )
#define   DCH2DPTR         PIC32_R ( 0x11260 )
#define   DCH2DPTRCLR      PIC32_R ( 0x11264 )
#define   DCH2DPTRSET      PIC32_R ( 0x11268 )
#define   DCH2DPTRINV      PIC32_R ( 0x1126C )
#define   DCH2CSIZ         PIC32_R ( 0x11270 )
#define   DCH2CSIZCLR      PIC32_R ( 0x11274 )
#define   DCH2CSIZSET      PIC32_R ( 0x11278 )
#define   DCH2CSIZINV      PIC32_R ( 0x1127C )
#define   DCH2CPTR         PIC32_R ( 0x11280 )
#define   DCS2CPTR         PIC32_R ( 0x11280 )
#define   DCH2CPTRCLR      PIC32_R ( 0x11284 )
#define   DCS2CPTRCLR      PIC32_R ( 0x11284 )
#define   DCH2CPTRSET      PIC32_R ( 0x11288 )
#define   DCS2CPTRSET      PIC32_R ( 0x11288 )
#define   DCH2CPTRINV      PIC32_R ( 0x1128C )
#define   DCS2CPTRINV      PIC32_R ( 0x1128C )
#define   DCH2DAT          PIC32_R ( 0x11290 )
#define   DCH2DATCLR       PIC32_R ( 0x11294 )
#define   DCH2DATSET       PIC32_R ( 0x11298 )
#define   DCH2DATINV       PIC32_R ( 0x1129C )
#define   DCH3CON          PIC32_R ( 0x112A0 )
#define   DCH3CONCLR       PIC32_R ( 0x112A4 )
#define   DCH3CONSET       PIC32_R ( 0x112A8 )
#define   DCH3CONINV       PIC32_R ( 0x112AC )
#define   DCH3ECON         PIC32_R ( 0x112B0 )
#define   DCH3ECONCLR      PIC32_R ( 0x112B4 )
#define   DCH3ECONSET      PIC32_R ( 0x112B8 )
#define   DCH3ECONINV      PIC32_R ( 0x112BC )
#define   DCH3INT          PIC32_R ( 0x112C0 )
#define   DCH3INTCLR       PIC32_R ( 0x112C4 )
#define   DCH3INTSET       PIC32_R ( 0x112C8 )
#define   DCH3INTINV       PIC32_R ( 0x112CC )
#define   DCH3SSA          PIC32_R ( 0x112D0 )
#define   DCH3SSACLR       PIC32_R ( 0x112D4 )
#define   DCH3SSASET       PIC32_R ( 0x112D8 )
#define   DCH3SSAINV       PIC32_R ( 0x112DC )
#define   DCH3DSA          PIC32_R ( 0x112E0 )
#define   DCH3DSACLR       PIC32_R ( 0x112E4 )
#define   DCH3DSASET       PIC32_R ( 0x112E8 )
#define   DCH3DSAINV       PIC32_R ( 0x112EC )
#define   DCH3SSIZ         PIC32_R ( 0x112F0 )
#define   DCH3SSIZCLR      PIC32_R ( 0x112F4 )
#define   DCH3SSIZSET      PIC32_R ( 0x112F8 )
#define   DCH3SSIZINV      PIC32_R ( 0x112FC )
#define   DCH3DSIZ         PIC32_R ( 0x11300 )
#define   DCH3DSIZCLR      PIC32_R ( 0x11304 )
#define   DCH3DSIZSET      PIC32_R ( 0x11308 )
#define   DCH3DSIZINV      PIC32_R ( 0x1130C )
#define   DCH3SPTR         PIC32_R ( 0x11310 )
#define   DCH3SPTRCLR      PIC32_R ( 0x11314 )
#define   DCH3SPTRSET      PIC32_R ( 0x11318 )
#define   DCH3SPTRINV      PIC32_R ( 0x1131C )
#define   DCH3DPTR         PIC32_R ( 0x11320 )
#define   DCH3DPTRCLR      PIC32_R ( 0x11324 )
#define   DCH3DPTRSET      PIC32_R ( 0x11328 )
#define   DCH3DPTRINV      PIC32_R ( 0x1132C )
#define   DCH3CSIZ         PIC32_R ( 0x11330 )
#define   DCH3CSIZCLR      PIC32_R ( 0x11334 )
#define   DCH3CSIZSET      PIC32_R ( 0x11338 )
#define   DCH3CSIZINV      PIC32_R ( 0x1133C )
#define   DCH3CPTR         PIC32_R ( 0x11340 )
#define   DCS3CPTR         PIC32_R ( 0x11340 )
#define   DCH3CPTRCLR      PIC32_R ( 0x11344 )
#define   DCS3CPTRCLR      PIC32_R ( 0x11344 )
#define   DCH3CPTRSET      PIC32_R ( 0x11348 )
#define   DCS3CPTRSET      PIC32_R ( 0x11348 )
#define   DCH3CPTRINV      PIC32_R ( 0x1134C )
#define   DCS3CPTRINV      PIC32_R ( 0x1134C )
#define   DCH3DAT          PIC32_R ( 0x11350 )
#define   DCH3DATCLR       PIC32_R ( 0x11354 )
#define   DCH3DATSET       PIC32_R ( 0x11358 )
#define   DCH3DATINV       PIC32_R ( 0x1135C )
#define   DCH4CON          PIC32_R ( 0x11360 )
#define   DCH4CONCLR       PIC32_R ( 0x11364 )
#define   DCH4CONSET       PIC32_R ( 0x11368 )
#define   DCH4CONINV       PIC32_R ( 0x1136C )
#define   DCH4ECON         PIC32_R ( 0x11370 )
#define   DCH4ECONCLR      PIC32_R ( 0x11374 )
#define   DCH4ECONSET      PIC32_R ( 0x11378 )
#define   DCH4ECONINV      PIC32_R ( 0x1137C )
#define   DCH4INT          PIC32_R ( 0x11380 )
#define   DCH4INTCLR       PIC32_R ( 0x11384 )
#define   DCH4INTSET       PIC32_R ( 0x11388 )
#define   DCH4INTINV       PIC32_R ( 0x1138C )
#define   DCH4SSA          PIC32_R ( 0x11390 )
#define   DCH4SSACLR       PIC32_R ( 0x11394 )
#define   DCH4SSASET       PIC32_R ( 0x11398 )
#define   DCH4SSAINV       PIC32_R ( 0x1139C )
#define   DCH4DSA          PIC32_R ( 0x113A0 )
#define   DCH4DSACLR       PIC32_R ( 0x113A4 )
#define   DCH4DSASET       PIC32_R ( 0x113A8 )
#define   DCH4DSAINV       PIC32_R ( 0x113AC )
#define   DCH4SSIZ         PIC32_R ( 0x113B0 )
#define   DCH4SSIZCLR      PIC32_R ( 0x113B4 )
#define   DCH4SSIZSET      PIC32_R ( 0x113B8 )
#define   DCH4SSIZINV      PIC32_R ( 0x113BC )
#define   DCH4DSIZ         PIC32_R ( 0x113C0 )
#define   DCH4DSIZCLR      PIC32_R ( 0x113C4 )
#define   DCH4DSIZSET      PIC32_R ( 0x113C8 )
#define   DCH4DSIZINV      PIC32_R ( 0x113CC )
#define   DCH4SPTR         PIC32_R ( 0x113D0 )
#define   DCH4SPTRCLR      PIC32_R ( 0x113D4 )
#define   DCH4SPTRSET      PIC32_R ( 0x113D8 )
#define   DCH4SPTRINV      PIC32_R ( 0x113DC )
#define   DCH4DPTR         PIC32_R ( 0x113E0 )
#define   DCH4DPTRCLR      PIC32_R ( 0x113E4 )
#define   DCH4DPTRSET      PIC32_R ( 0x113E8 )
#define   DCH4DPTRINV      PIC32_R ( 0x113EC )
#define   DCH4CSIZ         PIC32_R ( 0x113F0 )
#define   DCH4CSIZCLR      PIC32_R ( 0x113F4 )
#define   DCH4CSIZSET      PIC32_R ( 0x113F8 )
#define   DCH4CSIZINV      PIC32_R ( 0x113FC )
#define   DCH4CPTR         PIC32_R ( 0x11400 )
#define   DCS4CPTR         PIC32_R ( 0x11400 )
#define   DCH4CPTRCLR      PIC32_R ( 0x11404 )
#define   DCS4CPTRCLR      PIC32_R ( 0x11404 )
#define   DCH4CPTRSET      PIC32_R ( 0x11408 )
#define   DCS4CPTRSET      PIC32_R ( 0x11408 )
#define   DCH4CPTRINV      PIC32_R ( 0x1140C )
#define   DCS4CPTRINV      PIC32_R ( 0x1140C )
#define   DCH4DAT          PIC32_R ( 0x11410 )
#define   DCH4DATCLR       PIC32_R ( 0x11414 )
#define   DCH4DATSET       PIC32_R ( 0x11418 )
#define   DCH4DATINV       PIC32_R ( 0x1141C )
#define   DCH5CON          PIC32_R ( 0x11420 )
#define   DCH5CONCLR       PIC32_R ( 0x11424 )
#define   DCH5CONSET       PIC32_R ( 0x11428 )
#define   DCH5CONINV       PIC32_R ( 0x1142C )
#define   DCH5ECON         PIC32_R ( 0x11430 )
#define   DCH5ECONCLR      PIC32_R ( 0x11434 )
#define   DCH5ECONSET      PIC32_R ( 0x11438 )
#define   DCH5ECONINV      PIC32_R ( 0x1143C )
#define   DCH5INT          PIC32_R ( 0x11440 )
#define   DCH5INTCLR       PIC32_R ( 0x11444 )
#define   DCH5INTSET       PIC32_R ( 0x11448 )
#define   DCH5INTINV       PIC32_R ( 0x1144C )
#define   DCH5SSA          PIC32_R ( 0x11450 )
#define   DCH5SSACLR       PIC32_R ( 0x11454 )
#define   DCH5SSASET       PIC32_R ( 0x11458 )
#define   DCH5SSAINV       PIC32_R ( 0x1145C )
#define   DCH5DSA          PIC32_R ( 0x11460 )
#define   DCH5DSACLR       PIC32_R ( 0x11464 )
#define   DCH5DSASET       PIC32_R ( 0x11468 )
#define   DCH5DSAINV       PIC32_R ( 0x1146C )
#define   DCH5SSIZ         PIC32_R ( 0x11470 )
#define   DCH5SSIZCLR      PIC32_R ( 0x11474 )
#define   DCH5SSIZSET      PIC32_R ( 0x11478 )
#define   DCH5SSIZINV      PIC32_R ( 0x1147C )
#define   DCH5DSIZ         PIC32_R ( 0x11480 )
#define   DCH5DSIZCLR      PIC32_R ( 0x11484 )
#define   DCH5DSIZSET      PIC32_R ( 0x11488 )
#define   DCH5DSIZINV      PIC32_R ( 0x1148C )
#define   DCH5SPTR         PIC32_R ( 0x11490 )
#define   DCH5SPTRCLR      PIC32_R ( 0x11494 )
#define   DCH5SPTRSET      PIC32_R ( 0x11498 )
#define   DCH5SPTRINV      PIC32_R ( 0x1149C )
#define   DCH5DPTR         PIC32_R ( 0x114A0 )
#define   DCH5DPTRCLR      PIC32_R ( 0x114A4 )
#define   DCH5DPTRSET      PIC32_R ( 0x114A8 )
#define   DCH5DPTRINV      PIC32_R ( 0x114AC )
#define   DCH5CSIZ         PIC32_R ( 0x114B0 )
#define   DCH5CSIZCLR      PIC32_R ( 0x114B4 )
#define   DCH5CSIZSET      PIC32_R ( 0x114B8 )
#define   DCH5CSIZINV      PIC32_R ( 0x114BC )
#define   DCH5CPTR         PIC32_R ( 0x114C0 )
#define   DCS5CPTR         PIC32_R ( 0x114C0 )
#define   DCH5CPTRCLR      PIC32_R ( 0x114C4 )
#define   DCS5CPTRCLR      PIC32_R ( 0x114C4 )
#define   DCH5CPTRSET      PIC32_R ( 0x114C8 )
#define   DCS5CPTRSET      PIC32_R ( 0x114C8 )
#define   DCH5CPTRINV      PIC32_R ( 0x114CC )
#define   DCS5CPTRINV      PIC32_R ( 0x114CC )
#define   DCH5DAT          PIC32_R ( 0x114D0 )
#define   DCH5DATCLR       PIC32_R ( 0x114D4 )
#define   DCH5DATSET       PIC32_R ( 0x114D8 )
#define   DCH5DATINV       PIC32_R ( 0x114DC )
#define   DCH6CON          PIC32_R ( 0x114E0 )
#define   DCH6CONCLR       PIC32_R ( 0x114E4 )
#define   DCH6CONSET       PIC32_R ( 0x114E8 )
#define   DCH6CONINV       PIC32_R ( 0x114EC )
#define   DCH6ECON         PIC32_R ( 0x114F0 )
#define   DCH6ECONCLR      PIC32_R ( 0x114F4 )
#define   DCH6ECONSET      PIC32_R ( 0x114F8 )
#define   DCH6ECONINV      PIC32_R ( 0x114FC )
#define   DCH6INT          PIC32_R ( 0x11500 )
#define   DCH6INTCLR       PIC32_R ( 0x11504 )
#define   DCH6INTSET       PIC32_R ( 0x11508 )
#define   DCH6INTINV       PIC32_R ( 0x1150C )
#define   DCH6SSA          PIC32_R ( 0x11510 )
#define   DCH6SSACLR       PIC32_R ( 0x11514 )
#define   DCH6SSASET       PIC32_R ( 0x11518 )
#define   DCH6SSAINV       PIC32_R ( 0x1151C )
#define   DCH6DSA          PIC32_R ( 0x11520 )
#define   DCH6DSACLR       PIC32_R ( 0x11524 )
#define   DCH6DSASET       PIC32_R ( 0x11528 )
#define   DCH6DSAINV       PIC32_R ( 0x1152C )
#define   DCH6SSIZ         PIC32_R ( 0x11530 )
#define   DCH6SSIZCLR      PIC32_R ( 0x11534 )
#define   DCH6SSIZSET      PIC32_R ( 0x11538 )
#define   DCH6SSIZINV      PIC32_R ( 0x1153C )
#define   DCH6DSIZ         PIC32_R ( 0x11540 )
#define   DCH6DSIZCLR      PIC32_R ( 0x11544 )
#define   DCH6DSIZSET      PIC32_R ( 0x11548 )
#define   DCH6DSIZINV      PIC32_R ( 0x1154C )
#define   DCH6SPTR         PIC32_R ( 0x11550 )
#define   DCH6SPTRCLR      PIC32_R ( 0x11554 )
#define   DCH6SPTRSET      PIC32_R ( 0x11558 )
#define   DCH6SPTRINV      PIC32_R ( 0x1155C )
#define   DCH6DPTR         PIC32_R ( 0x11560 )
#define   DCH6DPTRCLR      PIC32_R ( 0x11564 )
#define   DCH6DPTRSET      PIC32_R ( 0x11568 )
#define   DCH6DPTRINV      PIC32_R ( 0x1156C )
#define   DCH6CSIZ         PIC32_R ( 0x11570 )
#define   DCH6CSIZCLR      PIC32_R ( 0x11574 )
#define   DCH6CSIZSET      PIC32_R ( 0x11578 )
#define   DCH6CSIZINV      PIC32_R ( 0x1157C )
#define   DCH6CPTR         PIC32_R ( 0x11580 )
#define   DCS6CPTR         PIC32_R ( 0x11580 )
#define   DCH6CPTRCLR      PIC32_R ( 0x11584 )
#define   DCS6CPTRCLR      PIC32_R ( 0x11584 )
#define   DCH6CPTRSET      PIC32_R ( 0x11588 )
#define   DCS6CPTRSET      PIC32_R ( 0x11588 )
#define   DCH6CPTRINV      PIC32_R ( 0x1158C )
#define   DCS6CPTRINV      PIC32_R ( 0x1158C )
#define   DCH6DAT          PIC32_R ( 0x11590 )
#define   DCH6DATCLR       PIC32_R ( 0x11594 )
#define   DCH6DATSET       PIC32_R ( 0x11598 )
#define   DCH6DATINV       PIC32_R ( 0x1159C )
#define   DCH7CON          PIC32_R ( 0x115A0 )
#define   DCH7CONCLR       PIC32_R ( 0x115A4 )
#define   DCH7CONSET       PIC32_R ( 0x115A8 )
#define   DCH7CONINV       PIC32_R ( 0x115AC )
#define   DCH7ECON         PIC32_R ( 0x115B0 )
#define   DCH7ECONCLR      PIC32_R ( 0x115B4 )
#define   DCH7ECONSET      PIC32_R ( 0x115B8 )
#define   DCH7ECONINV      PIC32_R ( 0x115BC )
#define   DCH7INT          PIC32_R ( 0x115C0 )
#define   DCH7INTCLR       PIC32_R ( 0x115C4 )
#define   DCH7INTSET       PIC32_R ( 0x115C8 )
#define   DCH7INTINV       PIC32_R ( 0x115CC )
#define   DCH7SSA          PIC32_R ( 0x115D0 )
#define   DCH7SSACLR       PIC32_R ( 0x115D4 )
#define   DCH7SSASET       PIC32_R ( 0x115D8 )
#define   DCH7SSAINV       PIC32_R ( 0x115DC )
#define   DCH7DSA          PIC32_R ( 0x115E0 )
#define   DCH7DSACLR       PIC32_R ( 0x115E4 )
#define   DCH7DSASET       PIC32_R ( 0x115E8 )
#define   DCH7DSAINV       PIC32_R ( 0x115EC )
#define   DCH7SSIZ         PIC32_R ( 0x115F0 )
#define   DCH7SSIZCLR      PIC32_R ( 0x115F4 )
#define   DCH7SSIZSET      PIC32_R ( 0x115F8 )
