whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
#define   DCH7SSIZINV      PIC32_R ( 0x115FC )
#define   DCH7DSIZ         PIC32_R ( 0x11600 )
#define   DCH7DSIZCLR      PIC32_R ( 0x11604 )
#define   DCH7DSIZSET      PIC32_R ( 0x11608 )
#define   DCH7DSIZINV      PIC32_R ( 0x1160C )
#define   DCH7SPTR         PIC32_R ( 0x11610 )
#define   DCH7SPTRCLR      PIC32_R ( 0x11614 )
#define   DCH7SPTRSET      PIC32_R ( 0x11618 )
#define   DCH7SPTRINV      PIC32_R ( 0x1161C )
#define   DCH7DPTR         PIC32_R ( 0x11620 )
#define   DCH7DPTRCLR      PIC32_R ( 0x11624 )
#define   DCH7DPTRSET      PIC32_R ( 0x11628 )
#define   DCH7DPTRINV      PIC32_R ( 0x1162C )
#define   DCH7CSIZ         PIC32_R ( 0x11630 )
#define   DCH7CSIZCLR      PIC32_R ( 0x11634 )
#define   DCH7CSIZSET      PIC32_R ( 0x11638 )
#define   DCH7CSIZINV      PIC32_R ( 0x1163C )
#define   DCH7CPTR         PIC32_R ( 0x11640 )
#define   DCS7CPTR         PIC32_R ( 0x11640 )
#define   DCH7CPTRCLR      PIC32_R ( 0x11644 )
#define   DCS7CPTRCLR      PIC32_R ( 0x11644 )
#define   DCH7CPTRSET      PIC32_R ( 0x11648 )
#define   DCS7CPTRSET      PIC32_R ( 0x11648 )
#define   DCH7CPTRINV      PIC32_R ( 0x1164C )
#define   DCS7CPTRINV      PIC32_R ( 0x1164C )
#define   DCH7DAT          PIC32_R ( 0x11650 )
#define   DCH7DATCLR       PIC32_R ( 0x11654 )
#define   DCH7DATSET       PIC32_R ( 0x11658 )
#define   DCH7DATINV       PIC32_R ( 0x1165C )

/*--------------------------------------
* OUTPUT COMPARE REGISTERS
*/
#define OC1CON           PIC32_R ( 0x44000 )
#define OC1CONCLR        PIC32_R ( 0x44004 )
#define OC1CONSET        PIC32_R ( 0x44008 )
#define OC1CONINV        PIC32_R ( 0x4400C )
#define OC1R             PIC32_R ( 0x44010 )
#define OC1RCLR          PIC32_R ( 0x44014 )
#define OC1RSET          PIC32_R ( 0x44018 )
#define OC1RINV          PIC32_R ( 0x4401C )
#define OC1RS            PIC32_R ( 0x44020 )
#define OC1RSCLR         PIC32_R ( 0x44024 )
#define OC1RSSET         PIC32_R ( 0x44028 )
#define OC1RSINV         PIC32_R ( 0x4402C )
#define OC2CON           PIC32_R ( 0x44200 )
#define OC2CONCLR        PIC32_R ( 0x44204 )
#define OC2CONSET        PIC32_R ( 0x44208 )
#define OC2CONINV        PIC32_R ( 0x4420C )
#define OC2R             PIC32_R ( 0x44210 )
#define OC2RCLR          PIC32_R ( 0x44214 )
#define OC2RSET          PIC32_R ( 0x44218 )
#define OC2RINV          PIC32_R ( 0x4421C )
#define OC2RS            PIC32_R ( 0x44220 )
#define OC2RSCLR         PIC32_R ( 0x44224 )
#define OC2RSSET         PIC32_R ( 0x44228 )
#define OC2RSINV         PIC32_R ( 0x4422C )
#define OC3CON           PIC32_R ( 0x44400 )
#define OC3CONCLR        PIC32_R ( 0x44404 )
#define OC3CONSET        PIC32_R ( 0x44408 )
#define OC3CONINV        PIC32_R ( 0x4440C )
#define OC3R             PIC32_R ( 0x44410 )
#define OC3RCLR          PIC32_R ( 0x44414 )
#define OC3RSET          PIC32_R ( 0x44418 )
#define OC3RINV          PIC32_R ( 0x4441C )
#define OC3RS            PIC32_R ( 0x44420 )
#define OC3RSCLR         PIC32_R ( 0x44424 )
#define OC3RSSET         PIC32_R ( 0x44428 )
#define OC3RSINV         PIC32_R ( 0x4442C )
#define OC4CON           PIC32_R ( 0x44600 )
#define OC4CONCLR        PIC32_R ( 0x44604 )
#define OC4CONSET        PIC32_R ( 0x44608 )
#define OC4CONINV        PIC32_R ( 0x4460C )
#define OC4R             PIC32_R ( 0x44610 )
#define OC4RCLR          PIC32_R ( 0x44614 )
#define OC4RSET          PIC32_R ( 0x44618 )
#define OC4RINV          PIC32_R ( 0x4461C )
#define OC4RS            PIC32_R ( 0x44620 )
#define OC4RSCLR         PIC32_R ( 0x44624 )
#define OC4RSSET         PIC32_R ( 0x44628 )
#define OC4RSINV         PIC32_R ( 0x4462C )
#define OC5CON           PIC32_R ( 0x44800 )
#define OC5CONCLR        PIC32_R ( 0x44804 )
#define OC5CONSET        PIC32_R ( 0x44808 )
#define OC5CONINV        PIC32_R ( 0x4480C )
#define OC5R             PIC32_R ( 0x44810 )
#define OC5RCLR          PIC32_R ( 0x44814 )
#define OC5RSET          PIC32_R ( 0x44818 )
#define OC5RINV          PIC32_R ( 0x4481C )
#define OC5RS            PIC32_R ( 0x44820 )
#define OC5RSCLR         PIC32_R ( 0x44824 )
#define OC5RSSET         PIC32_R ( 0x44828 )
#define OC5RSINV         PIC32_R ( 0x4482C )
#define OC6CON           PIC32_R ( 0x44A00 )
#define OC6CONCLR        PIC32_R ( 0x44A04 )
#define OC6CONSET        PIC32_R ( 0x44A08 )
#define OC6CONINV        PIC32_R ( 0x44A0C )
#define OC6R             PIC32_R ( 0x44A10 )
#define OC6RCLR          PIC32_R ( 0x44A14 )
#define OC6RSET          PIC32_R ( 0x44A18 )
#define OC6RINV          PIC32_R ( 0x44A1C )
#define OC6RS            PIC32_R ( 0x44A20 )
#define OC6RSCLR         PIC32_R ( 0x44A24 )
#define OC6RSSET         PIC32_R ( 0x44A28 )
#define OC6RSINV         PIC32_R ( 0x44A2C )
#define OC7CON           PIC32_R ( 0x44C00 )
#define OC7CONCLR        PIC32_R ( 0x44C04 )
#define OC7CONSET        PIC32_R ( 0x44C08 )
#define OC7CONINV        PIC32_R ( 0x44C0C )
#define OC7R             PIC32_R ( 0x44C10 )
#define OC7RCLR          PIC32_R ( 0x44C14 )
#define OC7RSET          PIC32_R ( 0x44C18 )
#define OC7RINV          PIC32_R ( 0x44C1C )
#define OC7RS            PIC32_R ( 0x44C20 )
#define OC7RSCLR         PIC32_R ( 0x44C24 )
#define OC7RSSET         PIC32_R ( 0x44C28 )
#define OC7RSINV         PIC32_R ( 0x44C2C )
#define OC8CON           PIC32_R ( 0x44E00 )
#define OC8CONCLR        PIC32_R ( 0x44E04 )
#define OC8CONSET        PIC32_R ( 0x44E08 )
#define OC8CONINV        PIC32_R ( 0x44E0C )
#define OC8R             PIC32_R ( 0x44E10 )
#define OC8RCLR          PIC32_R ( 0x44E14 )
#define OC8RSET          PIC32_R ( 0x44E18 )
#define OC8RINV          PIC32_R ( 0x44E1C )
#define OC8RS            PIC32_R ( 0x44E20 )
#define OC8RSCLR         PIC32_R ( 0x44E24 )
#define OC8RSSET         PIC32_R ( 0x44E28 )
#define OC8RSINV         PIC32_R ( 0x44E2C )
#define OC9CON           PIC32_R ( 0x45000 )
#define OC9CONCLR        PIC32_R ( 0x45004 )
#define OC9CONSET        PIC32_R ( 0x45008 )
#define OC9CONINV        PIC32_R ( 0x4500C )
#define OC9R             PIC32_R ( 0x45010 )
#define OC9RCLR          PIC32_R ( 0x45014 )
#define OC9RSET          PIC32_R ( 0x45018 )
#define OC9RINV          PIC32_R ( 0x4501C )
#define OC9RS            PIC32_R ( 0x45020 )
#define OC9RSCLR         PIC32_R ( 0x45024 )
#define OC9RSSET         PIC32_R ( 0x45028 )
#define OC9RSINV         PIC32_R ( 0x4502C )


