whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*--------------------------------------
* Can registers.
*/
#define C1CON            PIC32_R (0x80000)
#define C1CONCLR         PIC32_R (0x80004)
#define C1CONSET         PIC32_R (0x80008)
#define C1CONINV         PIC32_R (0x8000C)
#define C1CFG            PIC32_R (0x80010)
#define C1CFGCLR         PIC32_R (0x80014)
#define C1CFGSET         PIC32_R (0x80018)
#define C1CFGINV         PIC32_R (0x8001C)
#define C1INT            PIC32_R (0x80020)
#define C1INTCLR         PIC32_R (0x80024)
#define C1INTSET         PIC32_R (0x80028)
#define C1INTINV         PIC32_R (0x8002C)
#define C1VEC            PIC32_R (0x80030)
#define C1VECCLR         PIC32_R (0x80034)
#define C1VECSET         PIC32_R (0x80038)
#define C1VECINV         PIC32_R (0x8003C)
#define C1TREC           PIC32_R (0x80040)
#define C1TRECCLR        PIC32_R (0x80044)
#define C1TRECSET        PIC32_R (0x80048)
#define C1TRECINV        PIC32_R (0x8004C)
#define C1FSTAT          PIC32_R (0x80050)
#define C1FSTATCLR       PIC32_R (0x80054)
#define C1FSTATSET       PIC32_R (0x80058)
#define C1FSTATINV       PIC32_R (0x8005C)
#define C1RXOVF          PIC32_R (0x80060)
#define C1RXOVFCLR       PIC32_R (0x80064)
#define C1RXOVFSET       PIC32_R (0x80068)
#define C1RXOVFINV       PIC32_R (0x8006C)
#define C1TMR            PIC32_R (0x80070)
#define C1TMRCLR         PIC32_R (0x80074)
#define C1TMRSET         PIC32_R (0x80078)
#define C1TMRINV         PIC32_R (0x8007C)
#define C1RXM0           PIC32_R (0x80080)
#define C1RXM0CLR        PIC32_R (0x80084)
#define C1RXM0SET        PIC32_R (0x80088)
#define C1RXM0INV        PIC32_R (0x8008C)
#define C1RXM1           PIC32_R (0x80090)
#define C1RXM1CLR        PIC32_R (0x80094)
#define C1RXM1SET        PIC32_R (0x80098)
#define C1RXM1INV        PIC32_R (0x8009C)
#define C1RXM2           PIC32_R (0x800A0)
#define C1RXM2CLR        PIC32_R (0x800A4)
#define C1RXM2SET        PIC32_R (0x800A8)
#define C1RXM2INV        PIC32_R (0x800AC)
#define C1RXM3           PIC32_R (0x800B0)
#define C1RXM3CLR        PIC32_R (0x800B4)
#define C1RXM3SET        PIC32_R (0x800B8)
#define C1RXM3INV        PIC32_R (0x800BC)
#define C1FLTCON0        PIC32_R (0x800C0)
#define C1FLTCON0CLR     PIC32_R (0x800C4)
#define C1FLTCON0SET     PIC32_R (0x800C8)
#define C1FLTCON0INV     PIC32_R (0x800CC)
#define C1FLTCON1        PIC32_R (0x800D0)
#define C1FLTCON1CLR     PIC32_R (0x800D4)
#define C1FLTCON1SET     PIC32_R (0x800D8)
#define C1FLTCON1INV     PIC32_R (0x800DC)
#define C1FLTCON2        PIC32_R (0x800E0)
#define C1FLTCON2CLR     PIC32_R (0x800E4)
#define C1FLTCON2SET     PIC32_R (0x800E8)
#define C1FLTCON2INV     PIC32_R (0x800EC)
#define C1FLTCON3        PIC32_R (0x800F0)
#define C1FLTCON3CLR     PIC32_R (0x800F4)
#define C1FLTCON3SET     PIC32_R (0x800F8)
#define C1FLTCON3INV     PIC32_R (0x800FC)
#define C1FLTCON4        PIC32_R (0x80100)
#define C1FLTCON4CLR     PIC32_R (0x80104)
#define C1FLTCON4SET     PIC32_R (0x80108)
#define C1FLTCON4INV     PIC32_R (0x8010C)
#define C1FLTCON5        PIC32_R (0x80110)
#define C1FLTCON5CLR     PIC32_R (0x80114)
#define C1FLTCON5SET     PIC32_R (0x80118)
#define C1FLTCON5INV     PIC32_R (0x8011C)
#define C1FLTCON6        PIC32_R (0x80120)
#define C1FLTCON6CLR     PIC32_R (0x80124)
#define C1FLTCON6SET     PIC32_R (0x80128)
#define C1FLTCON6INV     PIC32_R (0x8012C)
#define C1FLTCON7        PIC32_R (0x80130)
#define C1FLTCON7CLR     PIC32_R (0x80134)
#define C1FLTCON7SET     PIC32_R (0x80138)
#define C1FLTCON7INV     PIC32_R (0x8013C)
#define C1RXF0           PIC32_R (0x80140)
#define C1RXF0CLR        PIC32_R (0x80144)
#define C1RXF0SET        PIC32_R (0x80148)
#define C1RXF0INV        PIC32_R (0x8014C)
#define C1RXF1           PIC32_R (0x80150)
#define C1RXF1CLR        PIC32_R (0x80154)
#define C1RXF1SET        PIC32_R (0x80158)
#define C1RXF1INV        PIC32_R (0x8015C)
#define C1RXF2           PIC32_R (0x80160)
#define C1RXF2CLR        PIC32_R (0x80164)
#define C1RXF2SET        PIC32_R (0x80168)
#define C1RXF2INV        PIC32_R (0x8016C)
#define C1RXF3           PIC32_R (0x80170)
#define C1RXF3CLR        PIC32_R (0x80174)
#define C1RXF3SET        PIC32_R (0x80178)
#define C1RXF3INV        PIC32_R (0x8017C)
#define C1RXF4           PIC32_R (0x80180)
#define C1RXF4CLR        PIC32_R (0x80184)
#define C1RXF4SET        PIC32_R (0x80188)
#define C1RXF4INV        PIC32_R (0x8018C)
#define C1RXF5           PIC32_R (0x80190)
#define C1RXF5CLR        PIC32_R (0x80194)
#define C1RXF5SET        PIC32_R (0x80198)
#define C1RXF5INV        PIC32_R (0x8019C)
#define C1RXF6           PIC32_R (0x801A0)
#define C1RXF6CLR        PIC32_R (0x801A4)
#define C1RXF6SET        PIC32_R (0x801A8)
#define C1RXF6INV        PIC32_R (0x801AC)
#define C1RXF7           PIC32_R (0x801B0)
#define C1RXF7CLR        PIC32_R (0x801B4)
#define C1RXF7SET        PIC32_R (0x801B8)
#define C1RXF7INV        PIC32_R (0x801BC)
#define C1RXF8           PIC32_R (0x801C0)
#define C1RXF8CLR        PIC32_R (0x801C4)
#define C1RXF8SET        PIC32_R (0x801C8)
#define C1RXF8INV        PIC32_R (0x801CC)
#define C1RXF9           PIC32_R (0x801D0)
#define C1RXF9CLR        PIC32_R (0x801D4)
#define C1RXF9SET        PIC32_R (0x801D8)
#define C1RXF9INV        PIC32_R (0x801DC)
#define C1RXF10          PIC32_R (0x801E0)
#define C1RXF10CLR       PIC32_R (0x801E4)
#define C1RXF10SET       PIC32_R (0x801E8)
#define C1RXF10INV       PIC32_R (0x801EC)
#define C1RXF11          PIC32_R (0x801F0)
#define C1RXF11CLR       PIC32_R (0x801F4)
#define C1RXF11SET       PIC32_R (0x801F8)
#define C1RXF11INV       PIC32_R (0x801FC)
#define C1RXF12          PIC32_R (0x80200)
#define C1RXF12CLR       PIC32_R (0x80204)
#define C1RXF12SET       PIC32_R (0x80208)
#define C1RXF12INV       PIC32_R (0x8020C)
#define C1RXF13          PIC32_R (0x80210)
#define C1RXF13CLR       PIC32_R (0x80214)
#define C1RXF13SET       PIC32_R (0x80218)
#define C1RXF13INV       PIC32_R (0x8021C)
#define C1RXF14          PIC32_R (0x80220)
#define C1RXF14CLR       PIC32_R (0x80224)
#define C1RXF14SET       PIC32_R (0x80228)
#define C1RXF14INV       PIC32_R (0x8022C)
#define C1RXF15          PIC32_R (0x80230)
#define C1RXF15CLR       PIC32_R (0x80234)
#define C1RXF15SET       PIC32_R (0x80238)
#define C1RXF15INV       PIC32_R (0x8023C)
#define C1RXF16          PIC32_R (0x80240)
#define C1RXF16CLR       PIC32_R (0x80244)
#define C1RXF16SET       PIC32_R (0x80248)
#define C1RXF16INV       PIC32_R (0x8024C)
#define C1RXF17          PIC32_R (0x80250)
#define C1RXF17CLR       PIC32_R (0x80254)
#define C1RXF17SET       PIC32_R (0x80258)
#define C1RXF17INV       PIC32_R (0x8025C)
#define C1RXF18          PIC32_R (0x80260)
#define C1RXF18CLR       PIC32_R (0x80264)
#define C1RXF18SET       PIC32_R (0x80268)
#define C1RXF18INV       PIC32_R (0x8026C)
#define C1RXF19          PIC32_R (0x80270)
#define C1RXF19CLR       PIC32_R (0x80274)
#define C1RXF19SET       PIC32_R (0x80278)
#define C1RXF19INV       PIC32_R (0x8027C)
#define C1RXF20          PIC32_R (0x80280)
#define C1RXF20CLR       PIC32_R (0x80284)
#define C1RXF20SET       PIC32_R (0x80288)
#define C1RXF20INV       PIC32_R (0x8028C)
#define C1RXF21          PIC32_R (0x80290)
#define C1RXF21CLR       PIC32_R (0x80294)
#define C1RXF21SET       PIC32_R (0x80298)
#define C1RXF21INV       PIC32_R (0x8029C)
#define C1RXF22          PIC32_R (0x802A0)
#define C1RXF22CLR       PIC32_R (0x802A4)
#define C1RXF22SET       PIC32_R (0x802A8)
#define C1RXF22INV       PIC32_R (0x802AC)
#define C1RXF23          PIC32_R (0x802B0)
#define C1RXF23CLR       PIC32_R (0x802B4)
#define C1RXF23SET       PIC32_R (0x802B8)
#define C1RXF23INV       PIC32_R (0x802BC)
#define C1RXF24          PIC32_R (0x802C0)
#define C1RXF24CLR       PIC32_R (0x802C4)
#define C1RXF24SET       PIC32_R (0x802C8)
#define C1RXF24INV       PIC32_R (0x802CC)
#define C1RXF25          PIC32_R (0x802D0)
#define C1RXF25CLR       PIC32_R (0x802D4)
#define C1RXF25SET       PIC32_R (0x802D8)
#define C1RXF25INV       PIC32_R (0x802DC)
#define C1RXF26          PIC32_R (0x802E0)
#define C1RXF26CLR       PIC32_R (0x802E4)
#define C1RXF26SET       PIC32_R (0x802E8)
#define C1RXF26INV       PIC32_R (0x802EC)
#define C1RXF27          PIC32_R (0x802F0)
#define C1RXF27CLR       PIC32_R (0x802F4)
#define C1RXF27SET       PIC32_R (0x802F8)
#define C1RXF27INV       PIC32_R (0x802FC)
#define C1RXF28          PIC32_R (0x80300)
#define C1RXF28CLR       PIC32_R (0x80304)
#define C1RXF28SET       PIC32_R (0x80308)
#define C1RXF28INV       PIC32_R (0x8030C)
#define C1RXF29          PIC32_R (0x80310)
#define C1RXF29CLR       PIC32_R (0x80314)
#define C1RXF29SET       PIC32_R (0x80318)
#define C1RXF29INV       PIC32_R (0x8031C)
#define C1RXF30          PIC32_R (0x80320)
#define C1RXF30CLR       PIC32_R (0x80324)
#define C1RXF30SET       PIC32_R (0x80328)
#define C1RXF30INV       PIC32_R (0x8032C)
#define C1RXF31          PIC32_R (0x80330)
#define C1RXF31CLR       PIC32_R (0x80334)
#define C1RXF31SET       PIC32_R (0x80338)
#define C1RXF31INV       PIC32_R (0x8033C)
#define C1FIFOBA         PIC32_R (0x80340)
#define C1FIFOBACLR      PIC32_R (0x80344)
#define C1FIFOBASET      PIC32_R (0x80348)
#define C1FIFOBAINV      PIC32_R (0x8034C)
#define C1FIFOCON0       PIC32_R (0x80350)
#define C1FIFOCON0CLR    PIC32_R (0x80354)
#define C1FIFOCON0SET    PIC32_R (0x80358)
#define C1FIFOCON0INV    PIC32_R (0x8035C)
#define C1FIFOINT0       PIC32_R (0x80360)
#define C1FIFOINT0CLR    PIC32_R (0x80364)
#define C1FIFOINT0SET    PIC32_R (0x80368)
#define C1FIFOINT0INV    PIC32_R (0x8036C)
#define C1FIFOUA0        PIC32_R (0x80370)
#define C1FIFOUA0CLR     PIC32_R (0x80374)
#define C1FIFOUA0SET     PIC32_R (0x80378)
#define C1FIFOUA0INV     PIC32_R (0x8037C)
#define C1FIFOCI0        PIC32_R (0x80380)
#define C1FIFOCI0CLR     PIC32_R (0x80384)
#define C1FIFOCI0SET     PIC32_R (0x80388)
#define C1FIFOCI0INV     PIC32_R (0x8038C)
#define C1FIFOCON1       PIC32_R (0x80390)
#define C1FIFOCON1CLR    PIC32_R (0x80394)
#define C1FIFOCON1SET    PIC32_R (0x80398)
#define C1FIFOCON1INV    PIC32_R (0x8039C)
#define C1FIFOINT1       PIC32_R (0x803A0)
#define C1FIFOINT1CLR    PIC32_R (0x803A4)
#define C1FIFOINT1SET    PIC32_R (0x803A8)
#define C1FIFOINT1INV    PIC32_R (0x803AC)
#define C1FIFOUA1        PIC32_R (0x803B0)
#define C1FIFOUA1CLR     PIC32_R (0x803B4)
#define C1FIFOUA1SET     PIC32_R (0x803B8)
#define C1FIFOUA1INV     PIC32_R (0x803BC)
#define C1FIFOCI1        PIC32_R (0x803C0)
#define C1FIFOCI1CLR     PIC32_R (0x803C4)
#define C1FIFOCI1SET     PIC32_R (0x803C8)
#define C1FIFOCI1INV     PIC32_R (0x803CC)
#define C1FIFOCON2       PIC32_R (0x803D0)
#define C1FIFOCON2CLR    PIC32_R (0x803D4)
#define C1FIFOCON2SET    PIC32_R (0x803D8)
#define C1FIFOCON2INV    PIC32_R (0x803DC)
#define C1FIFOINT2       PIC32_R (0x803E0)
#define C1FIFOINT2CLR    PIC32_R (0x803E4)
#define C1FIFOINT2SET    PIC32_R (0x803E8)
#define C1FIFOINT2INV    PIC32_R (0x803EC)
#define C1FIFOUA2        PIC32_R (0x803F0)
#define C1FIFOUA2CLR     PIC32_R (0x803F4)
#define C1FIFOUA2SET     PIC32_R (0x803F8)
#define C1FIFOUA2INV     PIC32_R (0x803FC)
#define C1FIFOCI2        PIC32_R (0x80400)
#define C1FIFOCI2CLR     PIC32_R (0x80404)
#define C1FIFOCI2SET     PIC32_R (0x80408)
#define C1FIFOCI2INV     PIC32_R (0x8040C)
#define C1FIFOCON3       PIC32_R (0x80410)
#define C1FIFOCON3CLR    PIC32_R (0x80414)
#define C1FIFOCON3SET    PIC32_R (0x80418)
#define C1FIFOCON3INV    PIC32_R (0x8041C)
#define C1FIFOINT3       PIC32_R (0x80420)
#define C1FIFOINT3CLR    PIC32_R (0x80424)
#define C1FIFOINT3SET    PIC32_R (0x80428)
#define C1FIFOINT3INV    PIC32_R (0x8042C)
#define C1FIFOUA3        PIC32_R (0x80430)
#define C1FIFOUA3CLR     PIC32_R (0x80434)
#define C1FIFOUA3SET     PIC32_R (0x80438)
#define C1FIFOUA3INV     PIC32_R (0x8043C)
#define C1FIFOCI3        PIC32_R (0x80440)
#define C1FIFOCI3CLR     PIC32_R (0x80444)
#define C1FIFOCI3SET     PIC32_R (0x80448)
#define C1FIFOCI3INV     PIC32_R (0x8044C)
#define C1FIFOCON4       PIC32_R (0x80450)
#define C1FIFOCON4CLR    PIC32_R (0x80454)
#define C1FIFOCON4SET    PIC32_R (0x80458)
#define C1FIFOCON4INV    PIC32_R (0x8045C)
#define C1FIFOINT4       PIC32_R (0x80460)
#define C1FIFOINT4CLR    PIC32_R (0x80464)
#define C1FIFOINT4SET    PIC32_R (0x80468)
#define C1FIFOINT4INV    PIC32_R (0x8046C)
#define C1FIFOUA4        PIC32_R (0x80470)
#define C1FIFOUA4CLR     PIC32_R (0x80474)
#define C1FIFOUA4SET     PIC32_R (0x80478)
#define C1FIFOUA4INV     PIC32_R (0x8047C)
#define C1FIFOCI4        PIC32_R (0x80480)
#define C1FIFOCI4CLR     PIC32_R (0x80484)
#define C1FIFOCI4SET     PIC32_R (0x80488)
#define C1FIFOCI4INV     PIC32_R (0x8048C)
#define C1FIFOCON5       PIC32_R (0x80490)
#define C1FIFOCON5CLR    PIC32_R (0x80494)
#define C1FIFOCON5SET    PIC32_R (0x80498)
#define C1FIFOCON5INV    PIC32_R (0x8049C)
#define C1FIFOINT5       PIC32_R (0x804A0)
#define C1FIFOINT5CLR    PIC32_R (0x804A4)
#define C1FIFOINT5SET    PIC32_R (0x804A8)
#define C1FIFOINT5INV    PIC32_R (0x804AC)
#define C1FIFOUA5        PIC32_R (0x804B0)
#define C1FIFOUA5CLR     PIC32_R (0x804B4)
#define C1FIFOUA5SET     PIC32_R (0x804B8)
#define C1FIFOUA5INV     PIC32_R (0x804BC)
#define C1FIFOCI5        PIC32_R (0x804C0)
#define C1FIFOCI5CLR     PIC32_R (0x804C4)
#define C1FIFOCI5SET     PIC32_R (0x804C8)
#define C1FIFOCI5INV     PIC32_R (0x804CC)
#define C1FIFOCON6       PIC32_R (0x804D0)
#define C1FIFOCON6CLR    PIC32_R (0x804D4)
#define C1FIFOCON6SET    PIC32_R (0x804D8)
#define C1FIFOCON6INV    PIC32_R (0x804DC)
#define C1FIFOINT6       PIC32_R (0x804E0)
#define C1FIFOINT6CLR    PIC32_R (0x804E4)
#define C1FIFOINT6SET    PIC32_R (0x804E8)
#define C1FIFOINT6INV    PIC32_R (0x804EC)
#define C1FIFOUA6        PIC32_R (0x804F0)
#define C1FIFOUA6CLR     PIC32_R (0x804F4)
#define C1FIFOUA6SET     PIC32_R (0x804F8)
#define C1FIFOUA6INV     PIC32_R (0x804FC)
#define C1FIFOCI6        PIC32_R (0x80500)
#define C1FIFOCI6CLR     PIC32_R (0x80504)
#define C1FIFOCI6SET     PIC32_R (0x80508)
#define C1FIFOCI6INV     PIC32_R (0x8050C)
#define C1FIFOCON7       PIC32_R (0x80510)
#define C1FIFOCON7CLR    PIC32_R (0x80514)
#define C1FIFOCON7SET    PIC32_R (0x80518)
#define C1FIFOCON7INV    PIC32_R (0x8051C)
#define C1FIFOINT7       PIC32_R (0x80520)
#define C1FIFOINT7CLR    PIC32_R (0x80524)
#define C1FIFOINT7SET    PIC32_R (0x80528)
#define C1FIFOINT7INV    PIC32_R (0x8052C)
#define C1FIFOUA7        PIC32_R (0x80530)
#define C1FIFOUA7CLR     PIC32_R (0x80534)
#define C1FIFOUA7SET     PIC32_R (0x80538)
#define C1FIFOUA7INV     PIC32_R (0x8053C)
#define C1FIFOCI7        PIC32_R (0x80540)
#define C1FIFOCI7CLR     PIC32_R (0x80544)
#define C1FIFOCI7SET     PIC32_R (0x80548)
#define C1FIFOCI7INV     PIC32_R (0x8054C)
#define C1FIFOCON8       PIC32_R (0x80550)
#define C1FIFOCON8CLR    PIC32_R (0x80554)
#define C1FIFOCON8SET    PIC32_R (0x80558)
#define C1FIFOCON8INV    PIC32_R (0x8055C)
#define C1FIFOINT8       PIC32_R (0x80560)
#define C1FIFOINT8CLR    PIC32_R (0x80564)
#define C1FIFOINT8SET    PIC32_R (0x80568)
#define C1FIFOINT8INV    PIC32_R (0x8056C)
#define C1FIFOUA8        PIC32_R (0x80570)
#define C1FIFOUA8CLR     PIC32_R (0x80574)
#define C1FIFOUA8SET     PIC32_R (0x80578)
#define C1FIFOUA8INV     PIC32_R (0x8057C)
#define C1FIFOCI8        PIC32_R (0x80580)
#define C1FIFOCI8CLR     PIC32_R (0x80584)
#define C1FIFOCI8SET     PIC32_R (0x80588)
#define C1FIFOCI8INV     PIC32_R (0x8058C)
#define C1FIFOCON9       PIC32_R (0x80590)
#define C1FIFOCON9CLR    PIC32_R (0x80594)
#define C1FIFOCON9SET    PIC32_R (0x80598)
#define C1FIFOCON9INV    PIC32_R (0x8059C)
#define C1FIFOINT9       PIC32_R (0x805A0)
#define C1FIFOINT9CLR    PIC32_R (0x805A4)
#define C1FIFOINT9SET    PIC32_R (0x805A8)
#define C1FIFOINT9INV    PIC32_R (0x805AC)
#define C1FIFOUA9        PIC32_R (0x805B0)
#define C1FIFOUA9CLR     PIC32_R (0x805B4)
#define C1FIFOUA9SET     PIC32_R (0x805B8)
#define C1FIFOUA9INV     PIC32_R (0x805BC)
#define C1FIFOCI9        PIC32_R (0x805C0)
#define C1FIFOCI9CLR     PIC32_R (0x805C4)
#define C1FIFOCI9SET     PIC32_R (0x805C8)
#define C1FIFOCI9INV     PIC32_R (0x805CC)
#define C1FIFOCON10      PIC32_R (0x805D0)
#define C1FIFOCON10CLR   PIC32_R (0x805D4)
#define C1FIFOCON10SET   PIC32_R (0x805D8)
#define C1FIFOCON10INV   PIC32_R (0x805DC)
#define C1FIFOINT10      PIC32_R (0x805E0)
#define C1FIFOINT10CLR   PIC32_R (0x805E4)
#define C1FIFOINT10SET   PIC32_R (0x805E8)
#define C1FIFOINT10INV   PIC32_R (0x805EC)
#define C1FIFOUA10       PIC32_R (0x805F0)
#define C1FIFOUA10CLR    PIC32_R (0x805F4)
#define C1FIFOUA10SET    PIC32_R (0x805F8)
#define C1FIFOUA10INV    PIC32_R (0x805FC)
#define C1FIFOCI10       PIC32_R (0x80600)
#define C1FIFOCI10CLR    PIC32_R (0x80604)
#define C1FIFOCI10SET    PIC32_R (0x80608)
#define C1FIFOCI10INV    PIC32_R (0x8060C)
#define C1FIFOCON11      PIC32_R (0x80610)
#define C1FIFOCON11CLR   PIC32_R (0x80614)
#define C1FIFOCON11SET   PIC32_R (0x80618)
#define C1FIFOCON11INV   PIC32_R (0x8061C)
#define C1FIFOINT11      PIC32_R (0x80620)
#define C1FIFOINT11CLR   PIC32_R (0x80624)
#define C1FIFOINT11SET   PIC32_R (0x80628)
#define C1FIFOINT11INV   PIC32_R (0x8062C)
#define C1FIFOUA11       PIC32_R (0x80630)
#define C1FIFOUA11CLR    PIC32_R (0x80634)
#define C1FIFOUA11SET    PIC32_R (0x80638)
#define C1FIFOUA11INV    PIC32_R (0x8063C)
#define C1FIFOCI11       PIC32_R (0x80640)
#define C1FIFOCI11CLR    PIC32_R (0x80644)
#define C1FIFOCI11SET    PIC32_R (0x80648)
#define C1FIFOCI11INV    PIC32_R (0x8064C)
#define C1FIFOCON12      PIC32_R (0x80650)
#define C1FIFOCON12CLR   PIC32_R (0x80654)
#define C1FIFOCON12SET   PIC32_R (0x80658)
#define C1FIFOCON12INV   PIC32_R (0x8065C)
#define C1FIFOINT12      PIC32_R (0x80660)
#define C1FIFOINT12CLR   PIC32_R (0x80664)
#define C1FIFOINT12SET   PIC32_R (0x80668)
#define C1FIFOINT12INV   PIC32_R (0x8066C)
#define C1FIFOUA12       PIC32_R (0x80670)
#define C1FIFOUA12CLR    PIC32_R (0x80674)
#define C1FIFOUA12SET    PIC32_R (0x80678)
#define C1FIFOUA12INV    PIC32_R (0x8067C)
#define C1FIFOCI12       PIC32_R (0x80680)
#define C1FIFOCI12CLR    PIC32_R (0x80684)
#define C1FIFOCI12SET    PIC32_R (0x80688)
#define C1FIFOCI12INV    PIC32_R (0x8068C)
#define C1FIFOCON13      PIC32_R (0x80690)
#define C1FIFOCON13CLR   PIC32_R (0x80694)
#define C1FIFOCON13SET   PIC32_R (0x80698)
#define C1FIFOCON13INV   PIC32_R (0x8069C)
#define C1FIFOINT13      PIC32_R (0x806A0)
#define C1FIFOINT13CLR   PIC32_R (0x806A4)
#define C1FIFOINT13SET   PIC32_R (0x806A8)
#define C1FIFOINT13INV   PIC32_R (0x806AC)
#define C1FIFOUA13       PIC32_R (0x806B0)
#define C1FIFOUA13CLR    PIC32_R (0x806B4)
#define C1FIFOUA13SET    PIC32_R (0x806B8)
#define C1FIFOUA13INV    PIC32_R (0x806BC)
#define C1FIFOCI13       PIC32_R (0x806C0)
#define C1FIFOCI13CLR    PIC32_R (0x806C4)
#define C1FIFOCI13SET    PIC32_R (0x806C8)
#define C1FIFOCI13INV    PIC32_R (0x806CC)
#define C1FIFOCON14      PIC32_R (0x806D0)
#define C1FIFOCON14CLR   PIC32_R (0x806D4)
#define C1FIFOCON14SET   PIC32_R (0x806D8)
#define C1FIFOCON14INV   PIC32_R (0x806DC)
#define C1FIFOINT14      PIC32_R (0x806E0)
#define C1FIFOINT14CLR   PIC32_R (0x806E4)
#define C1FIFOINT14SET   PIC32_R (0x806E8)
#define C1FIFOINT14INV   PIC32_R (0x806EC)
#define C1FIFOUA14       PIC32_R (0x806F0)
#define C1FIFOUA14CLR    PIC32_R (0x806F4)
#define C1FIFOUA14SET    PIC32_R (0x806F8)
#define C1FIFOUA14INV    PIC32_R (0x806FC)
#define C1FIFOCI14       PIC32_R (0x80700)
#define C1FIFOCI14CLR    PIC32_R (0x80704)
#define C1FIFOCI14SET    PIC32_R (0x80708)
#define C1FIFOCI14INV    PIC32_R (0x8070C)
#define C1FIFOCON15      PIC32_R (0x80710)
#define C1FIFOCON15CLR   PIC32_R (0x80714)
#define C1FIFOCON15SET   PIC32_R (0x80718)
#define C1FIFOCON15INV   PIC32_R (0x8071C)
#define C1FIFOINT15      PIC32_R (0x80720)
#define C1FIFOINT15CLR   PIC32_R (0x80724)
#define C1FIFOINT15SET   PIC32_R (0x80728)
#define C1FIFOINT15INV   PIC32_R (0x8072C)
#define C1FIFOUA15       PIC32_R (0x80730)
#define C1FIFOUA15CLR    PIC32_R (0x80734)
#define C1FIFOUA15SET    PIC32_R (0x80738)
#define C1FIFOUA15INV    PIC32_R (0x8073C)
#define C1FIFOCI15       PIC32_R (0x80740)
#define C1FIFOCI15CLR    PIC32_R (0x80744)
#define C1FIFOCI15SET    PIC32_R (0x80748)
#define C1FIFOCI15INV    PIC32_R (0x8074C)
#define C1FIFOCON16      PIC32_R (0x80750)
#define C1FIFOCON16CLR   PIC32_R (0x80754)
#define C1FIFOCON16SET   PIC32_R (0x80758)
#define C1FIFOCON16INV   PIC32_R (0x8075C)
#define C1FIFOINT16      PIC32_R (0x80760)
#define C1FIFOINT16CLR   PIC32_R (0x80764)
#define C1FIFOINT16SET   PIC32_R (0x80768)
#define C1FIFOINT16INV   PIC32_R (0x8076C)
#define C1FIFOUA16       PIC32_R (0x80770)
#define C1FIFOUA16CLR    PIC32_R (0x80774)
#define C1FIFOUA16SET    PIC32_R (0x80778)
#define C1FIFOUA16INV    PIC32_R (0x8077C)
#define C1FIFOCI16       PIC32_R (0x80780)
#define C1FIFOCI16CLR    PIC32_R (0x80784)
#define C1FIFOCI16SET    PIC32_R (0x80788)
#define C1FIFOCI16INV    PIC32_R (0x8078C)
#define C1FIFOCON17      PIC32_R (0x80790)
#define C1FIFOCON17CLR   PIC32_R (0x80794)
#define C1FIFOCON17SET   PIC32_R (0x80798)
#define C1FIFOCON17INV   PIC32_R (0x8079C)
#define C1FIFOINT17      PIC32_R (0x807A0)
#define C1FIFOINT17CLR   PIC32_R (0x807A4)
#define C1FIFOINT17SET   PIC32_R (0x807A8)
#define C1FIFOINT17INV   PIC32_R (0x807AC)
#define C1FIFOUA17       PIC32_R (0x807B0)
#define C1FIFOUA17CLR    PIC32_R (0x807B4)
#define C1FIFOUA17SET    PIC32_R (0x807B8)
#define C1FIFOUA17INV    PIC32_R (0x807BC)
#define C1FIFOCI17       PIC32_R (0x807C0)
#define C1FIFOCI17CLR    PIC32_R (0x807C4)
#define C1FIFOCI17SET    PIC32_R (0x807C8)
#define C1FIFOCI17INV    PIC32_R (0x807CC)
#define C1FIFOCON18      PIC32_R (0x807D0)
#define C1FIFOCON18CLR   PIC32_R (0x807D4)
#define C1FIFOCON18SET   PIC32_R (0x807D8)
#define C1FIFOCON18INV   PIC32_R (0x807DC)
#define C1FIFOINT18      PIC32_R (0x807E0)
#define C1FIFOINT18CLR   PIC32_R (0x807E4)
#define C1FIFOINT18SET   PIC32_R (0x807E8)
#define C1FIFOINT18INV   PIC32_R (0x807EC)
#define C1FIFOUA18       PIC32_R (0x807F0)
#define C1FIFOUA18CLR    PIC32_R (0x807F4)
#define C1FIFOUA18SET    PIC32_R (0x807F8)
#define C1FIFOUA18INV    PIC32_R (0x807FC)
#define C1FIFOCI18       PIC32_R (0x80800)
#define C1FIFOCI18CLR    PIC32_R (0x80804)
#define C1FIFOCI18SET    PIC32_R (0x80808)
#define C1FIFOCI18INV    PIC32_R (0x8080C)
#define C1FIFOCON19      PIC32_R (0x80810)
#define C1FIFOCON19CLR   PIC32_R (0x80814)
#define C1FIFOCON19SET   PIC32_R (0x80818)
#define C1FIFOCON19INV   PIC32_R (0x8081C)
#define C1FIFOINT19      PIC32_R (0x80820)
#define C1FIFOINT19CLR   PIC32_R (0x80824)
#define C1FIFOINT19SET   PIC32_R (0x80828)
#define C1FIFOINT19INV   PIC32_R (0x8082C)
#define C1FIFOUA19       PIC32_R (0x80830)
#define C1FIFOUA19CLR    PIC32_R (0x80834)
#define C1FIFOUA19SET    PIC32_R (0x80838)
#define C1FIFOUA19INV    PIC32_R (0x8083C)
#define C1FIFOCI19       PIC32_R (0x80840)
#define C1FIFOCI19CLR    PIC32_R (0x80844)
#define C1FIFOCI19SET    PIC32_R (0x80848)
#define C1FIFOCI19INV    PIC32_R (0x8084C)
#define C1FIFOCON20      PIC32_R (0x80850)
#define C1FIFOCON20CLR   PIC32_R (0x80854)
#define C1FIFOCON20SET   PIC32_R (0x80858)
#define C1FIFOCON20INV   PIC32_R (0x8085C)
#define C1FIFOINT20      PIC32_R (0x80860)
#define C1FIFOINT20CLR   PIC32_R (0x80864)
#define C1FIFOINT20SET   PIC32_R (0x80868)
#define C1FIFOINT20INV   PIC32_R (0x8086C)
#define C1FIFOUA20       PIC32_R (0x80870)
#define C1FIFOUA20CLR    PIC32_R (0x80874)
#define C1FIFOUA20SET    PIC32_R (0x80878)
#define C1FIFOUA20INV    PIC32_R (0x8087C)
#define C1FIFOCI20       PIC32_R (0x80880)
#define C1FIFOCI20CLR    PIC32_R (0x80884)
#define C1FIFOCI20SET    PIC32_R (0x80888)
#define C1FIFOCI20INV    PIC32_R (0x8088C)
#define C1FIFOCON21      PIC32_R (0x80890)
#define C1FIFOCON21CLR   PIC32_R (0x80894)
#define C1FIFOCON21SET   PIC32_R (0x80898)
#define C1FIFOCON21INV   PIC32_R (0x8089C)
#define C1FIFOINT21      PIC32_R (0x808A0)
#define C1FIFOINT21CLR   PIC32_R (0x808A4)
#define C1FIFOINT21SET   PIC32_R (0x808A8)
#define C1FIFOINT21INV   PIC32_R (0x808AC)
