whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
#define C1FIFOUA21       PIC32_R (0x808B0)
#define C1FIFOUA21CLR    PIC32_R (0x808B4)
#define C1FIFOUA21SET    PIC32_R (0x808B8)
#define C1FIFOUA21INV    PIC32_R (0x808BC)
#define C1FIFOCI21       PIC32_R (0x808C0)
#define C1FIFOCI21CLR    PIC32_R (0x808C4)
#define C1FIFOCI21SET    PIC32_R (0x808C8)
#define C1FIFOCI21INV    PIC32_R (0x808CC)
#define C1FIFOCON22      PIC32_R (0x808D0)
#define C1FIFOCON22CLR   PIC32_R (0x808D4)
#define C1FIFOCON22SET   PIC32_R (0x808D8)
#define C1FIFOCON22INV   PIC32_R (0x808DC)
#define C1FIFOINT22      PIC32_R (0x808E0)
#define C1FIFOINT22CLR   PIC32_R (0x808E4)
#define C1FIFOINT22SET   PIC32_R (0x808E8)
#define C1FIFOINT22INV   PIC32_R (0x808EC)
#define C1FIFOUA22       PIC32_R (0x808F0)
#define C1FIFOUA22CLR    PIC32_R (0x808F4)
#define C1FIFOUA22SET    PIC32_R (0x808F8)
#define C1FIFOUA22INV    PIC32_R (0x808FC)
#define C1FIFOCI22       PIC32_R (0x80900)
#define C1FIFOCI22CLR    PIC32_R (0x80904)
#define C1FIFOCI22SET    PIC32_R (0x80908)
#define C1FIFOCI22INV    PIC32_R (0x8090C)
#define C1FIFOCON23      PIC32_R (0x80910)
#define C1FIFOCON23CLR   PIC32_R (0x80914)
#define C1FIFOCON23SET   PIC32_R (0x80918)
#define C1FIFOCON23INV   PIC32_R (0x8091C)
#define C1FIFOINT23      PIC32_R (0x80920)
#define C1FIFOINT23CLR   PIC32_R (0x80924)
#define C1FIFOINT23SET   PIC32_R (0x80928)
#define C1FIFOINT23INV   PIC32_R (0x8092C)
#define C1FIFOUA23       PIC32_R (0x80930)
#define C1FIFOUA23CLR    PIC32_R (0x80934)
#define C1FIFOUA23SET    PIC32_R (0x80938)
#define C1FIFOUA23INV    PIC32_R (0x8093C)
#define C1FIFOCI23       PIC32_R (0x80940)
#define C1FIFOCI23CLR    PIC32_R (0x80944)
#define C1FIFOCI23SET    PIC32_R (0x80948)
#define C1FIFOCI23INV    PIC32_R (0x8094C)
#define C1FIFOCON24      PIC32_R (0x80950)
#define C1FIFOCON24CLR   PIC32_R (0x80954)
#define C1FIFOCON24SET   PIC32_R (0x80958)
#define C1FIFOCON24INV   PIC32_R (0x8095C)
#define C1FIFOINT24      PIC32_R (0x80960)
#define C1FIFOINT24CLR   PIC32_R (0x80964)
#define C1FIFOINT24SET   PIC32_R (0x80968)
#define C1FIFOINT24INV   PIC32_R (0x8096C)
#define C1FIFOUA24       PIC32_R (0x80970)
#define C1FIFOUA24CLR    PIC32_R (0x80974)
#define C1FIFOUA24SET    PIC32_R (0x80978)
#define C1FIFOUA24INV    PIC32_R (0x8097C)
#define C1FIFOCI24       PIC32_R (0x80980)
#define C1FIFOCI24CLR    PIC32_R (0x80984)
#define C1FIFOCI24SET    PIC32_R (0x80988)
#define C1FIFOCI24INV    PIC32_R (0x8098C)
#define C1FIFOCON25      PIC32_R (0x80990)
#define C1FIFOCON25CLR   PIC32_R (0x80994)
#define C1FIFOCON25SET   PIC32_R (0x80998)
#define C1FIFOCON25INV   PIC32_R (0x8099C)
#define C1FIFOINT25      PIC32_R (0x809A0)
#define C1FIFOINT25CLR   PIC32_R (0x809A4)
#define C1FIFOINT25SET   PIC32_R (0x809A8)
#define C1FIFOINT25INV   PIC32_R (0x809AC)
#define C1FIFOUA25       PIC32_R (0x809B0)
#define C1FIFOUA25CLR    PIC32_R (0x809B4)
#define C1FIFOUA25SET    PIC32_R (0x809B8)
#define C1FIFOUA25INV    PIC32_R (0x809BC)
#define C1FIFOCI25       PIC32_R (0x809C0)
#define C1FIFOCI25CLR    PIC32_R (0x809C4)
#define C1FIFOCI25SET    PIC32_R (0x809C8)
#define C1FIFOCI25INV    PIC32_R (0x809CC)
#define C1FIFOCON26      PIC32_R (0x809D0)
#define C1FIFOCON26CLR   PIC32_R (0x809D4)
#define C1FIFOCON26SET   PIC32_R (0x809D8)
#define C1FIFOCON26INV   PIC32_R (0x809DC)
#define C1FIFOINT26      PIC32_R (0x809E0)
#define C1FIFOINT26CLR   PIC32_R (0x809E4)
#define C1FIFOINT26SET   PIC32_R (0x809E8)
#define C1FIFOINT26INV   PIC32_R (0x809EC)
#define C1FIFOUA26       PIC32_R (0x809F0)
#define C1FIFOUA26CLR    PIC32_R (0x809F4)
#define C1FIFOUA26SET    PIC32_R (0x809F8)
#define C1FIFOUA26INV    PIC32_R (0x809FC)
#define C1FIFOCI26       PIC32_R (0x80A00)
#define C1FIFOCI26CLR    PIC32_R (0x80A04)
#define C1FIFOCI26SET    PIC32_R (0x80A08)
#define C1FIFOCI26INV    PIC32_R (0x80A0C)
#define C1FIFOCON27      PIC32_R (0x80A10)
#define C1FIFOCON27CLR   PIC32_R (0x80A14)
#define C1FIFOCON27SET   PIC32_R (0x80A18)
#define C1FIFOCON27INV   PIC32_R (0x80A1C)
#define C1FIFOINT27      PIC32_R (0x80A20)
#define C1FIFOINT27CLR   PIC32_R (0x80A24)
#define C1FIFOINT27SET   PIC32_R (0x80A28)
#define C1FIFOINT27INV   PIC32_R (0x80A2C)
#define C1FIFOUA27       PIC32_R (0x80A30)
#define C1FIFOUA27CLR    PIC32_R (0x80A34)
#define C1FIFOUA27SET    PIC32_R (0x80A38)
#define C1FIFOUA27INV    PIC32_R (0x80A3C)
#define C1FIFOCI27       PIC32_R (0x80A40)
#define C1FIFOCI27CLR    PIC32_R (0x80A44)
#define C1FIFOCI27SET    PIC32_R (0x80A48)
#define C1FIFOCI27INV    PIC32_R (0x80A4C)
#define C1FIFOCON28      PIC32_R (0x80A50)
#define C1FIFOCON28CLR   PIC32_R (0x80A54)
#define C1FIFOCON28SET   PIC32_R (0x80A58)
#define C1FIFOCON28INV   PIC32_R (0x80A5C)
#define C1FIFOINT28      PIC32_R (0x80A60)
#define C1FIFOINT28CLR   PIC32_R (0x80A64)
#define C1FIFOINT28SET   PIC32_R (0x80A68)
#define C1FIFOINT28INV   PIC32_R (0x80A6C)
#define C1FIFOUA28       PIC32_R (0x80A70)
#define C1FIFOUA28CLR    PIC32_R (0x80A74)
#define C1FIFOUA28SET    PIC32_R (0x80A78)
#define C1FIFOUA28INV    PIC32_R (0x80A7C)
#define C1FIFOCI28       PIC32_R (0x80A80)
#define C1FIFOCI28CLR    PIC32_R (0x80A84)
#define C1FIFOCI28SET    PIC32_R (0x80A88)
#define C1FIFOCI28INV    PIC32_R (0x80A8C)
#define C1FIFOCON29      PIC32_R (0x80A90)
#define C1FIFOCON29CLR   PIC32_R (0x80A94)
#define C1FIFOCON29SET   PIC32_R (0x80A98)
#define C1FIFOCON29INV   PIC32_R (0x80A9C)
#define C1FIFOINT29      PIC32_R (0x80AA0)
#define C1FIFOINT29CLR   PIC32_R (0x80AA4)
#define C1FIFOINT29SET   PIC32_R (0x80AA8)
#define C1FIFOINT29INV   PIC32_R (0x80AAC)
#define C1FIFOUA29       PIC32_R (0x80AB0)
#define C1FIFOUA29CLR    PIC32_R (0x80AB4)
#define C1FIFOUA29SET    PIC32_R (0x80AB8)
#define C1FIFOUA29INV    PIC32_R (0x80ABC)
#define C1FIFOCI29       PIC32_R (0x80AC0)
#define C1FIFOCI29CLR    PIC32_R (0x80AC4)
#define C1FIFOCI29SET    PIC32_R (0x80AC8)
#define C1FIFOCI29INV    PIC32_R (0x80ACC)
#define C1FIFOCON30      PIC32_R (0x80AD0)
#define C1FIFOCON30CLR   PIC32_R (0x80AD4)
#define C1FIFOCON30SET   PIC32_R (0x80AD8)
#define C1FIFOCON30INV   PIC32_R (0x80ADC)
#define C1FIFOINT30      PIC32_R (0x80AE0)
#define C1FIFOINT30CLR   PIC32_R (0x80AE4)
#define C1FIFOINT30SET   PIC32_R (0x80AE8)
#define C1FIFOINT30INV   PIC32_R (0x80AEC)
#define C1FIFOUA30       PIC32_R (0x80AF0)
#define C1FIFOUA30CLR    PIC32_R (0x80AF4)
#define C1FIFOUA30SET    PIC32_R (0x80AF8)
#define C1FIFOUA30INV    PIC32_R (0x80AFC)
#define C1FIFOCI30       PIC32_R (0x80B00)
#define C1FIFOCI30CLR    PIC32_R (0x80B04)
#define C1FIFOCI30SET    PIC32_R (0x80B08)
#define C1FIFOCI30INV    PIC32_R (0x80B0C)
#define C1FIFOCON31      PIC32_R (0x80B10)
#define C1FIFOCON31CLR   PIC32_R (0x80B14)
#define C1FIFOCON31SET   PIC32_R (0x80B18)
#define C1FIFOCON31INV   PIC32_R (0x80B1C)
#define C1FIFOINT31      PIC32_R (0x80B20)
#define C1FIFOINT31CLR   PIC32_R (0x80B24)
#define C1FIFOINT31SET   PIC32_R (0x80B28)
#define C1FIFOINT31INV   PIC32_R (0x80B2C)
#define C1FIFOUA31       PIC32_R (0x80B30)
#define C1FIFOUA31CLR    PIC32_R (0x80B34)
#define C1FIFOUA31SET    PIC32_R (0x80B38)
#define C1FIFOUA31INV    PIC32_R (0x80B3C)
#define C1FIFOCI31       PIC32_R (0x80B40)
#define C1FIFOCI31CLR    PIC32_R (0x80B44)
#define C1FIFOCI31SET    PIC32_R (0x80B48)
#define C1FIFOCI31INV    PIC32_R (0x80B4C)
#define C2CON            PIC32_R (0x81000)
#define C2CONCLR         PIC32_R (0x81004)
#define C2CONSET         PIC32_R (0x81008)
#define C2CONINV         PIC32_R (0x8100C)
#define C2CFG            PIC32_R (0x81010)
#define C2CFGCLR         PIC32_R (0x81014)
#define C2CFGSET         PIC32_R (0x81018)
#define C2CFGINV         PIC32_R (0x8101C)
#define C2INT            PIC32_R (0x81020)
#define C2INTCLR         PIC32_R (0x81024)
#define C2INTSET         PIC32_R (0x81028)
#define C2INTINV         PIC32_R (0x8102C)
#define C2VEC            PIC32_R (0x81030)
#define C2VECCLR         PIC32_R (0x81034)
#define C2VECSET         PIC32_R (0x81038)
#define C2VECINV         PIC32_R (0x8103C)
#define C2TREC           PIC32_R (0x81040)
#define C2TRECCLR        PIC32_R (0x81044)
#define C2TRECSET        PIC32_R (0x81048)
#define C2TRECINV        PIC32_R (0x8104C)
#define C2FSTAT          PIC32_R (0x81050)
#define C2FSTATCLR       PIC32_R (0x81054)
#define C2FSTATSET       PIC32_R (0x81058)
#define C2FSTATINV       PIC32_R (0x8105C)
#define C2RXOVF          PIC32_R (0x81060)
#define C2RXOVFCLR       PIC32_R (0x81064)
#define C2RXOVFSET       PIC32_R (0x81068)
#define C2RXOVFINV       PIC32_R (0x8106C)
#define C2TMR            PIC32_R (0x81070)
#define C2TMRCLR         PIC32_R (0x81074)
#define C2TMRSET         PIC32_R (0x81078)
#define C2TMRINV         PIC32_R (0x8107C)
#define C2RXM0           PIC32_R (0x81080)
#define C2RXM0CLR        PIC32_R (0x81084)
#define C2RXM0SET        PIC32_R (0x81088)
#define C2RXM0INV        PIC32_R (0x8108C)
#define C2RXM1           PIC32_R (0x81090)
#define C2RXM1CLR        PIC32_R (0x81094)
#define C2RXM1SET        PIC32_R (0x81098)
#define C2RXM1INV        PIC32_R (0x8109C)
#define C2RXM2           PIC32_R (0x810A0)
#define C2RXM2CLR        PIC32_R (0x810A4)
#define C2RXM2SET        PIC32_R (0x810A8)
#define C2RXM2INV        PIC32_R (0x810AC)
#define C2RXM3           PIC32_R (0x810B0)
#define C2RXM3CLR        PIC32_R (0x810B4)
#define C2RXM3SET        PIC32_R (0x810B8)
#define C2RXM3INV        PIC32_R (0x810BC)
#define C2FLTCON0        PIC32_R (0x810C0)
#define C2FLTCON0CLR     PIC32_R (0x810C4)
#define C2FLTCON0SET     PIC32_R (0x810C8)
#define C2FLTCON0INV     PIC32_R (0x810CC)
#define C2FLTCON1        PIC32_R (0x810D0)
#define C2FLTCON1CLR     PIC32_R (0x810D4)
#define C2FLTCON1SET     PIC32_R (0x810D8)
#define C2FLTCON1INV     PIC32_R (0x810DC)
#define C2FLTCON2        PIC32_R (0x810E0)
#define C2FLTCON2CLR     PIC32_R (0x810E4)
#define C2FLTCON2SET     PIC32_R (0x810E8)
#define C2FLTCON2INV     PIC32_R (0x810EC)
#define C2FLTCON3        PIC32_R (0x810F0)
#define C2FLTCON3CLR     PIC32_R (0x810F4)
#define C2FLTCON3SET     PIC32_R (0x810F8)
#define C2FLTCON3INV     PIC32_R (0x810FC)
#define C2FLTCON4        PIC32_R (0x81100)
#define C2FLTCON4CLR     PIC32_R (0x81104)
#define C2FLTCON4SET     PIC32_R (0x81108)
#define C2FLTCON4INV     PIC32_R (0x8110C)
#define C2FLTCON5        PIC32_R (0x81110)
#define C2FLTCON5CLR     PIC32_R (0x81114)
#define C2FLTCON5SET     PIC32_R (0x81118)
#define C2FLTCON5INV     PIC32_R (0x8111C)
#define C2FLTCON6        PIC32_R (0x81120)
#define C2FLTCON6CLR     PIC32_R (0x81124)
#define C2FLTCON6SET     PIC32_R (0x81128)
#define C2FLTCON6INV     PIC32_R (0x8112C)
#define C2FLTCON7        PIC32_R (0x81130)
#define C2FLTCON7CLR     PIC32_R (0x81134)
#define C2FLTCON7SET     PIC32_R (0x81138)
#define C2FLTCON7INV     PIC32_R (0x8113C)
#define C2RXF0           PIC32_R (0x81140)
#define C2RXF0CLR        PIC32_R (0x81144)
#define C2RXF0SET        PIC32_R (0x81148)
#define C2RXF0INV        PIC32_R (0x8114C)
#define C2RXF1           PIC32_R (0x81150)
#define C2RXF1CLR        PIC32_R (0x81154)
#define C2RXF1SET        PIC32_R (0x81158)
#define C2RXF1INV        PIC32_R (0x8115C)
#define C2RXF2           PIC32_R (0x81160)
#define C2RXF2CLR        PIC32_R (0x81164)
#define C2RXF2SET        PIC32_R (0x81168)
#define C2RXF2INV        PIC32_R (0x8116C)
#define C2RXF3           PIC32_R (0x81170)
#define C2RXF3CLR        PIC32_R (0x81174)
#define C2RXF3SET        PIC32_R (0x81178)
#define C2RXF3INV        PIC32_R (0x8117C)
#define C2RXF4           PIC32_R (0x81180)
#define C2RXF4CLR        PIC32_R (0x81184)
#define C2RXF4SET        PIC32_R (0x81188)
#define C2RXF4INV        PIC32_R (0x8118C)
#define C2RXF5           PIC32_R (0x81190)
#define C2RXF5CLR        PIC32_R (0x81194)
#define C2RXF5SET        PIC32_R (0x81198)
#define C2RXF5INV        PIC32_R (0x8119C)
#define C2RXF6           PIC32_R (0x811A0)
#define C2RXF6CLR        PIC32_R (0x811A4)
#define C2RXF6SET        PIC32_R (0x811A8)
#define C2RXF6INV        PIC32_R (0x811AC)
#define C2RXF7           PIC32_R (0x811B0)
#define C2RXF7CLR        PIC32_R (0x811B4)
#define C2RXF7SET        PIC32_R (0x811B8)
#define C2RXF7INV        PIC32_R (0x811BC)
#define C2RXF8           PIC32_R (0x811C0)
#define C2RXF8CLR        PIC32_R (0x811C4)
#define C2RXF8SET        PIC32_R (0x811C8)
#define C2RXF8INV        PIC32_R (0x811CC)
#define C2RXF9           PIC32_R (0x811D0)
#define C2RXF9CLR        PIC32_R (0x811D4)
#define C2RXF9SET        PIC32_R (0x811D8)
#define C2RXF9INV        PIC32_R (0x811DC)
#define C2RXF10          PIC32_R (0x811E0)
#define C2RXF10CLR       PIC32_R (0x811E4)
#define C2RXF10SET       PIC32_R (0x811E8)
#define C2RXF10INV       PIC32_R (0x811EC)
#define C2RXF11          PIC32_R (0x811F0)
#define C2RXF11CLR       PIC32_R (0x811F4)
#define C2RXF11SET       PIC32_R (0x811F8)
#define C2RXF11INV       PIC32_R (0x811FC)
#define C2RXF12          PIC32_R (0x81200)
#define C2RXF12CLR       PIC32_R (0x81204)
#define C2RXF12SET       PIC32_R (0x81208)
#define C2RXF12INV       PIC32_R (0x8120C)
#define C2RXF13          PIC32_R (0x81210)
#define C2RXF13CLR       PIC32_R (0x81214)
#define C2RXF13SET       PIC32_R (0x81218)
#define C2RXF13INV       PIC32_R (0x8121C)
#define C2RXF14          PIC32_R (0x81220)
#define C2RXF14CLR       PIC32_R (0x81224)
#define C2RXF14SET       PIC32_R (0x81228)
#define C2RXF14INV       PIC32_R (0x8122C)
#define C2RXF15          PIC32_R (0x81230)
#define C2RXF15CLR       PIC32_R (0x81234)
#define C2RXF15SET       PIC32_R (0x81238)
#define C2RXF15INV       PIC32_R (0x8123C)
#define C2RXF16          PIC32_R (0x81240)
#define C2RXF16CLR       PIC32_R (0x81244)
#define C2RXF16SET       PIC32_R (0x81248)
#define C2RXF16INV       PIC32_R (0x8124C)
#define C2RXF17          PIC32_R (0x81250)
#define C2RXF17CLR       PIC32_R (0x81254)
#define C2RXF17SET       PIC32_R (0x81258)
#define C2RXF17INV       PIC32_R (0x8125C)
#define C2RXF18          PIC32_R (0x81260)
#define C2RXF18CLR       PIC32_R (0x81264)
#define C2RXF18SET       PIC32_R (0x81268)
#define C2RXF18INV       PIC32_R (0x8126C)
#define C2RXF19          PIC32_R (0x81270)
#define C2RXF19CLR       PIC32_R (0x81274)
#define C2RXF19SET       PIC32_R (0x81278)
#define C2RXF19INV       PIC32_R (0x8127C)
#define C2RXF20          PIC32_R (0x81280)
#define C2RXF20CLR       PIC32_R (0x81284)
#define C2RXF20SET       PIC32_R (0x81288)
#define C2RXF20INV       PIC32_R (0x8128C)
#define C2RXF21          PIC32_R (0x81290)
#define C2RXF21CLR       PIC32_R (0x81294)
#define C2RXF21SET       PIC32_R (0x81298)
#define C2RXF21INV       PIC32_R (0x8129C)
#define C2RXF22          PIC32_R (0x812A0)
#define C2RXF22CLR       PIC32_R (0x812A4)
#define C2RXF22SET       PIC32_R (0x812A8)
#define C2RXF22INV       PIC32_R (0x812AC)
#define C2RXF23          PIC32_R (0x812B0)
#define C2RXF23CLR       PIC32_R (0x812B4)
#define C2RXF23SET       PIC32_R (0x812B8)
#define C2RXF23INV       PIC32_R (0x812BC)
#define C2RXF24          PIC32_R (0x812C0)
#define C2RXF24CLR       PIC32_R (0x812C4)
#define C2RXF24SET       PIC32_R (0x812C8)
#define C2RXF24INV       PIC32_R (0x812CC)
#define C2RXF25          PIC32_R (0x812D0)
#define C2RXF25CLR       PIC32_R (0x812D4)
#define C2RXF25SET       PIC32_R (0x812D8)
#define C2RXF25INV       PIC32_R (0x812DC)
#define C2RXF26          PIC32_R (0x812E0)
#define C2RXF26CLR       PIC32_R (0x812E4)
#define C2RXF26SET       PIC32_R (0x812E8)
#define C2RXF26INV       PIC32_R (0x812EC)
#define C2RXF27          PIC32_R (0x812F0)
#define C2RXF27CLR       PIC32_R (0x812F4)
#define C2RXF27SET       PIC32_R (0x812F8)
#define C2RXF27INV       PIC32_R (0x812FC)
#define C2RXF28          PIC32_R (0x81300)
#define C2RXF28CLR       PIC32_R (0x81304)
#define C2RXF28SET       PIC32_R (0x81308)
#define C2RXF28INV       PIC32_R (0x8130C)
#define C2RXF29          PIC32_R (0x81310)
#define C2RXF29CLR       PIC32_R (0x81314)
#define C2RXF29SET       PIC32_R (0x81318)
#define C2RXF29INV       PIC32_R (0x8131C)
#define C2RXF30          PIC32_R (0x81320)
#define C2RXF30CLR       PIC32_R (0x81324)
#define C2RXF30SET       PIC32_R (0x81328)
#define C2RXF30INV       PIC32_R (0x8132C)
#define C2RXF31          PIC32_R (0x81330)
#define C2RXF31CLR       PIC32_R (0x81334)
#define C2RXF31SET       PIC32_R (0x81338)
#define C2RXF31INV       PIC32_R (0x8133C)
#define C2FIFOBA         PIC32_R (0x81340)
#define C2FIFOBACLR      PIC32_R (0x81344)
#define C2FIFOBASET      PIC32_R (0x81348)
#define C2FIFOBAINV      PIC32_R (0x8134C)
#define C2FIFOCON0       PIC32_R (0x81350)
#define C2FIFOCON0CLR    PIC32_R (0x81354)
#define C2FIFOCON0SET    PIC32_R (0x81358)
#define C2FIFOCON0INV    PIC32_R (0x8135C)
#define C2FIFOINT0       PIC32_R (0x81360)
#define C2FIFOINT0CLR    PIC32_R (0x81364)
#define C2FIFOINT0SET    PIC32_R (0x81368)
#define C2FIFOINT0INV    PIC32_R (0x8136C)
#define C2FIFOUA0        PIC32_R (0x81370)
#define C2FIFOUA0CLR     PIC32_R (0x81374)
#define C2FIFOUA0SET     PIC32_R (0x81378)
#define C2FIFOUA0INV     PIC32_R (0x8137C)
#define C2FIFOCI0        PIC32_R (0x81380)
#define C2FIFOCI0CLR     PIC32_R (0x81384)
#define C2FIFOCI0SET     PIC32_R (0x81388)
#define C2FIFOCI0INV     PIC32_R (0x8138C)
#define C2FIFOCON1       PIC32_R (0x81390)
#define C2FIFOCON1CLR    PIC32_R (0x81394)
#define C2FIFOCON1SET    PIC32_R (0x81398)
#define C2FIFOCON1INV    PIC32_R (0x8139C)
#define C2FIFOINT1       PIC32_R (0x813A0)
#define C2FIFOINT1CLR    PIC32_R (0x813A4)
#define C2FIFOINT1SET    PIC32_R (0x813A8)
#define C2FIFOINT1INV    PIC32_R (0x813AC)
#define C2FIFOUA1        PIC32_R (0x813B0)
#define C2FIFOUA1CLR     PIC32_R (0x813B4)
#define C2FIFOUA1SET     PIC32_R (0x813B8)
#define C2FIFOUA1INV     PIC32_R (0x813BC)
#define C2FIFOCI1        PIC32_R (0x813C0)
#define C2FIFOCI1CLR     PIC32_R (0x813C4)
#define C2FIFOCI1SET     PIC32_R (0x813C8)
#define C2FIFOCI1INV     PIC32_R (0x813CC)
#define C2FIFOCON2       PIC32_R (0x813D0)
#define C2FIFOCON2CLR    PIC32_R (0x813D4)
#define C2FIFOCON2SET    PIC32_R (0x813D8)
#define C2FIFOCON2INV    PIC32_R (0x813DC)
#define C2FIFOINT2       PIC32_R (0x813E0)
#define C2FIFOINT2CLR    PIC32_R (0x813E4)
#define C2FIFOINT2SET    PIC32_R (0x813E8)
#define C2FIFOINT2INV    PIC32_R (0x813EC)
#define C2FIFOUA2        PIC32_R (0x813F0)
#define C2FIFOUA2CLR     PIC32_R (0x813F4)
#define C2FIFOUA2SET     PIC32_R (0x813F8)
#define C2FIFOUA2INV     PIC32_R (0x813FC)
#define C2FIFOCI2        PIC32_R (0x81400)
#define C2FIFOCI2CLR     PIC32_R (0x81404)
#define C2FIFOCI2SET     PIC32_R (0x81408)
#define C2FIFOCI2INV     PIC32_R (0x8140C)
#define C2FIFOCON3       PIC32_R (0x81410)
#define C2FIFOCON3CLR    PIC32_R (0x81414)
#define C2FIFOCON3SET    PIC32_R (0x81418)
#define C2FIFOCON3INV    PIC32_R (0x8141C)
#define C2FIFOINT3       PIC32_R (0x81420)
#define C2FIFOINT3CLR    PIC32_R (0x81424)
#define C2FIFOINT3SET    PIC32_R (0x81428)
#define C2FIFOINT3INV    PIC32_R (0x8142C)
#define C2FIFOUA3        PIC32_R (0x81430)
#define C2FIFOUA3CLR     PIC32_R (0x81434)
#define C2FIFOUA3SET     PIC32_R (0x81438)
#define C2FIFOUA3INV     PIC32_R (0x8143C)
#define C2FIFOCI3        PIC32_R (0x81440)
#define C2FIFOCI3CLR     PIC32_R (0x81444)
#define C2FIFOCI3SET     PIC32_R (0x81448)
#define C2FIFOCI3INV     PIC32_R (0x8144C)
#define C2FIFOCON4       PIC32_R (0x81450)
#define C2FIFOCON4CLR    PIC32_R (0x81454)
#define C2FIFOCON4SET    PIC32_R (0x81458)
#define C2FIFOCON4INV    PIC32_R (0x8145C)
#define C2FIFOINT4       PIC32_R (0x81460)
#define C2FIFOINT4CLR    PIC32_R (0x81464)
#define C2FIFOINT4SET    PIC32_R (0x81468)
#define C2FIFOINT4INV    PIC32_R (0x8146C)
#define C2FIFOUA4        PIC32_R (0x81470)
#define C2FIFOUA4CLR     PIC32_R (0x81474)
#define C2FIFOUA4SET     PIC32_R (0x81478)
#define C2FIFOUA4INV     PIC32_R (0x8147C)
#define C2FIFOCI4        PIC32_R (0x81480)
#define C2FIFOCI4CLR     PIC32_R (0x81484)
#define C2FIFOCI4SET     PIC32_R (0x81488)
#define C2FIFOCI4INV     PIC32_R (0x8148C)
#define C2FIFOCON5       PIC32_R (0x81490)
#define C2FIFOCON5CLR    PIC32_R (0x81494)
#define C2FIFOCON5SET    PIC32_R (0x81498)
#define C2FIFOCON5INV    PIC32_R (0x8149C)
#define C2FIFOINT5       PIC32_R (0x814A0)
#define C2FIFOINT5CLR    PIC32_R (0x814A4)
#define C2FIFOINT5SET    PIC32_R (0x814A8)
#define C2FIFOINT5INV    PIC32_R (0x814AC)
#define C2FIFOUA5        PIC32_R (0x814B0)
#define C2FIFOUA5CLR     PIC32_R (0x814B4)
#define C2FIFOUA5SET     PIC32_R (0x814B8)
#define C2FIFOUA5INV     PIC32_R (0x814BC)
#define C2FIFOCI5        PIC32_R (0x814C0)
#define C2FIFOCI5CLR     PIC32_R (0x814C4)
#define C2FIFOCI5SET     PIC32_R (0x814C8)
#define C2FIFOCI5INV     PIC32_R (0x814CC)
#define C2FIFOCON6       PIC32_R (0x814D0)
#define C2FIFOCON6CLR    PIC32_R (0x814D4)
#define C2FIFOCON6SET    PIC32_R (0x814D8)
#define C2FIFOCON6INV    PIC32_R (0x814DC)
#define C2FIFOINT6       PIC32_R (0x814E0)
#define C2FIFOINT6CLR    PIC32_R (0x814E4)
#define C2FIFOINT6SET    PIC32_R (0x814E8)
#define C2FIFOINT6INV    PIC32_R (0x814EC)
#define C2FIFOUA6        PIC32_R (0x814F0)
#define C2FIFOUA6CLR     PIC32_R (0x814F4)
#define C2FIFOUA6SET     PIC32_R (0x814F8)
#define C2FIFOUA6INV     PIC32_R (0x814FC)
#define C2FIFOCI6        PIC32_R (0x81500)
#define C2FIFOCI6CLR     PIC32_R (0x81504)
#define C2FIFOCI6SET     PIC32_R (0x81508)
#define C2FIFOCI6INV     PIC32_R (0x8150C)
#define C2FIFOCON7       PIC32_R (0x81510)
#define C2FIFOCON7CLR    PIC32_R (0x81514)
#define C2FIFOCON7SET    PIC32_R (0x81518)
#define C2FIFOCON7INV    PIC32_R (0x8151C)
#define C2FIFOINT7       PIC32_R (0x81520)
#define C2FIFOINT7CLR    PIC32_R (0x81524)
#define C2FIFOINT7SET    PIC32_R (0x81528)
#define C2FIFOINT7INV    PIC32_R (0x8152C)
#define C2FIFOUA7        PIC32_R (0x81530)
#define C2FIFOUA7CLR     PIC32_R (0x81534)
#define C2FIFOUA7SET     PIC32_R (0x81538)
#define C2FIFOUA7INV     PIC32_R (0x8153C)
#define C2FIFOCI7        PIC32_R (0x81540)
#define C2FIFOCI7CLR     PIC32_R (0x81544)
#define C2FIFOCI7SET     PIC32_R (0x81548)
#define C2FIFOCI7INV     PIC32_R (0x8154C)
#define C2FIFOCON8       PIC32_R (0x81550)
#define C2FIFOCON8CLR    PIC32_R (0x81554)
#define C2FIFOCON8SET    PIC32_R (0x81558)
#define C2FIFOCON8INV    PIC32_R (0x8155C)
#define C2FIFOINT8       PIC32_R (0x81560)
#define C2FIFOINT8CLR    PIC32_R (0x81564)
#define C2FIFOINT8SET    PIC32_R (0x81568)
#define C2FIFOINT8INV    PIC32_R (0x8156C)
#define C2FIFOUA8        PIC32_R (0x81570)
#define C2FIFOUA8CLR     PIC32_R (0x81574)
#define C2FIFOUA8SET     PIC32_R (0x81578)
#define C2FIFOUA8INV     PIC32_R (0x8157C)
#define C2FIFOCI8        PIC32_R (0x81580)
#define C2FIFOCI8CLR     PIC32_R (0x81584)
#define C2FIFOCI8SET     PIC32_R (0x81588)
#define C2FIFOCI8INV     PIC32_R (0x8158C)
#define C2FIFOCON9       PIC32_R (0x81590)
#define C2FIFOCON9CLR    PIC32_R (0x81594)
#define C2FIFOCON9SET    PIC32_R (0x81598)
#define C2FIFOCON9INV    PIC32_R (0x8159C)
#define C2FIFOINT9       PIC32_R (0x815A0)
#define C2FIFOINT9CLR    PIC32_R (0x815A4)
#define C2FIFOINT9SET    PIC32_R (0x815A8)
#define C2FIFOINT9INV    PIC32_R (0x815AC)
#define C2FIFOUA9        PIC32_R (0x815B0)
#define C2FIFOUA9CLR     PIC32_R (0x815B4)
#define C2FIFOUA9SET     PIC32_R (0x815B8)
#define C2FIFOUA9INV     PIC32_R (0x815BC)
#define C2FIFOCI9        PIC32_R (0x815C0)
#define C2FIFOCI9CLR     PIC32_R (0x815C4)
#define C2FIFOCI9SET     PIC32_R (0x815C8)
#define C2FIFOCI9INV     PIC32_R (0x815CC)
#define C2FIFOCON10      PIC32_R (0x815D0)
#define C2FIFOCON10CLR   PIC32_R (0x815D4)
#define C2FIFOCON10SET   PIC32_R (0x815D8)
#define C2FIFOCON10INV   PIC32_R (0x815DC)
#define C2FIFOINT10      PIC32_R (0x815E0)
#define C2FIFOINT10CLR   PIC32_R (0x815E4)
#define C2FIFOINT10SET   PIC32_R (0x815E8)
#define C2FIFOINT10INV   PIC32_R (0x815EC)
#define C2FIFOUA10       PIC32_R (0x815F0)
#define C2FIFOUA10CLR    PIC32_R (0x815F4)
#define C2FIFOUA10SET    PIC32_R (0x815F8)
#define C2FIFOUA10INV    PIC32_R (0x815FC)
#define C2FIFOCI10       PIC32_R (0x81600)
#define C2FIFOCI10CLR    PIC32_R (0x81604)
#define C2FIFOCI10SET    PIC32_R (0x81608)
#define C2FIFOCI10INV    PIC32_R (0x8160C)
#define C2FIFOCON11      PIC32_R (0x81610)
#define C2FIFOCON11CLR   PIC32_R (0x81614)
