whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
#define C2FIFOCON11SET   PIC32_R (0x81618)
#define C2FIFOCON11INV   PIC32_R (0x8161C)
#define C2FIFOINT11      PIC32_R (0x81620)
#define C2FIFOINT11CLR   PIC32_R (0x81624)
#define C2FIFOINT11SET   PIC32_R (0x81628)
#define C2FIFOINT11INV   PIC32_R (0x8162C)
#define C2FIFOUA11       PIC32_R (0x81630)
#define C2FIFOUA11CLR    PIC32_R (0x81634)
#define C2FIFOUA11SET    PIC32_R (0x81638)
#define C2FIFOUA11INV    PIC32_R (0x8163C)
#define C2FIFOCI11       PIC32_R (0x81640)
#define C2FIFOCI11CLR    PIC32_R (0x81644)
#define C2FIFOCI11SET    PIC32_R (0x81648)
#define C2FIFOCI11INV    PIC32_R (0x8164C)
#define C2FIFOCON12      PIC32_R (0x81650)
#define C2FIFOCON12CLR   PIC32_R (0x81654)
#define C2FIFOCON12SET   PIC32_R (0x81658)
#define C2FIFOCON12INV   PIC32_R (0x8165C)
#define C2FIFOINT12      PIC32_R (0x81660)
#define C2FIFOINT12CLR   PIC32_R (0x81664)
#define C2FIFOINT12SET   PIC32_R (0x81668)
#define C2FIFOINT12INV   PIC32_R (0x8166C)
#define C2FIFOUA12       PIC32_R (0x81670)
#define C2FIFOUA12CLR    PIC32_R (0x81674)
#define C2FIFOUA12SET    PIC32_R (0x81678)
#define C2FIFOUA12INV    PIC32_R (0x8167C)
#define C2FIFOCI12       PIC32_R (0x81680)
#define C2FIFOCI12CLR    PIC32_R (0x81684)
#define C2FIFOCI12SET    PIC32_R (0x81688)
#define C2FIFOCI12INV    PIC32_R (0x8168C)
#define C2FIFOCON13      PIC32_R (0x81690)
#define C2FIFOCON13CLR   PIC32_R (0x81694)
#define C2FIFOCON13SET   PIC32_R (0x81698)
#define C2FIFOCON13INV   PIC32_R (0x8169C)
#define C2FIFOINT13      PIC32_R (0x816A0)
#define C2FIFOINT13CLR   PIC32_R (0x816A4)
#define C2FIFOINT13SET   PIC32_R (0x816A8)
#define C2FIFOINT13INV   PIC32_R (0x816AC)
#define C2FIFOUA13       PIC32_R (0x816B0)
#define C2FIFOUA13CLR    PIC32_R (0x816B4)
#define C2FIFOUA13SET    PIC32_R (0x816B8)
#define C2FIFOUA13INV    PIC32_R (0x816BC)
#define C2FIFOCI13       PIC32_R (0x816C0)
#define C2FIFOCI13CLR    PIC32_R (0x816C4)
#define C2FIFOCI13SET    PIC32_R (0x816C8)
#define C2FIFOCI13INV    PIC32_R (0x816CC)
#define C2FIFOCON14      PIC32_R (0x816D0)
#define C2FIFOCON14CLR   PIC32_R (0x816D4)
#define C2FIFOCON14SET   PIC32_R (0x816D8)
#define C2FIFOCON14INV   PIC32_R (0x816DC)
#define C2FIFOINT14      PIC32_R (0x816E0)
#define C2FIFOINT14CLR   PIC32_R (0x816E4)
#define C2FIFOINT14SET   PIC32_R (0x816E8)
#define C2FIFOINT14INV   PIC32_R (0x816EC)
#define C2FIFOUA14       PIC32_R (0x816F0)
#define C2FIFOUA14CLR    PIC32_R (0x816F4)
#define C2FIFOUA14SET    PIC32_R (0x816F8)
#define C2FIFOUA14INV    PIC32_R (0x816FC)
#define C2FIFOCI14       PIC32_R (0x81700)
#define C2FIFOCI14CLR    PIC32_R (0x81704)
#define C2FIFOCI14SET    PIC32_R (0x81708)
#define C2FIFOCI14INV    PIC32_R (0x8170C)
#define C2FIFOCON15      PIC32_R (0x81710)
#define C2FIFOCON15CLR   PIC32_R (0x81714)
#define C2FIFOCON15SET   PIC32_R (0x81718)
#define C2FIFOCON15INV   PIC32_R (0x8171C)
#define C2FIFOINT15      PIC32_R (0x81720)
#define C2FIFOINT15CLR   PIC32_R (0x81724)
#define C2FIFOINT15SET   PIC32_R (0x81728)
#define C2FIFOINT15INV   PIC32_R (0x8172C)
#define C2FIFOUA15       PIC32_R (0x81730)
#define C2FIFOUA15CLR    PIC32_R (0x81734)
#define C2FIFOUA15SET    PIC32_R (0x81738)
#define C2FIFOUA15INV    PIC32_R (0x8173C)
#define C2FIFOCI15       PIC32_R (0x81740)
#define C2FIFOCI15CLR    PIC32_R (0x81744)
#define C2FIFOCI15SET    PIC32_R (0x81748)
#define C2FIFOCI15INV    PIC32_R (0x8174C)
#define C2FIFOCON16      PIC32_R (0x81750)
#define C2FIFOCON16CLR   PIC32_R (0x81754)
#define C2FIFOCON16SET   PIC32_R (0x81758)
#define C2FIFOCON16INV   PIC32_R (0x8175C)
#define C2FIFOINT16      PIC32_R (0x81760)
#define C2FIFOINT16CLR   PIC32_R (0x81764)
#define C2FIFOINT16SET   PIC32_R (0x81768)
#define C2FIFOINT16INV   PIC32_R (0x8176C)
#define C2FIFOUA16       PIC32_R (0x81770)
#define C2FIFOUA16CLR    PIC32_R (0x81774)
#define C2FIFOUA16SET    PIC32_R (0x81778)
#define C2FIFOUA16INV    PIC32_R (0x8177C)
#define C2FIFOCI16       PIC32_R (0x81780)
#define C2FIFOCI16CLR    PIC32_R (0x81784)
#define C2FIFOCI16SET    PIC32_R (0x81788)
#define C2FIFOCI16INV    PIC32_R (0x8178C)
#define C2FIFOCON17      PIC32_R (0x81790)
#define C2FIFOCON17CLR   PIC32_R (0x81794)
#define C2FIFOCON17SET   PIC32_R (0x81798)
#define C2FIFOCON17INV   PIC32_R (0x8179C)
#define C2FIFOINT17      PIC32_R (0x817A0)
#define C2FIFOINT17CLR   PIC32_R (0x817A4)
#define C2FIFOINT17SET   PIC32_R (0x817A8)
#define C2FIFOINT17INV   PIC32_R (0x817AC)
#define C2FIFOUA17       PIC32_R (0x817B0)
#define C2FIFOUA17CLR    PIC32_R (0x817B4)
#define C2FIFOUA17SET    PIC32_R (0x817B8)
#define C2FIFOUA17INV    PIC32_R (0x817BC)
#define C2FIFOCI17       PIC32_R (0x817C0)
#define C2FIFOCI17CLR    PIC32_R (0x817C4)
#define C2FIFOCI17SET    PIC32_R (0x817C8)
#define C2FIFOCI17INV    PIC32_R (0x817CC)
#define C2FIFOCON18      PIC32_R (0x817D0)
#define C2FIFOCON18CLR   PIC32_R (0x817D4)
#define C2FIFOCON18SET   PIC32_R (0x817D8)
#define C2FIFOCON18INV   PIC32_R (0x817DC)
#define C2FIFOINT18      PIC32_R (0x817E0)
#define C2FIFOINT18CLR   PIC32_R (0x817E4)
#define C2FIFOINT18SET   PIC32_R (0x817E8)
#define C2FIFOINT18INV   PIC32_R (0x817EC)
#define C2FIFOUA18       PIC32_R (0x817F0)
#define C2FIFOUA18CLR    PIC32_R (0x817F4)
#define C2FIFOUA18SET    PIC32_R (0x817F8)
#define C2FIFOUA18INV    PIC32_R (0x817FC)
#define C2FIFOCI18       PIC32_R (0x81800)
#define C2FIFOCI18CLR    PIC32_R (0x81804)
#define C2FIFOCI18SET    PIC32_R (0x81808)
#define C2FIFOCI18INV    PIC32_R (0x8180C)
#define C2FIFOCON19      PIC32_R (0x81810)
#define C2FIFOCON19CLR   PIC32_R (0x81814)
#define C2FIFOCON19SET   PIC32_R (0x81818)
#define C2FIFOCON19INV   PIC32_R (0x8181C)
#define C2FIFOINT19      PIC32_R (0x81820)
#define C2FIFOINT19CLR   PIC32_R (0x81824)
#define C2FIFOINT19SET   PIC32_R (0x81828)
#define C2FIFOINT19INV   PIC32_R (0x8182C)
#define C2FIFOUA19       PIC32_R (0x81830)
#define C2FIFOUA19CLR    PIC32_R (0x81834)
#define C2FIFOUA19SET    PIC32_R (0x81838)
#define C2FIFOUA19INV    PIC32_R (0x8183C)
#define C2FIFOCI19       PIC32_R (0x81840)
#define C2FIFOCI19CLR    PIC32_R (0x81844)
#define C2FIFOCI19SET    PIC32_R (0x81848)
#define C2FIFOCI19INV    PIC32_R (0x8184C)
#define C2FIFOCON20      PIC32_R (0x81850)
#define C2FIFOCON20CLR   PIC32_R (0x81854)
#define C2FIFOCON20SET   PIC32_R (0x81858)
#define C2FIFOCON20INV   PIC32_R (0x8185C)
#define C2FIFOINT20      PIC32_R (0x81860)
#define C2FIFOINT20CLR   PIC32_R (0x81864)
#define C2FIFOINT20SET   PIC32_R (0x81868)
#define C2FIFOINT20INV   PIC32_R (0x8186C)
#define C2FIFOUA20       PIC32_R (0x81870)
#define C2FIFOUA20CLR    PIC32_R (0x81874)
#define C2FIFOUA20SET    PIC32_R (0x81878)
#define C2FIFOUA20INV    PIC32_R (0x8187C)
#define C2FIFOCI20       PIC32_R (0x81880)
#define C2FIFOCI20CLR    PIC32_R (0x81884)
#define C2FIFOCI20SET    PIC32_R (0x81888)
#define C2FIFOCI20INV    PIC32_R (0x8188C)
#define C2FIFOCON21      PIC32_R (0x81890)
#define C2FIFOCON21CLR   PIC32_R (0x81894)
#define C2FIFOCON21SET   PIC32_R (0x81898)
#define C2FIFOCON21INV   PIC32_R (0x8189C)
#define C2FIFOINT21      PIC32_R (0x818A0)
#define C2FIFOINT21CLR   PIC32_R (0x818A4)
#define C2FIFOINT21SET   PIC32_R (0x818A8)
#define C2FIFOINT21INV   PIC32_R (0x818AC)
#define C2FIFOUA21       PIC32_R (0x818B0)
#define C2FIFOUA21CLR    PIC32_R (0x818B4)
#define C2FIFOUA21SET    PIC32_R (0x818B8)
#define C2FIFOUA21INV    PIC32_R (0x818BC)
#define C2FIFOCI21       PIC32_R (0x818C0)
#define C2FIFOCI21CLR    PIC32_R (0x818C4)
#define C2FIFOCI21SET    PIC32_R (0x818C8)
#define C2FIFOCI21INV    PIC32_R (0x818CC)
#define C2FIFOCON22      PIC32_R (0x818D0)
#define C2FIFOCON22CLR   PIC32_R (0x818D4)
#define C2FIFOCON22SET   PIC32_R (0x818D8)
#define C2FIFOCON22INV   PIC32_R (0x818DC)
#define C2FIFOINT22      PIC32_R (0x818E0)
#define C2FIFOINT22CLR   PIC32_R (0x818E4)
#define C2FIFOINT22SET   PIC32_R (0x818E8)
#define C2FIFOINT22INV   PIC32_R (0x818EC)
#define C2FIFOUA22       PIC32_R (0x818F0)
#define C2FIFOUA22CLR    PIC32_R (0x818F4)
#define C2FIFOUA22SET    PIC32_R (0x818F8)
#define C2FIFOUA22INV    PIC32_R (0x818FC)
#define C2FIFOCI22       PIC32_R (0x81900)
#define C2FIFOCI22CLR    PIC32_R (0x81904)
#define C2FIFOCI22SET    PIC32_R (0x81908)
#define C2FIFOCI22INV    PIC32_R (0x8190C)
#define C2FIFOCON23      PIC32_R (0x81910)
#define C2FIFOCON23CLR   PIC32_R (0x81914)
#define C2FIFOCON23SET   PIC32_R (0x81918)
#define C2FIFOCON23INV   PIC32_R (0x8191C)
#define C2FIFOINT23      PIC32_R (0x81920)
#define C2FIFOINT23CLR   PIC32_R (0x81924)
#define C2FIFOINT23SET   PIC32_R (0x81928)
#define C2FIFOINT23INV   PIC32_R (0x8192C)
#define C2FIFOUA23       PIC32_R (0x81930)
#define C2FIFOUA23CLR    PIC32_R (0x81934)
#define C2FIFOUA23SET    PIC32_R (0x81938)
#define C2FIFOUA23INV    PIC32_R (0x8193C)
#define C2FIFOCI23       PIC32_R (0x81940)
#define C2FIFOCI23CLR    PIC32_R (0x81944)
#define C2FIFOCI23SET    PIC32_R (0x81948)
#define C2FIFOCI23INV    PIC32_R (0x8194C)
#define C2FIFOCON24      PIC32_R (0x81950)
#define C2FIFOCON24CLR   PIC32_R (0x81954)
#define C2FIFOCON24SET   PIC32_R (0x81958)
#define C2FIFOCON24INV   PIC32_R (0x8195C)
#define C2FIFOINT24      PIC32_R (0x81960)
#define C2FIFOINT24CLR   PIC32_R (0x81964)
#define C2FIFOINT24SET   PIC32_R (0x81968)
#define C2FIFOINT24INV   PIC32_R (0x8196C)
#define C2FIFOUA24       PIC32_R (0x81970)
#define C2FIFOUA24CLR    PIC32_R (0x81974)
#define C2FIFOUA24SET    PIC32_R (0x81978)
#define C2FIFOUA24INV    PIC32_R (0x8197C)
#define C2FIFOCI24       PIC32_R (0x81980)
#define C2FIFOCI24CLR    PIC32_R (0x81984)
#define C2FIFOCI24SET    PIC32_R (0x81988)
#define C2FIFOCI24INV    PIC32_R (0x8198C)
#define C2FIFOCON25      PIC32_R (0x81990)
#define C2FIFOCON25CLR   PIC32_R (0x81994)
#define C2FIFOCON25SET   PIC32_R (0x81998)
#define C2FIFOCON25INV   PIC32_R (0x8199C)
#define C2FIFOINT25      PIC32_R (0x819A0)
#define C2FIFOINT25CLR   PIC32_R (0x819A4)
#define C2FIFOINT25SET   PIC32_R (0x819A8)
#define C2FIFOINT25INV   PIC32_R (0x819AC)
#define C2FIFOUA25       PIC32_R (0x819B0)
#define C2FIFOUA25CLR    PIC32_R (0x819B4)
#define C2FIFOUA25SET    PIC32_R (0x819B8)
#define C2FIFOUA25INV    PIC32_R (0x819BC)
#define C2FIFOCI25       PIC32_R (0x819C0)
#define C2FIFOCI25CLR    PIC32_R (0x819C4)
#define C2FIFOCI25SET    PIC32_R (0x819C8)
#define C2FIFOCI25INV    PIC32_R (0x819CC)
#define C2FIFOCON26      PIC32_R (0x819D0)
#define C2FIFOCON26CLR   PIC32_R (0x819D4)
#define C2FIFOCON26SET   PIC32_R (0x819D8)
#define C2FIFOCON26INV   PIC32_R (0x819DC)
#define C2FIFOINT26      PIC32_R (0x819E0)
#define C2FIFOINT26CLR   PIC32_R (0x819E4)
#define C2FIFOINT26SET   PIC32_R (0x819E8)
#define C2FIFOINT26INV   PIC32_R (0x819EC)
#define C2FIFOUA26       PIC32_R (0x819F0)
#define C2FIFOUA26CLR    PIC32_R (0x819F4)
#define C2FIFOUA26SET    PIC32_R (0x819F8)
#define C2FIFOUA26INV    PIC32_R (0x819FC)
#define C2FIFOCI26       PIC32_R (0x81A00)
#define C2FIFOCI26CLR    PIC32_R (0x81A04)
#define C2FIFOCI26SET    PIC32_R (0x81A08)
#define C2FIFOCI26INV    PIC32_R (0x81A0C)
#define C2FIFOCON27      PIC32_R (0x81A10)
#define C2FIFOCON27CLR   PIC32_R (0x81A14)
#define C2FIFOCON27SET   PIC32_R (0x81A18)
#define C2FIFOCON27INV   PIC32_R (0x81A1C)
#define C2FIFOINT27      PIC32_R (0x81A20)
#define C2FIFOINT27CLR   PIC32_R (0x81A24)
#define C2FIFOINT27SET   PIC32_R (0x81A28)
#define C2FIFOINT27INV   PIC32_R (0x81A2C)
#define C2FIFOUA27       PIC32_R (0x81A30)
#define C2FIFOUA27CLR    PIC32_R (0x81A34)
#define C2FIFOUA27SET    PIC32_R (0x81A38)
#define C2FIFOUA27INV    PIC32_R (0x81A3C)
#define C2FIFOCI27       PIC32_R (0x81A40)
#define C2FIFOCI27CLR    PIC32_R (0x81A44)
#define C2FIFOCI27SET    PIC32_R (0x81A48)
#define C2FIFOCI27INV    PIC32_R (0x81A4C)
#define C2FIFOCON28      PIC32_R (0x81A50)
#define C2FIFOCON28CLR   PIC32_R (0x81A54)
#define C2FIFOCON28SET   PIC32_R (0x81A58)
#define C2FIFOCON28INV   PIC32_R (0x81A5C)
#define C2FIFOINT28      PIC32_R (0x81A60)
#define C2FIFOINT28CLR   PIC32_R (0x81A64)
#define C2FIFOINT28SET   PIC32_R (0x81A68)
#define C2FIFOINT28INV   PIC32_R (0x81A6C)
#define C2FIFOUA28       PIC32_R (0x81A70)
#define C2FIFOUA28CLR    PIC32_R (0x81A74)
#define C2FIFOUA28SET    PIC32_R (0x81A78)
#define C2FIFOUA28INV    PIC32_R (0x81A7C)
#define C2FIFOCI28       PIC32_R (0x81A80)
#define C2FIFOCI28CLR    PIC32_R (0x81A84)
#define C2FIFOCI28SET    PIC32_R (0x81A88)
#define C2FIFOCI28INV    PIC32_R (0x81A8C)
#define C2FIFOCON29      PIC32_R (0x81A90)
#define C2FIFOCON29CLR   PIC32_R (0x81A94)
#define C2FIFOCON29SET   PIC32_R (0x81A98)
#define C2FIFOCON29INV   PIC32_R (0x81A9C)
#define C2FIFOINT29      PIC32_R (0x81AA0)
#define C2FIFOINT29CLR   PIC32_R (0x81AA4)
#define C2FIFOINT29SET   PIC32_R (0x81AA8)
#define C2FIFOINT29INV   PIC32_R (0x81AAC)
#define C2FIFOUA29       PIC32_R (0x81AB0)
#define C2FIFOUA29CLR    PIC32_R (0x81AB4)
#define C2FIFOUA29SET    PIC32_R (0x81AB8)
#define C2FIFOUA29INV    PIC32_R (0x81ABC)
#define C2FIFOCI29       PIC32_R (0x81AC0)
#define C2FIFOCI29CLR    PIC32_R (0x81AC4)
#define C2FIFOCI29SET    PIC32_R (0x81AC8)
#define C2FIFOCI29INV    PIC32_R (0x81ACC)
#define C2FIFOCON30      PIC32_R (0x81AD0)
#define C2FIFOCON30CLR   PIC32_R (0x81AD4)
#define C2FIFOCON30SET   PIC32_R (0x81AD8)
#define C2FIFOCON30INV   PIC32_R (0x81ADC)
#define C2FIFOINT30      PIC32_R (0x81AE0)
#define C2FIFOINT30CLR   PIC32_R (0x81AE4)
#define C2FIFOINT30SET   PIC32_R (0x81AE8)
#define C2FIFOINT30INV   PIC32_R (0x81AEC)
#define C2FIFOUA30       PIC32_R (0x81AF0)
#define C2FIFOUA30CLR    PIC32_R (0x81AF4)
#define C2FIFOUA30SET    PIC32_R (0x81AF8)
#define C2FIFOUA30INV    PIC32_R (0x81AFC)
#define C2FIFOCI30       PIC32_R (0x81B00)
#define C2FIFOCI30CLR    PIC32_R (0x81B04)
#define C2FIFOCI30SET    PIC32_R (0x81B08)
#define C2FIFOCI30INV    PIC32_R (0x81B0C)
#define C2FIFOCON31      PIC32_R (0x81B10)
#define C2FIFOCON31CLR   PIC32_R (0x81B14)
#define C2FIFOCON31SET   PIC32_R (0x81B18)
#define C2FIFOCON31INV   PIC32_R (0x81B1C)
#define C2FIFOINT31      PIC32_R (0x81B20)
#define C2FIFOINT31CLR   PIC32_R (0x81B24)
#define C2FIFOINT31SET   PIC32_R (0x81B28)
#define C2FIFOINT31INV   PIC32_R (0x81B2C)
#define C2FIFOUA31       PIC32_R (0x81B30)
#define C2FIFOUA31CLR    PIC32_R (0x81B34)
#define C2FIFOUA31SET    PIC32_R (0x81B38)
#define C2FIFOUA31INV    PIC32_R (0x81B3C)
#define C2FIFOCI31       PIC32_R (0x81B40)
#define C2FIFOCI31CLR    PIC32_R (0x81B44)
#define C2FIFOCI31SET    PIC32_R (0x81B48)
#define C2FIFOCI31INV    PIC32_R (0x81B4C)
		
