whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*--------------------------------------
 * Ethernet registers.
 */
#define ETHCON1         PIC32_R (0x82000)   /* Control 1 */
#define ETHCON1CLR      PIC32_R (0x82004)
#define ETHCON1SET      PIC32_R (0x82008)
#define ETHCON1INV      PIC32_R (0x8200c)
#define ETHCON2         PIC32_R (0x82010)   /* Control 2: RX data buffer size */
#define ETHTXST         PIC32_R (0x82020)   /* Tx descriptor start address */
#define ETHRXST         PIC32_R (0x82030)   /* Rx descriptor start address */
#define ETHHT0          PIC32_R (0x82040)   /* Hash tasble 0 */
#define ETHHT1          PIC32_R (0x82050)   /* Hash tasble 1 */
#define ETHPMM0         PIC32_R (0x82060)   /* Pattern match mask 0 */
#define ETHPMM1         PIC32_R (0x82070)   /* Pattern match mask 1 */
#define ETHPMCS         PIC32_R (0x82080)   /* Pattern match checksum */
#define ETHPMO          PIC32_R (0x82090)   /* Pattern match offset */
#define ETHRXFC         PIC32_R (0x820a0)   /* Receive filter configuration */
#define ETHRXWM         PIC32_R (0x820b0)   /* Receive watermarks */
#define ETHIEN          PIC32_R (0x820c0)   /* Interrupt enable */
#define ETHIENCLR       PIC32_R (0x820c4)
#define ETHIENSET       PIC32_R (0x820c8)
#define ETHIENINV       PIC32_R (0x820cc)
#define ETHIRQ          PIC32_R (0x820d0)   /* Interrupt request */
#define ETHIRQCLR       PIC32_R (0x820d4)
#define ETHIRQSET       PIC32_R (0x820d8)
#define ETHIRQINV       PIC32_R (0x820dc)
#define ETHSTAT         PIC32_R (0x820e0)   /* Status */
#define ETHRXOVFLOW     PIC32_R (0x82100)   /* Receive overflow statistics */
#define ETHFRMTXOK      PIC32_R (0x82110)   /* Frames transmitted OK statistics */
#define ETHSCOLFRM      PIC32_R (0x82120)   /* Single collision frames statistics */
#define ETHMCOLFRM      PIC32_R (0x82130)   /* Multiple collision frames statistics */
#define ETHFRMRXOK      PIC32_R (0x82140)   /* Frames received OK statistics */
#define ETHFCSERR       PIC32_R (0x82150)   /* Frame check sequence error statistics */
#define ETHALGNERR      PIC32_R (0x82160)   /* Alignment errors statistics */
#define EMAC1CFG1       PIC32_R (0x82200)   /* MAC configuration 1 */
#define EMAC1CFG2       PIC32_R (0x82210)   /* MAC configuration 2 */
#define EMAC1CFG2CLR    PIC32_R (0x82214)
#define EMAC1CFG2SET    PIC32_R (0x82218)
#define EMAC1CFG2INV    PIC32_R (0x8221c)
#define EMAC1IPGT       PIC32_R (0x82220)   /* MAC back-to-back interpacket gap */
#define EMAC1IPGR       PIC32_R (0x82230)   /* MAC non-back-to-back interpacket gap */
#define EMAC1CLRT       PIC32_R (0x82240)   /* MAC collision window/retry limit */
#define EMAC1MAXF       PIC32_R (0x82250)   /* MAC maximum frame length */
#define EMAC1SUPP       PIC32_R (0x82260)   /* MAC PHY support */
#define EMAC1SUPPCLR    PIC32_R (0x82264)
#define EMAC1SUPPSET    PIC32_R (0x82268)
#define EMAC1SUPPINV    PIC32_R (0x8226c)
#define EMAC1TEST       PIC32_R (0x82270)   /* MAC test */
#define EMAC1MCFG       PIC32_R (0x82280)   /* MII configuration */
#define EMAC1MCMD       PIC32_R (0x82290)   /* MII command */
#define EMAC1MCMDCLR    PIC32_R (0x82294)
#define EMAC1MCMDSET    PIC32_R (0x82298)
#define EMAC1MCMDINV    PIC32_R (0x8229c)
#define EMAC1MADR       PIC32_R (0x822a0)   /* MII address */
#define EMAC1MWTD       PIC32_R (0x822b0)   /* MII write data */
#define EMAC1MRDD       PIC32_R (0x822c0)   /* MII read data */
#define EMAC1MIND       PIC32_R (0x822d0)   /* MII indicators */
#define EMAC1SA0        PIC32_R (0x82300)   /* MAC station address 0 */
#define EMAC1SA1        PIC32_R (0x82310)   /* MAC station address 1 */
#define EMAC1SA2        PIC32_R (0x82320)   /* MAC station address 2 */

/*
 * Ethernet Control register 1.
 */
#define PIC32_ETHCON1_PTV(n)    ((n)<<16)   /* Pause timer value */
#define PIC32_ETHCON1_ON            0x8000  /* Ethernet module enabled */
#define PIC32_ETHCON1_SIDL          0x2000  /* Stop in idle mode */
#define PIC32_ETHCON1_TXRTS         0x0200  /* Transmit request to send */
#define PIC32_ETHCON1_RXEN          0x0100  /* Receive enable */
#define PIC32_ETHCON1_AUTOFC        0x0080  /* Automatic flow control */
#define PIC32_ETHCON1_MANFC         0x0010  /* Manual flow control */
#define PIC32_ETHCON1_BUFCDEC       0x0001  /* Descriptor buffer count decrement */

/*
 * Ethernet Receive Filter Configuration register.
 */
#define PIC32_ETHRXFC_HTEN          0x8000  /* Enable hash table filtering */
#define PIC32_ETHRXFC_MPEN          0x4000  /* Enable Magic Packet filtering */
#define PIC32_ETHRXFC_NOTPM         0x1000  /* Pattern match inversion */
#define PIC32_ETHRXFC_PMMODE_MAGIC  0x0900  /* Packet = magic */
#define PIC32_ETHRXFC_PMMODE_HT     0x0800  /* Hash table filter match */
#define PIC32_ETHRXFC_PMMODE_BCAST  0x0600  /* Destination = broadcast address */
#define PIC32_ETHRXFC_PMMODE_UCAST  0x0400  /* Destination = unicast address */
#define PIC32_ETHRXFC_PMMODE_STN    0x0200  /* Destination = station address */
#define PIC32_ETHRXFC_PMMODE_CSUM   0x0100  /* Successful if checksum matches */
#define PIC32_ETHRXFC_CRCERREN      0x0080  /* CRC error collection enable */
#define PIC32_ETHRXFC_CRCOKEN       0x0040  /* CRC OK enable */
#define PIC32_ETHRXFC_RUNTERREN     0x0020  /* Runt error collection enable */
#define PIC32_ETHRXFC_RUNTEN        0x0010  /* Runt filter enable */
#define PIC32_ETHRXFC_UCEN          0x0008  /* Unicast filter enable */
#define PIC32_ETHRXFC_NOTMEEN       0x0004  /* Not Me unicast enable */
#define PIC32_ETHRXFC_MCEN          0x0002  /* Multicast filter enable */
#define PIC32_ETHRXFC_BCEN          0x0001  /* Broadcast filter enable */

/*
 * Ethernet Receive Watermarks register.
 */
#define PIC32_ETHRXWM_FWM(n)    ((n)<<16)   /* Receive Full Watermark */
#define PIC32_ETHRXWM_EWM(n)    (n)         /* Receive Empty Watermark */

/*
 * Ethernet Interrupt Request register.
 */
#define PIC32_ETHIRQ_TXBUSE         0x4000  /* Transmit Bus Error */
#define PIC32_ETHIRQ_RXBUSE         0x2000  /* Receive Bus Error */
#define PIC32_ETHIRQ_EWMARK         0x0200  /* Empty Watermark */
#define PIC32_ETHIRQ_FWMARK         0x0100  /* Full Watermark */
#define PIC32_ETHIRQ_RXDONE         0x0080  /* Receive Done */
#define PIC32_ETHIRQ_PKTPEND        0x0040  /* Packet Pending */
#define PIC32_ETHIRQ_RXACT          0x0020  /* Receive Activity */
#define PIC32_ETHIRQ_TXDONE         0x0008  /* Transmit Done */
#define PIC32_ETHIRQ_TXABORT        0x0004  /* Transmitter Abort */
#define PIC32_ETHIRQ_RXBUFNA        0x0002  /* Receive Buffer Not Available */
#define PIC32_ETHIRQ_RXOVFLW        0x0001  /* Receive FIFO Overflow */

