whitecatboard/Lua-RTOS-ESP32/include/platform/pic32mz/machine/pic32mz.h
/*
 * Interrupt Control register.
 */
#define PIC32_INTCON_INT0EP     0x00000001  /* External interrupt 0 polarity rising edge */
#define PIC32_INTCON_INT1EP     0x00000002  /* External interrupt 1 polarity rising edge */
#define PIC32_INTCON_INT2EP     0x00000004  /* External interrupt 2 polarity rising edge */
#define PIC32_INTCON_INT3EP     0x00000008  /* External interrupt 3 polarity rising edge */
#define PIC32_INTCON_INT4EP     0x00000010  /* External interrupt 4 polarity rising edge */
#define PIC32_INTCON_TPC(x)     ((x)<<8)    /* Temporal proximity group priority */
#define PIC32_INTCON_MVEC       0x00001000  /* Multi-vectored mode */
#define PIC32_INTCON_SS0        0x00010000  /* Single vector has a shadow register set */
#define PIC32_INTCON_VS(x)      ((x)<<16)   /* Temporal proximity group priority */

/*
 * Interrupt Status register.
 */
#define PIC32_INTSTAT_VEC(s)    ((s) & 0xff)    /* Interrupt vector */
#define PIC32_INTSTAT_SRIPL(s)  ((s) >> 8 & 7)  /* Requested priority level */
#define PIC32_INTSTAT_SRIPL_MASK 0x0700

/*
 * Interrupt Prority Control register.
 */
#define PIC32_IPC_IP(a,b,c,d)   ((a)<<2 | (b)<<10 | (c)<<18 | (d)<<26)  /* Priority */
#define PIC32_IPC_IS(a,b,c,d)   ((a) | (b)<<8 | (c)<<16 | (d)<<24)      /* Subpriority */

/*
 * IRQ numbers for PIC32MZ
 */
#define PIC32_IRQ_CT        0   /* Core Timer Interrupt */
#define PIC32_IRQ_CS0       1   /* Core Software Interrupt 0 */
#define PIC32_IRQ_CS1       2   /* Core Software Interrupt 1 */
#define PIC32_IRQ_INT0      3   /* External Interrupt 0 */
#define PIC32_IRQ_T1        4   /* Timer1 */
#define PIC32_IRQ_IC1E      5   /* Input Capture 1 Error */
#define PIC32_IRQ_IC1       6   /* Input Capture 1 */
#define PIC32_IRQ_OC1       7   /* Output Compare 1 */
#define PIC32_IRQ_INT1      8   /* External Interrupt 1 */
#define PIC32_IRQ_T2        9   /* Timer2 */
#define PIC32_IRQ_IC2E      10  /* Input Capture 2 Error */
#define PIC32_IRQ_IC2       11  /* Input Capture 2 */
#define PIC32_IRQ_OC2       12  /* Output Compare 2 */
#define PIC32_IRQ_INT2      13  /* External Interrupt 2 */
#define PIC32_IRQ_T3        14  /* Timer3 */
#define PIC32_IRQ_IC3E      15  /* Input Capture 3 Error */
#define PIC32_IRQ_IC3       16  /* Input Capture 3 */
#define PIC32_IRQ_OC3       17  /* Output Compare 3 */
#define PIC32_IRQ_INT3      18  /* External Interrupt 3 */
#define PIC32_IRQ_T4        19  /* Timer4 */
#define PIC32_IRQ_IC4E      20  /* Input Capture 4 Error */
#define PIC32_IRQ_IC4       21  /* Input Capture 4 */
#define PIC32_IRQ_OC4       22  /* Output Compare 4 */
#define PIC32_IRQ_INT4      23  /* External Interrupt 4 */
#define PIC32_IRQ_T5        24  /* Timer5 */
#define PIC32_IRQ_IC5E      25  /* Input Capture 5 Error */
#define PIC32_IRQ_IC5       26  /* Input Capture 5 */
#define PIC32_IRQ_OC5       27  /* Output Compare 5 */
#define PIC32_IRQ_T6        28  /* Timer6 */
#define PIC32_IRQ_IC6E      29  /* Input Capture 6 Error */
#define PIC32_IRQ_IC6       30  /* Input Capture 6 */
#define PIC32_IRQ_OC6       31  /* Output Compare 6 */
#define PIC32_IRQ_T7        32  /* Timer7 */
#define PIC32_IRQ_IC7E      33  /* Input Capture 7 Error */
#define PIC32_IRQ_IC7       34  /* Input Capture 7 */
#define PIC32_IRQ_OC7       35  /* Output Compare 7 */
#define PIC32_IRQ_T8        36  /* Timer8 */
#define PIC32_IRQ_IC8E      37  /* Input Capture 8 Error */
#define PIC32_IRQ_IC8       38  /* Input Capture 8 */
#define PIC32_IRQ_OC8       39  /* Output Compare 8 */
#define PIC32_IRQ_T9        40  /* Timer9 */
#define PIC32_IRQ_IC9E      41  /* Input Capture 9 Error */
#define PIC32_IRQ_IC9       42  /* Input Capture 9 */
#define PIC32_IRQ_OC9       43  /* Output Compare 9 */
#define PIC32_IRQ_AD1       44  /* ADC1 Global Interrupt */
                         /* 45  -- Reserved */
#define PIC32_IRQ_AD1DC1    46  /* ADC1 Digital Comparator 1 */
#define PIC32_IRQ_AD1DC2    47  /* ADC1 Digital Comparator 2 */
#define PIC32_IRQ_AD1DC3    48  /* ADC1 Digital Comparator 3 */
#define PIC32_IRQ_AD1DC4    49  /* ADC1 Digital Comparator 4 */
#define PIC32_IRQ_AD1DC5    50  /* ADC1 Digital Comparator 5 */
#define PIC32_IRQ_AD1DC6    51  /* ADC1 Digital Comparator 6 */
#define PIC32_IRQ_AD1DF1    52  /* ADC1 Digital Filter 1 */
#define PIC32_IRQ_AD1DF2    53  /* ADC1 Digital Filter 2 */
#define PIC32_IRQ_AD1DF3    54  /* ADC1 Digital Filter 3 */
#define PIC32_IRQ_AD1DF4    55  /* ADC1 Digital Filter 4 */
#define PIC32_IRQ_AD1DF5    56  /* ADC1 Digital Filter 5 */
#define PIC32_IRQ_AD1DF6    57  /* ADC1 Digital Filter 6 */
                         /* 58  -- Reserved */
#define PIC32_IRQ_AD1D0     59  /* ADC1 Data 0 */
#define PIC32_IRQ_AD1D1     60  /* ADC1 Data 1 */
#define PIC32_IRQ_AD1D2     61  /* ADC1 Data 2 */
#define PIC32_IRQ_AD1D3     62  /* ADC1 Data 3 */
#define PIC32_IRQ_AD1D4     63  /* ADC1 Data 4 */
#define PIC32_IRQ_AD1D5     64  /* ADC1 Data 5 */
#define PIC32_IRQ_AD1D6     65  /* ADC1 Data 6 */
#define PIC32_IRQ_AD1D7     66  /* ADC1 Data 7 */
#define PIC32_IRQ_AD1D8     67  /* ADC1 Data 8 */
#define PIC32_IRQ_AD1D9     68  /* ADC1 Data 9 */
#define PIC32_IRQ_AD1D10    69  /* ADC1 Data 10 */
#define PIC32_IRQ_AD1D11    70  /* ADC1 Data 11 */
#define PIC32_IRQ_AD1D12    71  /* ADC1 Data 12 */
#define PIC32_IRQ_AD1D13    72  /* ADC1 Data 13 */
#define PIC32_IRQ_AD1D14    73  /* ADC1 Data 14 */
#define PIC32_IRQ_AD1D15    74  /* ADC1 Data 15 */
#define PIC32_IRQ_AD1D16    75  /* ADC1 Data 16 */
#define PIC32_IRQ_AD1D17    76  /* ADC1 Data 17 */
#define PIC32_IRQ_AD1D18    77  /* ADC1 Data 18 */
#define PIC32_IRQ_AD1D19    78  /* ADC1 Data 19 */
#define PIC32_IRQ_AD1D20    79  /* ADC1 Data 20 */
#define PIC32_IRQ_AD1D21    80  /* ADC1 Data 21 */
#define PIC32_IRQ_AD1D22    81  /* ADC1 Data 22 */
#define PIC32_IRQ_AD1D23    82  /* ADC1 Data 23 */
#define PIC32_IRQ_AD1D24    83  /* ADC1 Data 24 */
#define PIC32_IRQ_AD1D25    84  /* ADC1 Data 25 */
#define PIC32_IRQ_AD1D26    85  /* ADC1 Data 26 */
#define PIC32_IRQ_AD1D27    86  /* ADC1 Data 27 */
#define PIC32_IRQ_AD1D28    87  /* ADC1 Data 28 */
#define PIC32_IRQ_AD1D29    88  /* ADC1 Data 29 */
#define PIC32_IRQ_AD1D30    89  /* ADC1 Data 30 */
#define PIC32_IRQ_AD1D31    90  /* ADC1 Data 31 */
#define PIC32_IRQ_AD1D32    91  /* ADC1 Data 32 */
#define PIC32_IRQ_AD1D33    92  /* ADC1 Data 33 */
#define PIC32_IRQ_AD1D34    93  /* ADC1 Data 34 */
#define PIC32_IRQ_AD1D35    94  /* ADC1 Data 35 */
#define PIC32_IRQ_AD1D36    95  /* ADC1 Data 36 */
#define PIC32_IRQ_AD1D37    96  /* ADC1 Data 37 */
#define PIC32_IRQ_AD1D38    97  /* ADC1 Data 38 */
#define PIC32_IRQ_AD1D39    98  /* ADC1 Data 39 */
#define PIC32_IRQ_AD1D40    99  /* ADC1 Data 40 */
#define PIC32_IRQ_AD1D41    100 /* ADC1 Data 41 */
#define PIC32_IRQ_AD1D42    101 /* ADC1 Data 42 */
#define PIC32_IRQ_AD1D43    102 /* ADC1 Data 43 */
#define PIC32_IRQ_AD1D44    103 /* ADC1 Data 44 */
#define PIC32_IRQ_CPC       104 /* Core Performance Counter */
#define PIC32_IRQ_CFDC      105 /* Core Fast Debug Channel */
#define PIC32_IRQ_SB        106 /* System Bus Protection Violation */
#define PIC32_IRQ_CRPT      107 /* Crypto Engine Event */
                         /* 108 -- Reserved */
#define PIC32_IRQ_SPI1E     109 /* SPI1 Fault */
#define PIC32_IRQ_SPI1RX    110 /* SPI1 Receive Done */
#define PIC32_IRQ_SPI1TX    111 /* SPI1 Transfer Done */
#define PIC32_IRQ_U1E       112 /* UART1 Fault */
#define PIC32_IRQ_U1RX      113 /* UART1 Receive Done */
#define PIC32_IRQ_U1TX      114 /* UART1 Transfer Done */
#define PIC32_IRQ_I2C1B     115 /* I2C1 Bus Collision Event */
#define PIC32_IRQ_I2C1S     116 /* I2C1 Slave Event */
#define PIC32_IRQ_I2C1M     117 /* I2C1 Master Event */
#define PIC32_IRQ_CNA       118 /* PORTA Input Change Interrupt */
#define PIC32_IRQ_CNB       119 /* PORTB Input Change Interrupt */
#define PIC32_IRQ_CNC       120 /* PORTC Input Change Interrupt */
#define PIC32_IRQ_CND       121 /* PORTD Input Change Interrupt */
#define PIC32_IRQ_CNE       122 /* PORTE Input Change Interrupt */
#define PIC32_IRQ_CNF       123 /* PORTF Input Change Interrupt */
#define PIC32_IRQ_CNG       124 /* PORTG Input Change Interrupt */
#define PIC32_IRQ_CNH       125 /* PORTH Input Change Interrupt */
#define PIC32_IRQ_CNJ       126 /* PORTJ Input Change Interrupt */
#define PIC32_IRQ_CNK       127 /* PORTK Input Change Interrupt */
#define PIC32_IRQ_PMP       128 /* Parallel Master Port */
#define PIC32_IRQ_PMPE      129 /* Parallel Master Port Error */
#define PIC32_IRQ_CMP1      130 /* Comparator 1 Interrupt */
#define PIC32_IRQ_CMP2      131 /* Comparator 2 Interrupt */
#define PIC32_IRQ_USB       132 /* USB General Event */
#define PIC32_IRQ_USBDMA    133 /* USB DMA Event */
#define PIC32_IRQ_DMA0      134 /* DMA Channel 0 */
#define PIC32_IRQ_DMA1      135 /* DMA Channel 1 */
#define PIC32_IRQ_DMA2      136 /* DMA Channel 2 */
#define PIC32_IRQ_DMA3      137 /* DMA Channel 3 */
#define PIC32_IRQ_DMA4      138 /* DMA Channel 4 */
#define PIC32_IRQ_DMA5      139 /* DMA Channel 5 */
#define PIC32_IRQ_DMA6      140 /* DMA Channel 6 */
#define PIC32_IRQ_DMA7      141 /* DMA Channel 7 */
#define PIC32_IRQ_SPI2E     142 /* SPI2 Fault */
#define PIC32_IRQ_SPI2RX    143 /* SPI2 Receive Done */
#define PIC32_IRQ_SPI2TX    144 /* SPI2 Transfer Done */
#define PIC32_IRQ_U2E       145 /* UART2 Fault */
#define PIC32_IRQ_U2RX      146 /* UART2 Receive Done */
#define PIC32_IRQ_U2TX      147 /* UART2 Transfer Done */
#define PIC32_IRQ_I2C2B     148 /* I2C2 Bus Collision Event */
#define PIC32_IRQ_I2C2S     149 /* I2C2 Slave Event */
#define PIC32_IRQ_I2C2M     150 /* I2C2 Master Event */
#define PIC32_IRQ_CAN1      151 /* Control Area Network 1 */
#define PIC32_IRQ_CAN2      152 /* Control Area Network 2 */
#define PIC32_IRQ_ETH       153 /* Ethernet Interrupt */
#define PIC32_IRQ_SPI3E     154 /* SPI3 Fault */
#define PIC32_IRQ_SPI3RX    155 /* SPI3 Receive Done */
#define PIC32_IRQ_SPI3TX    156 /* SPI3 Transfer Done */
#define PIC32_IRQ_U3E       157 /* UART3 Fault */
#define PIC32_IRQ_U3RX      158 /* UART3 Receive Done */
#define PIC32_IRQ_U3TX      159 /* UART3 Transfer Done */
#define PIC32_IRQ_I2C3B     160 /* I2C3 Bus Collision Event */
#define PIC32_IRQ_I2C3S     161 /* I2C3 Slave Event */
#define PIC32_IRQ_I2C3M     162 /* I2C3 Master Event */
#define PIC32_IRQ_SPI4E     163 /* SPI4 Fault */
#define PIC32_IRQ_SPI4RX    164 /* SPI4 Receive Done */
#define PIC32_IRQ_SPI4TX    165 /* SPI4 Transfer Done */
#define PIC32_IRQ_RTCC      166 /* Real Time Clock */
#define PIC32_IRQ_FCE       167 /* Flash Control Event */
#define PIC32_IRQ_PRE       168 /* Prefetch Module SEC Event */
#define PIC32_IRQ_SQI1      169 /* SQI1 Event */
#define PIC32_IRQ_U4E       170 /* UART4 Fault */
#define PIC32_IRQ_U4RX      171 /* UART4 Receive Done */
#define PIC32_IRQ_U4TX      172 /* UART4 Transfer Done */
#define PIC32_IRQ_I2C4B     173 /* I2C4 Bus Collision Event */
#define PIC32_IRQ_I2C4S     174 /* I2C4 Slave Event */
#define PIC32_IRQ_I2C4M     175 /* I2C4 Master Event */
#define PIC32_IRQ_SPI5E     176 /* SPI5 Fault */
#define PIC32_IRQ_SPI5RX    177 /* SPI5 Receive Done */
#define PIC32_IRQ_SPI5TX    178 /* SPI5 Transfer Done */
#define PIC32_IRQ_U5E       179 /* UART5 Fault */
#define PIC32_IRQ_U5RX      180 /* UART5 Receive Done */
#define PIC32_IRQ_U5TX      181 /* UART5 Transfer Done */
#define PIC32_IRQ_I2C5B     182 /* I2C5 Bus Collision Event */
#define PIC32_IRQ_I2C5S     183 /* I2C5 Slave Event */
#define PIC32_IRQ_I2C5M     184 /* I2C5 Master Event */
#define PIC32_IRQ_SPI6E     185 /* SPI6 Fault */
#define PIC32_IRQ_SPI6RX    186 /* SPI6 Receive Done */
#define PIC32_IRQ_SPI6TX    187 /* SPI6 Transfer Done */
#define PIC32_IRQ_U6E       188 /* UART6 Fault */
#define PIC32_IRQ_U6RX      189 /* UART6 Receive Done */
#define PIC32_IRQ_U6TX      190 /* UART6 Transfer Done */
                         /* 191 -- Reserved */
#define PIC32_IRQ_LAST      190 /* Last valid irq number */


#define WDTCON           PIC32_R( 0x00800 )
#define WDTCONCLR        PIC32_R( 0x00804 )
#define WDTCONSET        PIC32_R( 0x00808 )
#define WDTCONINV        PIC32_R( 0x0080C )

#endif /* _IO_PIC32MZ_H */
